{"task_id": "296", "Question": "This poem is the English translation of a poem by a Chinese poet. Please analyze which Chinese poet it is?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Wang Anshi", "file_name": "296.png", "Answer Explanation": "The original author of this poem is Wang Anshi. This English version is included in Sunflower Splendor (1975) edited by Wu-chi Liu and Irving Yucheng Lo."}
{"task_id": "005", "Question": "Please finish this blank with a name. According to British Society in India under the East India Company, the inebriated British soldiers in India were described “the drinking continued as long as the money lasted.”by______\n\n", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Sergeant Pearman", "file_name": "", "Answer Explanation": "In the words of Sergeant Pearman, “the drinking continued as long as the money lasted.”"}
{"task_id": "313", "Question": "¿Por qué el Comisario Regio decide añadir una nota final comentando el tono de las anotaciones del Sr. Rueda en el expediente de cuentas del Jardín Zoológico?\nA. Porque las observaciones del Sr. Rueda contradecían directamente las conclusiones legales del informe y debían ser anuladas formalmente.\nB. Porque, a pesar de que los reparos contables eran menores, el tono de animosidad en las anotaciones comprometía la imagen de imparcialidad exigida en la administración pública.\nC. Porque se descubrió que el Sr. Rueda tenía conflictos personales con el Director del Museo y el Comisario quiso reflejarlo oficialmente.\nD. Porque el Comisario deseaba sancionar disciplinariamente al Sr. Rueda por haber retrasado la entrega de informes durante seis años.", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "313_1.png;313_2.png", "Answer Explanation": "En su resumen, señaló:\nAunque no es legal que los productos del zoológico no se hayan entregado a las autoridades fiscales, ya se ha obtenido la autorización de las autoridades competentes, por lo que es comprensible;\nel retraso de seis años en la presentación de las cuentas constituye «morosidad excesiva», por lo que se debe aplicar una «suave corrección»;\nlos errores contables no son graves, «muy disculpables», debido a la falta de conocimientos contables del responsable, que solo contaba con la ayuda de un administrativo.\nEl comisario real reconoció en su valoración global que Graells había cometido irregularidades, pero también hizo una interpretación indulgente basándose en el contexto de la autorización y las condiciones reales. En este momento, si las críticas de Rueda se hubieran mantenido en el documento sin comentarios, los lectores podrían haber interpretado erróneamente que existían divergencias más intensas o hostiles dentro del sistema administrativo.\nEn otras palabras, no se trata de una negación de la postura de Rueda, sino de una crítica a su «tono y forma de expresión», especialmente en documentos como los de las finanzas públicas, que pueden dar lugar a interpretaciones políticas, donde un tono excesivo puede ser interpretado por el exterior como lucha partidista o inestabilidad institucional."}
{"task_id": "320", "Question": "What battle scene is depicted in this image？", "Level": 2, "Answer Type": "exactMatch", "Final answer": "The Battle of Milvian Bridge", "file_name": "320.jpg", "Answer Explanation": "The background information of this image is introduced in the attached figure at the end of the article"}
{"task_id": "392", "Question": "Which year did this piece be written?", "Level": 3, "Answer Type": "exactMatch", "Final answer": 870, "file_name": "392.png", "Answer Explanation": "This piece is a 牒式补任文书, as there is red seals on it, from its impression we can find that it was made by 朔方军,so the signiture on the left is 节度使 卢潘, who occupied this position from 867 to 870,and S.6340 indicated that the 招抚使 retreated in 870, so P.3298 was written in 870."}
{"task_id": "328", "Question": "Один профессор однажды сказал в интервью: «Только очень наивный инопланетянин мог бы подумать о землянах как о единой цивилизации. На самом деле он обнаружил бы по меньшей мере девять цивилизаций, в которых есть своя структура.» В частности, он отметил: «Евразийская цивилизация (Россия, Украина, Белоруссия)... Отличается своеобразием социальной психологии народов, образом жизни в труде, быте, досуге. Здесь сложилась особая алкогольная цивилизация с вековыми питейными традициями, невиданными ни на Западе, ни на Востоке. И особая, неслыханная нигде ругань. Невиданная нигде смесь самоотверженности и скандальности, западной культуры и восточного быта. Словом, Азия, но в европейском обличье.» Какой он профессор?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "И. В. Бестужев-Лада", "file_name": "", "Answer Explanation": "Это взято из интервью «Будущее непредсказуемо, но предвидимо»."}
{"task_id": "277", "Question": "In this 1912 letter sent to Sun Zhuang by Peng Yizhong (who was engaged in the newspaper business in Beijing in the early Republican period of the late Qing Dynasty), what specifically is the Patriotic Newspaper that the author asks his friend to continue to send?(For answers, please use the language referred to in the material)", "Level": 2, "Answer Type": "exactMatch", "Final answer": "正宗爱国报", "file_name": "277.jpg", "Answer Explanation": "Peng Yizhong was an important figure in the newspaper industry in Beijing during the late Qing Dynasty and early Republican period. At this time, he was exiled in Xinjiang, while his business partners continued to run newspapers in Beijing, of which the authentic patriotic newspaper founded by Ding Baochen, a member of the Hui ethnic group, was the main representative.Authentic Patriotic Newspaper since its inception in 1906, has been continued until after the Republic of China, the early Republic of Beijing politics have reported, at this time living in Xinjiang, the author, very much need to rely on this friend of the newspaper founded to obtain the news of the Beijing area.\n"}
{"task_id": "208", "Question": "According to Graeme J. N. Gooday and Morris F. Low's paper in 1998,in the early Meiji era, how many of the foreigners employed in Japan were generally Chinese day-laborers?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 4000, "file_name": "", "Answer Explanation": "In the early years of the Meiji period there were generally around eight thousand hired foreigners in Japan, about half of whom were Chinese day-laborers, and only about three thousand professionals in government service."}
{"task_id": "332", "Question": "Who is the commander of the troop shown in the photo? [Answer in Russian]", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Николай Кириченко", "file_name": "332.png", "Answer Explanation": "The description of the photo is: soldiers of the 4th cavalry corps under the command of lieutnant general Nikolai Kirichenko on reconnaissance."}
{"task_id": "157", "Question": "Where was this cultural heritage found?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Lchashen", "file_name": "157.png", "Answer Explanation": "According to the source, this pedestal with a flat seat and a hollow body is one of the unique objects discovered from Lchashen, Armenia."}
{"task_id": "223", "Question": "Till the permanent establishment of the Badshahi government, how many annas per day can the horsemen with large horses get as the presents claimed by Oude’s Manifesto ?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "8 annas per day", "file_name": "223.png", "Answer Explanation": ""}
{"task_id": "373", "Question": "图中的器物是在哪个窑口生产的？", "Level": 3, "Answer Type": "exactMatch", "Final answer": "上虞窑", "file_name": "373.png", "Answer Explanation": "图中的堆塑罐是仅出现于东汉晚期到东晋早期的典型丧葬用器。此件为带有龟趺碑自铭器，上可识别字体有“出始宁，用此靈……宜子……”，包含了器物名称、产地和吉语三部分。始宁为汉晋时绍兴上虞一带古地名，也是早期越窑的核心生产地。从多层贴塑等繁复器物造型和吉语习惯可判断为西晋器物，结合同墓地出土的其他带“元康”年号的堆塑罐可以进一步确定其为西晋早期产品器物。"}
{"task_id": "183", "Question": "Who is the supreme commander of this camp?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Charles William Le Gendre", "file_name": "183.jpg", "Answer Explanation": "This photograph is reproduced in 'Notes of Travel in Formosa' by Charles William Le Gendre, edited by Douglas L. Fix and John Shufelt (National Museum of Taiwan History, 2012), on page 72.  General Le Gendre (1830-1899) was the US Consul in Amoy (Xiamen)."}
{"task_id": "340", "Question": "Infer the creation object of this image based on the ornamentation and script style in the document.", "Level": 2, "Answer Type": "exactMatch", "Final answer": "William Grey ", "file_name": "340.png", "Answer Explanation": "This is a set of Latin encyclopedias, consisting of five volumes, possibly from five of the original six volumes (the first volume of the fifth volume is missing).This set of books was created for William Grey (who died in 1478) during his travels in Germany and Italy, and later he became the Bishop of Cambridge.Different copyists and decorators, possibly primarily working in Cologne, demonstrated international influence: Dutch, Italian, English, and even Spanish influence. The initial character and border of the decoration sometimes include Gray's coat of arms."}
{"task_id": "132", "Question": "\tWhich city is charted in the 1881 map shown?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Boston", "file_name": "132.jpg", "Answer Explanation": "/"}
{"task_id": "386", "Question": "File dalam gambar ini kemungkinan besar merekam peristiwa yang terjadi di mana? A. Batavia B. Ambon C. Surabay D. Colombo", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "D. ", "file_name": "386.png", "Answer Explanation": "By closely examine the picture can we find out that it is about \"Paul van Batavia; Engenila van Batavia\", indicating it's Dutch and because of the word \"Batavia\", from the Dutch-East-Indies period of time. Searching in the Dutch data base about Batavia and especially the one containing the marriage issues, can then find the origin of this piece of archive. Hence, being able to tell it is a record of the church Wolvendaalkerk in Colombo."}
{"task_id": "323", "Question": "墓主大隋武川国大夫人乞伏氏的第二个儿子叫什么？提示：儿子随父姓，乞伏氏的丈夫姓“娄”。", "Level": 2, "Answer Type": "exactMatch", "Final answer": "娄诠", "file_name": "323.png", "Answer Explanation": "大隋武川国大夫人乞伏之墓志：“第二子诠”"}
{"task_id": "009", "Question": "Please finish this blank with only a word.The paradigm shift towards the unity of regard, ______ and knowledge in medicine is reflected in Michel Foucault's description of pseudomembranes as “wet parchment membranes” and “protein membranes”.", "Level": 1, "Answer Type": "exactMatch", "Final answer": "discourse", "file_name": "", "Answer Explanation": "“Modern medicine has fixed its own date of birth as being in the last years of the eighteenth century. Reflecting on its situation, it identifies the origin of its positivity with a return — over and above all theory — to the modest but effecting level of the perceived. In fact, this supposed empiricism is not based on a rediscovery of the absolute values of the visible, nor on the predetermined rejection of systems and all their chimeras, but on a reorganization of that manifest and secret space that opened up when a millennial gaze paused over men's sufferings. Nonetheless the rejuvenation of medical perception, the way colours and things came to life underthe illuminating gaze of the first clinicians is no mere myth. At the beginning of the nineteenth century, doctors described what for centuries had remained below the threshold of the visible and the expressible, but this did not mean that, after over-indulging inspeculation, they had begun to perceive once again, or that they listened to reason rather than to imagination; it meant that the relation between the visible and invisible-which is necessary to all concrete knowledge-changed its structure, revealing through gaze and language what had previously been below and beyond their domain. A new alliance was forged between words and things, enabling one to see and to say. Sometimes, indeed, the discourse was so completely ‘naive’ that it seems to belong to a more archaic level of rationality, as if it involved a return to the clear, innocent gaze of some earlier, golden age.”"}
{"task_id": "262", "Question": "What's the name of the man in this picture?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Gamal Abdel Nasser", "file_name": "262.png", "Answer Explanation": "Gamal Abdel Nasser (January 15, 1918 – September 28, 1970) was the second President of Egypt, serving from 1956 until his death in 1970. Nasser led the July 23, 1952 Revolution, which overthrew King Farouk, marking the beginning of a new era in Egypt's history. He was a strong supporter of Arab nationalism and an opponent of colonialism, backing Arab revolutions in Algeria, Libya, Iraq, and Yemen. He also played a key role in founding the Palestine Liberation Organization (PLO) in 1964 and the Non-Aligned Movement. He served as Prime Minister twelve times."}
{"task_id": "102", "Question": "Judging from Eugene Bestor, Jr.'s book Backwoods Utopias: The Sectarian and Owenite Phases of Communitarian Socialism in America: 1663-1829, which community's defeat was Owenite's the first defeat in the United States? A. Cooperating Society of Alleghany County  B. Yellow Springs Community  C. Blue Spring Community  D. Preliminary Society\n", "Level": 1, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "", "Answer Explanation": "In 1825, the Yellow Springs Community disbanded due to internal conflict. It \"was actually the first failure of an Owenite enterprise in America\".\n"}
{"task_id": "254", "Question": "This is an oral history interview with veterans who have retired from a certain war. May I ask which war this is about?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Vietnam War", "file_name": "254.mp3", "Answer Explanation": ""}
{"task_id": "281", "Question": "请判断这组图像的年代：A.春秋早期 B.战国中晚期 C.西汉早期 D.东汉中晚期 E.三国中晚期", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "E", "file_name": "281.png", "Answer Explanation": "本图为南京长岗村M5出土的一件釉下彩盘口壶外壁图案的展开图。图像在延续了东汉以来兴盛的画像石艺术风格和先秦以来陶器、漆器的装饰艺术基础上，结合瓷器外形特征巧妙呈现。图像元素包括铺首衔环、背光佛像、持节羽人、比翼鸟、仙草等珍奇祥瑞，其中部分元素在汉代已有出现，三国时期佛道宗教思想盛行的时代背景下，东吴统治者又喜欢用祥瑞确立自身政权的正统性，进而出现了将多种祥瑞和宗教元素组合绘制在瓷器上的现象，该类釉下彩绘瓷目前仅见于南京、马鞍山地区东吴中晚期较高规格的遗存中。"}
{"task_id": "152", "Question": "谥号“文敬”的有几个人？", "Level": 1, "Answer Type": "exactMatch", "Final answer": "3个", "file_name": "152.png", "Answer Explanation": "图片第四列，对照“文敬”，可知有三个人。"}
{"task_id": "115", "Question": "In which section of Book XV of the Alexiad is the Bogomil trial scene described? (Answer Format: starting chapter - ending chapter)", "Level": 1, "Answer Type": "exactMatch", "Final answer": "9.2-5", "file_name": "", "Answer Explanation": "p.432.Summary"}
{"task_id": "092", "Question": "This drawing, from a Ming Dynasty medical book on pharmaceuticals, depicts a conversation between the mythical figure Yellow Emperor and his disciples. Based on the history of Chinese medicine, could you identify which of the Yellow Emperor's disciples listened to in the picture? A.LeiGong \nB.QiBo \nC.BoGao \nD.ShaoYu ", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "092.png", "Answer Explanation": "Shou shu tu (Illustration of the Yellow Emperor transmitting the books)', from Buyi Lei Gong paozhi bianlan (Supplement to Lei Gong's Guide to the Preparation of Drugs), edition of 1591 (19th year of the Wanli reign period of the Ming dynasty), is a fine example of Ming book art. The Yellow Emperor (Huangdi) is shown presenting books containing medical knowledge to Lei Gong, the Thunder Duke. The scene unfolds outdoors. The Yellow Emperor is seated beneath a yellow canopy in the shade of a pine tree, flanked by four civil and military officials. Lei Gong prostrates himself at his feet. To his right, books and other largesse are laid out on tables. The picture is inspired by a passage in Suwen: Zhu zhi jiao lun (Plain Questions: On the Transmission of the Teachings), from the Inner Canon of the Yellow Emperor: 'When the Yellow Emperor was seated in The Hall of Brightness, he summoned Lei Gong and questioned him'. After this, he transmitted the knowledge of medicine to Lei Gong. It should be noted that the clothing and personal adornment of the figures in the picture as well as the format and binding of the books all belong to the Ming period."}
{"task_id": "308", "Question": "After the completion of a provincial examination in Zhejiang during the Ming dynasty, someone remarked: 'In Zhejiang, hundreds of candidates compete for the position of scholar, yet only about forty are admitted, meaning many are restricted by their examination scores and unable to advance. How can we know that other regions do not have untapped talent?' Which period is this person most likely from?\n\nA. Hongwu (1368-1398)\nB. Yongle (1403-1424)\nC. Chenghua (1465-1487)\nD. Jiajing (1522-1566)\n", "Level": 2, "Answer Type": "exactMatch", "Final answer": "A", "file_name": "", "Answer Explanation": "段话提到“充贡者不过四十人”，指的是乡试解额只有40名，洪武三年开科诏，定浙江乡试解额40名，故选A。\n洪熙元年（1425），定各省解额新方案，浙江解额已提升为45名，因此CD选项不对。明代解额变动，参考汪维真《明代乡试解额制度研究》（社会科学文献出版社，2009年）。\n这句话实际出自浙江上虞人夏时，作于洪武三年送同邑举子赴京会试之时（夏时：《守黑斋遗稿》卷4《送何钟王叶赵五进士赴春闱诗序》，收《明别集丛刊》第1辑第36册，黄山书社，2013年，第233页。）"}
{"task_id": "002", "Question": "Please finish these blanks with numbers.\nIn Manchester, according to the police statistics of 1841, there were some____ lodging-houses where people of both sexes slept indiscriminately; and there were____ mendicant lodging-houses.\n", "Level": 1, "Answer Type": "exactMatch", "Final answer": "109;91", "file_name": "", "Answer Explanation": "Common sense."}
{"task_id": "346", "Question": "How much did the buyer pay for this land?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "One tael and seven qian of copper coins.", "file_name": "346.png", "Answer Explanation": "According to the \"buying price of one tael and seven mace of copper coins\" shown in the picture."}
{"task_id": "312", "Question": "4.材料を見て、南洋興発株式会社が導入した甘蔗品種161POJがどのように育成されたかを指摘してください。\n\nA.Loethersを父系とし、Black Billitonを母系として育てられた。\nB.Channeeを父系とし、Striped Preangerを母系として育てられた。\nC.Channeeを父系とし、Black Chribonを母系として育てられた。\nD.Loethersを父系とし、Bandjarmasinhitamを母系として育てられた。", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "312.png", "Answer Explanation": "『糖業便覧』の211ページを読むと、161POJはChanneeを父系とし、Black Chribonを母系として育てられたことがわかります。だから本題の正解は「C」です。"}
{"task_id": "305", "Question": "鎮江から出発して、南京の浦口を経て、安徽省蕪湖までの航路の中で、日本軍の遡江作戦が出会った問題の一つは次のどれですか。\nA、作戦地図の不正確さです\nB、海軍と陸軍の対立です\nC、軍事費と物資の大不足です\nD、水先案内人員が不足し、航行に支障が出ました", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "D", "file_name": "305.pdf", "Answer Explanation": "225ページに「水先案内人ノ不足」という一文があります"}
{"task_id": "127", "Question": "To whom was the flood management order delivered?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Chen Dawen", "file_name": "127.png", "Answer Explanation": "Judging based on files information."}
{"task_id": "282", "Question": "请判断图片中器物隶属于商周时期哪一诸侯国？", "Level": 2, "Answer Type": "exactMatch", "Final answer": "弓鱼国", "file_name": "282.JPG", "Answer Explanation": "图片为宝鸡（弓鱼）国墓地茹家庄M1甲室出土的五鼎四簋中的列鼎，口内均带铭文“儿”。本组器物为现所见最早的西周列器案例之一。西周早期中原地区青铜器主流造型风格一定程度延续了商代晚期的繁缛特征，且鼎簋通常单件使用，尚未流行列器礼制。而（弓鱼）国墓地出土的这组儿鼎整体装饰素净不见装饰，使用环形立耳，造型扁圆，质地较差，制作粗糙，和中原一带主流青铜器风格迥然，带有浓厚的地方特色。"}
{"task_id": "051", "Question": "What's the name of this painting?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Сказание о Семике и Масленице", "file_name": "051.png", "Answer Explanation": "Лубочная картинка «Сказание о Семике и Масленице». Неизвестный художник. 1840-е гг.\nАвтор, мастер/Изготовитель: Неизвестный художник\nНазвание: Лубочная картинка «Сказание о Семике и Масленице».\nДатировка: 1840-е гг.\nРазмер: 42,1х66,9 см; 35,3х52,2 см\nМатериал, техника: Бумага, гравюра резцом, раскраска\nИнвентарный номер: И III хром 6134\nНомер ГИМ: ГИМ 38694\nНомер ГК: 28467545\nОтдел/коллекция: Изобразительные материалы/Печатная графика \nКлючевые слова: гравюра резцом; гравюра "}
{"task_id": "284", "Question": "Which historical ethnic group did this piece refer to? [Answer in Chinese]", "Level": 2, "Answer Type": "exactMatch", "Final answer": "嗢末", "file_name": "284.jpg", "Answer Explanation": "This poem was composed in the ninth year of Xiantong(868A.D.), by renowned monk Wuzhen(悟真), to an official in Liangzhou/Guzang(凉州), where Tubo retreated in 848, and left their slaves(Wamo) ."}
{"task_id": "144", "Question": "By 1640, how many Britons had emigrated to sugar and tobacco colonies?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 52000, "file_name": "", "Answer Explanation": "The number of people mentioned on page 10 of the article is about 52000"}
{"task_id": "261", "Question": "Which man in this painting represents the sense of sight?In that painting, from left to right, what person represents vision? First, second, third, or fourth?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "First", "file_name": "261.png", "Answer Explanation": "Each man in this painting symbolizes one of the five senses. The old man holding a frame with a mirror represents Sight. The mirror, often used symbolically in art to represent vision or perception, indicates that this figure is associated with sight, as the mirror directly correlates to vision and how we see the world."}
{"task_id": "114", "Question": "Who narrated the Bogomil trial scene discussed in Elisabeth Mincin's article?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Anna Komnene", "file_name": "", "Answer Explanation": "p.432.Summary"}
{"task_id": "016", "Question": "Please finish the blank with a number.\nIn the 1945 election, polls indicated that ____per cent of the electorate supported an anti-Conservative popular front, an attitude the Mirror reflected in an election endorsement which, as King noted, ‘came out very definitely on the Labour–Liberal side’ rather than specifically for Labour.", "Level": 1, "Answer Type": "exactMatch", "Final answer": 55, "file_name": "", "Answer Explanation": "Polls indicated that 55 per cent of the electorate supported an anti-Conservative popular front, an attitude the Mirror reflected in an election endorsement which, as King noted, ‘came out very definitely on the Labour–Liberal side’ rather than specifically for Labour.\n\n"}
{"task_id": "118", "Question": "Who is the person shown in this photo?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Harry Jerele", "file_name": "118.png", "Answer Explanation": "According to the Defense POW/MIA Accounting Agency (DPAA), U.S. Army Private 1st Class Harry Jerele, 26, of Berkeley, Illinois, who was captured and died as a prisoner of war during World War II, was accounted for December 20, 2023. The original source provides this photo and other information."}
{"task_id": "216", "Question": " In the Barabar Hill Cave Inscription of the Maukhari chief Anantavarman,  What his father is described as ?(Answer in Sanskrit）\n  ", "Level": 1, "Answer Type": "exactMatch", "Final answer": "sāmanta-cīdāmaniḥ", "file_name": "", "Answer Explanation": "The first epigraphic mention of the term sāmanta in the sense of a feudatory is found in the Barabar Hill Cave Inscription of the Maukhari chief Anantavarman, in which his father is described as “sāmanta-cīdāmaniḥ”, (“the best among feudatories”）"}
{"task_id": "007", "Question": "Please finish this blank with a number.\nThe Ottoman Empire’s population in 1820 (excluding Egypt and Romania) was approximately ________ million.\n", "Level": 1, "Answer Type": "exactMatch", "Final answer": 21, "file_name": "", "Answer Explanation": "The 1820 population of the Empire(excluding Romania and Egypt) was around 21 million or about 2 per cent of the world population"}
{"task_id": "214", "Question": "According to Dutch fishermen ,how much live eels did the buy in July 1827 in holds to Gravesend?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "110000 pounds", "file_name": "", "Answer Explanation": "Dutch fishermen claimed that in July 1827 they had brought 110,000 pounds of live eels in holds to Gravesend, but two thirds died in the ships' wells before they reached the London market through contact with Thames water. "}
{"task_id": "078", "Question": "了譽聖冏が『麗気記私鈔』巻十一に秘せられた四智鈴図にあたると考えた図像は、『麗気記神躰図』にどう呼ばれたか？", "Level": 3, "Answer Type": "exactMatch", "Final answer": "九尊三形曼荼羅", "file_name": "", "Answer Explanation": "了譽聖冏『麗気記私鈔』巻十一には「此の下に瑜祇不二の図これあり、今これを指して『一輪中四智鈴等』といふか（云々）」と主張した。聖冏がこの図を具体的に形容しているとき、「謂、一輪の中の九輪は、胎蔵八葉九尊表形なり」、また「中輪中に、方形あり、方形の中に円形あり、団・円二形に通ず、その円形の中に三角形あり、その三角形の傍らのはづれの處より下の円形の少し見ゆるは半月形なり」と述べている。『麗気記神躰図』之中に聖冏の記述とぴったりと合致する図像のはこの「九尊三形曼荼羅」と呼ばれる図像にほかない。関連研究は鈴木英之「了誉聖冏の神道図像学：『麗気記私鈔』『麗気記神図像私鈔』の考察から」（『日本思想史学』、第41号、2009）参照。"}
{"task_id": "383", "Question": "What was the most possible reason that the letter's author mentioned sending his report to the Naval Committee?\nA.He worried about the event he learnt from papers that threatened the country, and thought the report would be helpful to the congress before it adjourned.\nB.He thought the report could help his friend, the recipient of the letter become the secretary again, as Commodore Downes and other officers wished.\nC.He hoped the report would help the congress carry forward an enterprise to which the ship Peacock could have been sent to, but hindered by political opponents of the recipient.", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "383.pdf", "Answer Explanation": "We can infer from the first page that author was sent to the Pacific, so his report should pertain to this voyage, which can't be very helpful to restore the whole country. He delivered congratulations on the recipient's election as senator, and it is not likely that the recipient would like to reappointed as secretary immediately. The author mentioned the unsuccessful plan of sending Peacock to the South Seas and indicated that he is more anxious than ever to go on that enterprise. So C is the correct answer."}
{"task_id": "224", "Question": "What is the average Danish turnover of General Motors and Ford Motor Cars from 1936 to 1940?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 755871.2, "file_name": "224.png", "Answer Explanation": ""}
{"task_id": "285", "Question": "What book does this map come from? ", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Yugong shanchuan dili tu", "file_name": "285.png", "Answer Explanation": "Yugong shanchuan dili tu was depicted in the fourth year of Chunxi (1177), which includes maps illustrating elements from Shuijing zhu. "}
{"task_id": "142", "Question": "In which year did Matthew de Moranville claim that he had been arrested by the Royal Marshals for being at a murder scene about forty years prior", "Level": 1, "Answer Type": "exactMatch", "Final answer": 1247, "file_name": "", "Answer Explanation": "On page 1067 of the paper, it is mentioned that this incident occurred in 1247"}
{"task_id": "406", "Question": "Count the proportion of urban construction land use shown in the planning map.(Percentage of answers please)", "Level": 3, "Answer Type": "exactMatch", "Final answer": 0.237, "file_name": "406.JPG", "Answer Explanation": "firstly, AI should tell what kinds of land uses form the urban constructed land use, then calculate the propotion."}
{"task_id": "047", "Question": "Разгадывайте этот документ и переводите берестяные грамоты на русский язык. Из этих переводов какие относительно бесспорные? \nА. От Носка к Местяте. Заозерского отрока в прошлом году купили. Суздалец Ходутинич пусть возьмет две гривны в качестве процентов. \nБ. От Носка к Местяте. Заозерского отрока в прошлом году купили. Суздалец Ходутинич пусть возьмет две гривны на свою долю.\nВ. ѿ носъка къ мѣ‐\nстѧтѣ заожеричъ\nотрокъ лони крили\nсоужъдалъцъ ходоу‐\nтиничъ възъми дъ‐\nвѣ гривънѣ на на‐\nмъ\nГ. От Носька к Местать.Заозерский отрок лони крили. Суздалец Ходот возьми две гривны на нам  ", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "Б", "file_name": "047.png", "Answer Explanation": "Свинцовая грамота No 1 (стратигр. кон. XI ñ 1 треть XII в., внестратигр. предпочт. первое 20-летие XII в.; Нерев. Е). \nГород: Новгород. \nЖанр: частное письмо. \nСодержание: От Носка к Местяте (о денежных делах). \nПисьмо написано на свинцовой пластинке. По способу нанесения букв и по жанру оно столь сходно с берестяными грамотами, что мы считаем возможным рассматривать его в одном ряду с ними(в издании это письмо помещено после берестяной грамоты № 318 — НГБ V: 154-155). \nВ разгадывании этой исключительно трудной грамоты участвовало много исследователей; история ее изучения подробно рассмотрена в статье Мароевич 1996. Там же предложена если и не совершенно бесспорная, то во всяком случае наиболее успешная, с нашей точки зрения, из многочисленных конкурирующих интерпретаций этой грамоты (которой мы и следуем ниже). В ней использованы наиболее надежные элементы предшествующих решений и предложена новая трактовка заключительной фразы. \nПеревод: ‛От Носка к Местяте. Заозерского отрока в прошлом году купили. Суздалец Ходутинич пусть возьмет две гривны в качестве процентов’. \nО других возможных интерпретациях см. указанную статью."}
{"task_id": "032", "Question": "上野益三の研究とこの図表に基づき、著者が定義した「前大和本草時代」において、どの種類の博物学著作が一番盛況に出版されたか？A. 狭義の「本草学」B. 「食物本草」類 C. 「名物」類D. 「救荒」類 E. 様々な博物学の著作が比較的均衡に出版された", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "032.png", "Answer Explanation": "第105-106ページの記述に基づき、著者が定義した「前大和本草時代」（1600-1700年）の間、図表を参照すると、この時期、狭義の「本草学」著作の刊行数は、「食物本草」や園芸本草などの他のカテゴリを上回っていた。"}
{"task_id": "329", "Question": "Studying Catholic and Orthodox religious ideas and practices, which historian came to the conclusion that the \"fraternal movement\" can be considered the result of \"Orthodox confessionalization\"?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "M.V. Dmitriev ", "file_name": "", "Answer Explanation": "О.А. Фефелова, О РОЛИ ШКОЛ ПРАВОСЛАВНЫХ БРАТСТВ В СОЗДАНИИ КИЕВО-МОГИЛЯНСКОЙ КОЛЛЕГИИ В ПЕРВОЙ ТРЕТИ XVII ВЕКА, Вестник ТГПУ. 2007. Выпуск 3 (66). Серия: ГУМАНИТАРНЫЕ НАУКИ (ИСТОРИЯ...): 71"}
{"task_id": "099", "Question": "Finish the blank with a number.\nIronically, the sweet version of this wine, sales of which exploded from 10,000 cases in 1978 to ____ million in 1989, was the accidental result of a stuck fermentation，produced by Sutter Home Winery. (Answer Format: number)", "Level": 1, "Answer Type": "exactMatch", "Final answer": 3.7, "file_name": "", "Answer Explanation": "Rationale:Ironically, the sweet version of this wine, sales of which exploded from 10,000 cases in 1978 to ____ million in 1989, was the accidental result of a stuck fermentation "}
{"task_id": "218", "Question": "What is the assessed wealth of Dupuy,Edmond (a leading black entrepreneur)in New Orleans?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 171000, "file_name": "218.png", "Answer Explanation": ""}
{"task_id": "220", "Question": "How many berths were in the wharf showed in the picture?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 2, "file_name": "220.png", "Answer Explanation": "Before 1920,there were only two berths."}
{"task_id": "188", "Question": "What is the name of this bridge today?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "The Jiefang Bridge/The Liberation Bridge", "file_name": "188.png", "Answer Explanation": "This photo is a promotional photo of “North China Transportation Co., Ltd.” on a postcard. On the postcard are the words “Wanguo Bridge”, “Tianjin”, and “March (Showa) 13'”.On January 25, 1949, Wanguo Bridge was renamed Liberation Bridge."}
{"task_id": "034", "Question": "村松哲文の研究によれば、宋元時代の中国で描かれた達磨図には如何なる共通する表現が見出せるのか？（単一回答）選択肢：（1）三白眼で眼を開き、赤衣をまとい、口髭と顎髭をたくわえ、大きな耳を表して耳朶にやや大きめのリングをつける（2）三白眼で眼を開き、赤衣をまとい、口髭と顎髭をたくわえ、足にリングをつける（3）三白眼で眼を開き、黒衣をまとい、口髭と顎髭をたくわえ、大きな耳を表して耳朶にやや大きめのリングをつける（4）三白眼で眼を開き、衣が簡略に描かれ、手の部分が膨らみ、大きな耳を表して耳朶にやや大きめのリングをつける（5）目が閉じたまま、赤衣をまとい、口髭と顎髭をたくわえ、大きな耳を表して耳朶にやや大きめのリングをつける", "Level": 2, "Answer Type": "multipleChoice", "Final answer": 1, "file_name": "034.pdf", "Answer Explanation": "村松哲文「日本における達磨図の展開：白隠と風外慧薫に共通すること」（『駒澤大學佛教文學研究』、第22巻（2019）、p.150）は、宋元時代に於ける代表的な画家の四人（北宋・李公麟、南宋・馬麟、元・牧渓、元・顔輝）の達磨図の特徴を比較し、四つの共通点があるとの結論に至った。"}
{"task_id": "369", "Question": "Which literary work's translation is shown in the picture?", "Level": 3, "Answer Type": "exactMatch", "Final answer": "Much Ado About Nothing", "file_name": "369.png", "Answer Explanation": "The picture shows an excerpt from Zhu Shenghao's manuscript translation of William Shakespeare's Much Ado About Nothing."}
{"task_id": "333", "Question": "Why were the officials mentioned in the imperial edict demoted?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Rashly impeach\nother officials", "file_name": "333.jpg", "Answer Explanation": "The original text mentions:“非因公贻误，实因小有疏失，率行参劾，奏请严议”（It was not due to a failure in their public duties, but rather because of minor errors that they hastily impeached {{and}} requested severe deliberation.）"}
{"task_id": "237", "Question": "On July 14, 1945, Doctor Victor Hoo mentioned which Chinese politician when talking to Mr. Roberts A :T. V. Soong.\nB：Bingchang Fu\nC：Chiang Ching-kuo\nD：Chiang Kai-shek\nE：Zhou Enlai\nF：Mao Zedong G:Wang Shijie", "Level": 2, "Answer Type": "exactMatch", "Final answer": "A", "file_name": "", "Answer Explanation": "According to the archives ，Mr. Roberts reported in detail on T.V. Soong's movements：\nSoong left Moscow this morning and expects to be in Chungking on July 16th.He intends to return to Moscow and resume his conversations with Stalin after Terminal.Meanwhile Doctor victor Hoo is staying in Moscow for further talks with soviet officials in preparation for Soong’s return visit.\n2 Doctor Hoo told me this morning at the airfield that Soong might then go to London from Moscow although he had not yet been able to make definite plans.\n3 Greatest discretion is being maintained here about Soong’s visit on which His    Majesty’s  Ambassador is reporting personally at Terminal."}
{"task_id": "112", "Question": "\tFrom which region of the world is this letter?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Bosnia and Herzegovina", "file_name": "112.jpg", "Answer Explanation": "Letter to Pavasovich, serdar of Shibenik and Skradin kapitenias (provinces). 1135 A.H./1722 - 1723 A.D. 1 f., 305 x 209 mm, paper. Coll. 67. Berchich. No. 62."}
{"task_id": "107", "Question": "Finish the blank with a pharse: Zeitlin asserts that, as scientific progress occurred, the concept of universality was further expanded beyond the idea of the universal validity of _______.", "Level": 1, "Answer Type": "exactMatch", "Final answer": " the laws of nature", "file_name": "", "Answer Explanation": "Zeitlin asserts that, as scientific progress occurred, the concept of universality was further expanded beyond the idea of the universal validity of the laws of nature. "}
{"task_id": "252", "Question": "\tWho gave the experience report recorded in this audio?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Fred Engst", "file_name": "252.mp3", "Answer Explanation": ""}
{"task_id": "219", "Question": "Where does this picture come from?（At least provide the title of the paper, the author, the publication journal, the issue number and the page numbers.）", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Pennsylvania,vol.132,p.322,R.G.Dun&Company Collection,Baker Library,Harvard Business School", "file_name": "219.png", "Answer Explanation": "In this paper(Racism, Slavery, and Free Enterprise: Black Entrepreneurship in the United States before the Civil War),the picture is cited from\"Pennsylvania,vol.132,p.322,R.G.Dun&Company Collection,Baker Library,Harvard Business School\""}
{"task_id": "004", "Question": "Please finish this blank with a number.\nBetween 1840 and 1913, Ottoman imports grew at approximately ________% per annum.", "Level": 1, "Answer Type": "exactMatch", "Final answer": 3.3, "file_name": "", "Answer Explanation": " Furthermore, the biggest rise took place between 1800 and 1860----3.3 percent per annum? precisely the decades of most dramatic de-industrialization."}
{"task_id": "395", "Question": "Who is identifiable as a former owner of the book according to its binding?", "Level": 3, "Answer Type": "exactMatch", "Final answer": "Charles II of England", "file_name": "395.HEIC", "Answer Explanation": "The monogram 'C.C.' and the crown at each corner of the book suggests that this copy was bound for Charles II of England. The binding also matches the styles of Samuel Mearne, who once served as the king's binder."}
{"task_id": "299", "Question": "Selon Raymond Aron dans La paix et la guerre entre les nations, laquelle des affirmations suivantes concernant le marché mondial est correcte ?\nA) La domination monétaire du dollar n'est pas le résultat de la suprématie militaire des États-Unis\nB) La domination monétaire du dollar n'est que le produit secondaire de la suprématie militaire des États-Unis\nC) Le marché mondial n'a pas besoin d'une monnaie supranationale pour compenser le manque d'or\nD) Les décisions majeures prises par les États-Unis dans le système international sont motivées par des raisons économiques\nE) Après la guerre, l'écart de niveau de vie entre les Européens et les Américains a continué de se creuser", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "", "Answer Explanation": "\"Encore une fois, j'ouvre une parenthèse : quelles remarques sur les relations entre le système interétatique et le marché mondial sont-elles suggérées par les analyses précédentes ? En gros, le règne monétaire du dollar ne constitue pas un effet ou un sous-produit de la prédominance militaire des États-Unis, en ce sens que le marché mondial ne pouvait pas se passer d'une monnaie transnationale et qu'en l'absence de l'or, seule la monnaie américaine pouvait jouer ce rôle. Tant que le dollar demeurait lié à l'or, les Européens auraient préféré une politique moins inflationniste des États-Unis, mais ils préféraient ou auraient dû préférer le régime de Bretton-Woods au flottement des taux de change. Bien sûr, la monnaie américaine n'aurait pas joué son rôle sans, en arrière-plan, la puissance militaire ; la livre sterling, au siècle dernier, reposait sur la Royal Navy en même temps que sur l'or. Mais les divers États se sont adaptés plus ou moins bien aux situations créées par la politique économique de Washington.\""}
{"task_id": "018", "Question": "Which of the following options describes the group of frescoes of Il Viaggio dei Magi in a way that can be determined to be true?\nA. Nicholas Cusanus appears in the frescoes\nB. Lorenzo de Medici appears in the frescoes\nC. The frescoes were created in the context of the second last meeting between the Catholic Pope and the Orthodox Patriarch in the fifteenth century\nD. In the frescoes, Cosimo il Vecchio rides a donkey.", "Level": 1, "Answer Type": "mutipleChioce", "Final answer": "D", "file_name": "", "Answer Explanation": ""}
{"task_id": "397", "Question": "Чем являются региональные особенности естественного движения населения в Крыму в период 1932–1933 гг.? \nА. Демографическая катастрофа случилась именно в городах, особенно приморских. Миграционная активность населения в 1933 г. была высокой. Голод не явился причиной массовых миграций местного населения в города. \nБ. Демографическая катастрофа случилась именно в селах. Миграционная активность населения в 1933 г. была высокой. Голод явился причиной массовых миграций местного населения в города.\nВ. Демографическая катастрофа случилась именно в городах, особенно приморских. Миграционная активность населения в 1933 г. была низкой, были запреты на выезд населения. Голод не явился причиной массовых миграций местного населения в города.\nГ. Демографическая катастрофа случилась именно в селах. Миграционная активность населения в 1933 г. была низкой, были запреты на выезд населения. Голод явился причиной массовых миграций местного населения в города.", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "А", "file_name": "", "Answer Explanation": "Такое большое число умерших не местных указывает и на то, что описываемые в работах по голоду 1932–1933 гг. запреты на выезд населения преувеличены, а миграционная активность населения в 1933 г. была очень высокой. Анализ величин смертности по национальным районам Крыма не показывает никакого украинского или какоголибо иного национального «гено цида голодом» в Крыму. Смертность в украинском национальном Ишуньском районе была одинаковой со смертностью в еврейском национальном Фрай дорфском районе и меньше смертности в некоторых русских национальных районах Крыма. Также нет социальной компоненты голода («крестьяноцид») — сельское население Крыма характеризуется достаточно высоким естественным приростом. Самый низкий прирост был в Ялтинском районе и пригородной сельской местности Керчи и Симферополя, где в наибольшей степени постра дало городское население. В целом села Крыма перенесли 1933 г. без демо графической катастрофы, сопровождающейся резким падением естественного прироста населения.\nКроме того, смертность (которая должна расти при падении уровня жизни) до 1931 г. в Крыму не менялась, колеблясь в пределах чуть выше 11 тыс. чел. То есть в случае Крыма наиболее вероятные причины падения рождаемости были связаны с такими социальными преобразованиями, как эмансипация женщин, рост грамотности, распад религиозных семейных и социальных традиций в результате антирелигиозной пропаганды и легализация абортов.51 Также, возможно, в крымских национальных районах традиционный уклад жизни держался гораздо дольше, что и обусловило такой плавный и замедленный демографический переход. И в 1932 г. рождаемость стала расти, что никак не сообразуется с «голодомором» 1932 г. Упала рождаемость только в 1933– 1934 гг., после чего скачком в 1935 г. вышла на уровень конца 1920х гг.\nТаким образом, крымская система загсов в городах в целом справлялась с текущим учетом естественного движения населения, в том числе и приезжих мигрантов. Неполноты охвата или недоучета населения в городах по архивным документам не выявлено. Также не выявлено намеренного сокрытия смертей. Однако на селе загсы работали хуже, в результате чего 23 % населения в ито говую статистику рождаемости и смертности не попало. В связи с этим офици альные показатели рождаемости и смертности в селах Крыма и естественный прирост сельского населения являются заниженными. "}
{"task_id": "155", "Question": "How many people were there in one group of selected prisoners, who would be sent to different areas, given timber, and offered to build huts where they would live, according to Yagoda's Order No. 44428, issued on December 4, 1930?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 1500, "file_name": "", "Answer Explanation": "The original text of the order: группе (1500 чел.) отборных заключенных в разных районах — дать лес и предложить строить избы (разработать проект, можно взять у Аустрина) где они и будут жить."}
{"task_id": "288", "Question": "This is a topography of a tomb epitaph from the Northern Dynasties period in China. The font is in regular script. Please identify these characters from right to left and answer the question about the words mentioned in the topos, what is the first sentence? [Answer using traditional Chinese]", "Level": 2, "Answer Type": "exactMatch", "Final answer": "摇芳桂渚，发彩兰汀。", "file_name": "288.png", "Answer Explanation": "After I identified the traditional Chinese characters in vertical script, I obtained this answer. The rubbing is in the standard handwritten regular script of the Northern Dynasties period, arranged vertically, and the Chinese characters are in traditional form. It is used to test the text recognition and transcription capabilities of the tool for traditional Chinese characters in vertical script.  \"魏使持节侍中开府仪同三司骠骑大将军都督东雍州诸军事东雍州刺史大都督高平郡开国公长孙公妻故顺阳郡君娄氏墓志：\n夫人讳贵华，河南洛阳人，天柱大将军广陵恭王之曾孙，定州刺史巨鹿康公之孙，恒朔二州刺史永平宣公之女。激流以远，标峰乃高，淼成地纪，郁为邦镇。夫人体兹玄之灵，资淑令之美，爰自公宫，嫔兹鼎族，克孝克友，终温且敬。故亦流润闺庭，生光闱室，又居处俭素，服玩不侈，金玉靡用，绮縠弗陈。至若图式铭鉴，罔不具阅，灵像玄言，尤在严敬。永熙难作，天子蒙尘，舅太师文宣王出自近关，奔赴行所。夫先镇陕服，因而迎驾。自兹天路榛芜，王涂圯绝。夫人虑妖乱未以，终违妇义，乃散金假道，冒险言归。时男女五人，佥在蒙幼。夫人以为尽行俱没，孰若舍之有全，遂留两女一男，携持二子，艰苦而至。文宣王以事上闻，翰嘉义节，封顺阳郡君。方期亨运，安此福禄，而过驷难留，行客忽远，春秋卌二，岁次戊午十月十八日薨于长安思玄寺。以大统六年十一月甲戌朔十二日乙酉，迁袝于文宣王之兆。陵谷相贸，丘墓时毁，刊石为言，无绝其美。词曰：\n摇芳桂渚，发彩兰汀。膺兹玄宝，托此妙生。粹仪昭式，玉润金清。中洲逸响，自谷飞声。聿来华邸，风徽有则。苹藻洁敬，丝筠调德。室去雕渝，衣贬文色。无厌井臼，躬劳组织。思媚诸姑，言因穆姒。世道何难，妖祲纷起。离我慈亲，别我爱子。未穷戬谷，遽缺仁祉。身同昼夜，世异今古。卷衣虚幕，严车出祖。芒芒原隰，萋萋宿莽。去日奄忽，以乾坟土。\""}
{"task_id": "021", "Question": "Please finish the blank with a number.In November 1938 sick leave in the Republican Army of Andalusia reached 94 per cent of the total number of absences granted: ____ sick men were evacuated, compared to 13 dead and 138 wounded by enemy fire. ", "Level": 1, "Answer Type": "exactMatch", "Final answer": 2432, "file_name": "", "Answer Explanation": "In November 1938 sick leave in the Republican Army of Andalusia reached 94 per cent of the total number of absences granted: 2,432 sick men were evacuated, compared to 13 dead and 138 wounded by enemy fire.\n"}
{"task_id": "141", "Question": "How many bishops attended the Lateran Council presided over by Innocent III on November 11, 1215", "Level": 1, "Answer Type": "exactMatch", "Final answer": 417, "file_name": "", "Answer Explanation": "In the first paragraph of the article, it is mentioned that 417 bishops attended the Grand Council"}
{"task_id": "052", "Question": "From which city might the bamboo slips in the image above have been unearthed?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Chengdu", "file_name": "052.png", "Answer Explanation": "Tianhui Medical Bamboo Slips "}
{"task_id": "150", "Question": "德函公的二哥的儿子叫什么名字？", "Level": 1, "Answer Type": "exactMatch", "Final answer": "方豫", "file_name": "150.png", "Answer Explanation": "德函公有兄弟三人，二哥（“仲”）名为元逊，字益斋，益斋的孤子叫“方豫”。原文表述为：德函公兄弟三人：长讳元阔，字亮夫，癸卯举人；仲讳元逊，字益斋，邑庠生，方伯仲之偕其配以没也。并有孤子：亮夫公之孤曰方泰，方七岁；益斋公之孤曰方豫，方六岁。"}
{"task_id": "190", "Question": "What year was this bookstore founded?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 1881, "file_name": "190.png", "Answer Explanation": "This photo is a promotional photo of “North China Transportation Co., Ltd.” on a postcard. On the postcard are the words “Longfu Temple Bookstore(Wenkuitang)”, “Beijing”, and “February (Showa) 20'”.Wenkuitang is a century-old bookstore that carves, prints, and sells ancient and used books, and was founded in 1881."}
{"task_id": "106", "Question": "Finish the blank with a phrase: According to Ernst Cassirer, the greatest legacy that the Church inherited from Antiquity (especially through Neoplatonism) is the notion of the________.", "Level": 1, "Answer Type": "exactMatch", "Final answer": "graduated cosmos", "file_name": "", "Answer Explanation": "According to Ernst Cassirer, the greatest legacy that the Church inherited from Antiquity (especially through Neoplatonism) is the notion of the graduated cosmos. "}
{"task_id": "138", "Question": "Who gave the speech recorded in this file?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Charles de Gaulle", "file_name": "138.mp3", "Answer Explanation": "On 26 March 1962, in a radio and television broadcast, the French President, Charles de Gaulle, urges the population to support the French Government’s Algerian policy and endorse the ceasefire and self-determination in Algeria.\nLe 26 mars 1962, le président de Gaulle prononce une allocution radiodiffusée et télévisée dans laquelle il exhorte la population française à soutenir la politique algérienne du gouvernement français et à adopter le cessez-le-feu et l'autodétermination en Algérie."}
{"task_id": "153", "Question": "Who is this person in the photo? [Answer in Russian]", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Харазия Семен Константинович", "file_name": "153.png", "Answer Explanation": "Known from the source material."}
{"task_id": "071", "Question": "Which battle is the most likely background for this bamboo bamboo slip? A. 城濮之战 B. 鄢陵之战 C. 笠泽之战 D. 平阴之战 E. 长勺之战 F. 邲之战 G. 泓水之战", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "071.png", "Answer Explanation": "This is a bamboo slip from the Chu state during the Warring States period, which is kept by Tsinghua University. It means \"天以越邦赐吴，吴弗受\".It reflects the war between 吴 and 越, with the most likely background being 笠泽之战."}
{"task_id": "042", "Question": "This map depicts China during the Qing Dynasty. There are three rivers, the upper, middle and lower.\nWhich of these rivers is the upper one?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Lancang River", "file_name": "042.png", "Answer Explanation": "Explanation: The map shows west on the top and east on the bottom. The upper river is east of “Old Prefecture” and west of “Prefecture Office”, which is the Lancang River. The middle river is the Wiry River, which is east of “State Office” and west of “Nodeng”. The lower river is the Wiry River to the east of “Guanping” and “Arrow Field”. In addition, the size of the river shows that the biggest river is the Lancang River. (Wiry River and Straw River are both tributaries of the Lancang River.)\n\n"}
{"task_id": "133", "Question": "\tWhat building is highlighted by the red circle on the 1881 map?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "\tOffice of the Boston Journal", "file_name": "133.jpg", "Answer Explanation": "/"}
{"task_id": "368", "Question": "Hoeveel Oost-Indische voorwerpen worden er in het manuscript genoemd?", "Level": 3, "Answer Type": "exactMatch", "Final answer": 4, "file_name": "368.png", "Answer Explanation": "identify 17th-century manuscripts\"Op de Kunst Caemer \nTwee aardt clooten\nEen doosien met mineraelen\nEen colommetien\nEen tinne pottien\nEen pissent kintie\nTwee Oostindische backiens\nEen dito nap met een sineessien\nEen beelt van een keijserin\nEen Oostindische poeijer doos\nEen beelt vande keijser Augustus\nEen Indies koppie\nEen beelt van Tiberius \nEen Oostindische naeydoos\nEen tronie van Caijus\nEen Caligula\nTwee porcelijne Cazuwarisen\nEen Heraclites \nTwee porcelijne beeltiens\nEen Nero\nTwee Isere helmetten\nEen Japanse hellemet\""}
{"task_id": "154", "Question": "Which city was this piece of newspaper publish in?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Azov", "file_name": "154.jpg", "Answer Explanation": "According to the source, this newspaper was published in Azov, Rostov Oblast, in 1914."}
{"task_id": "273", "Question": "In which direction of the island is the harbor area located that George F. Emmons surveyed in 1839?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "North-east", "file_name": "273.jpg", "Answer Explanation": "The map sketch was drawn when George F. Emmons was surveying Saluafata harbor on Upolu Island in 1839."}
{"task_id": "080", "Question": "What religious text is this?A. Judaism, Zohar B. Buddhism, Prajñāpāramitāhṛdaya C. Hinduism, Ṛgveda D. Zoroastrianism, Avesta E.Manichaeism, Šābuhragān F. Christianism, Gospel of Mark", "Level": 3, "Answer Type": "Multiple Choice", "Final answer": "E", "file_name": "080.png", "Answer Explanation": "This manuscript is written in Middle Persian with Manichaen script. Some transliterations and translations read as: x[rd]yšhr yzd pswx ’wẖ. And God Xradešahr will answer them so… (The God's name and the content of judgement can be served as hints)"}
{"task_id": "111", "Question": "Which following is true about Siger of Brabant and Boethius of Dacia?\nA. The philosophical movement they participated in is active mainly in Paris Arts Faculty in the 1250s.\nB. They call themselves Averroists.\nC. They all promotes monopsychism. \nD. They are ardent propagandist for some kind of freedom.", "Level": 1, "Answer Type": "mutipleChioce", "Final answer": "D", "file_name": "", "Answer Explanation": " A is wrong because this movement, Latin Averroism, is popular during the 1260s and 1270s. B is wrong. While Siger of Brabant and Boethius of Dacia were leading figures in the Latin Averroist movement, it is not documented that they referred to themselves explicitly as \"Averroists.\" The term \"Averroistae\" began to be used around 1270 to describe followers of Averroes majorly by their opponents. C is wrong because only Siger of Brabant has works (especially De anima intellectiva) discussing the unity of intellects, while Boethius of Dacia doesn’t. D is guaranteed."}
{"task_id": "094", "Question": "『解体約図』において、「精気」とはどういう意味か。\n\nア　当時の生気論の影響を受けた概念であり、身体内を循環し、生命活動を支えると考えられていた気体やエネルギーを指す。\nイ　「精」という字が含まれているため、誤って「精液」と解釈されることがある。\nウ　呼吸によって取り込まれる酸素のことである。\nエ　神経を伝わる電気信号のことである。\nオ　飲食によって体内に取り込まれ、体液や血液の形で体内を循環するものである。", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "オ", "file_name": "慶應義塾大学蔵『解体約図』", "Answer Explanation": "須原屋市兵衛の校文手稿を識別することで、「飲食、入口すれば、その精気は液となり、血となって循環周流するなり」と分かる。"}
{"task_id": "242", "Question": "There are many images left in the history of ancient Chinese medicine, please tell me based on this picture, what kind of medical activities are the people in the picture engaged in?\nA.vaccination\nB.acupuncture\nC.Moxibustion Treatment\nD.Diagnose the pulse", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "242.png", "Answer Explanation": "The name of the image is called jiuaitu or cunyitu，"}
{"task_id": "204", "Question": "How many people were infected with HIV in South Africa in 2005, according to Richard Phillips' paper, \"Histories of Sexuality and Imperialism: What's the Use?\"", "Level": 1, "Answer Type": "exactMatch", "Final answer": "4.5 million", "file_name": "", "Answer Explanation": "The concentration of the global AIDS crisis in the world's poorest regions -in South Africa alone, 4.5 million people are HIV-positive and upwards of 1000 die from AIDS every day(2005 figures)"}
{"task_id": "209", "Question": "According to Harold J. Cook's 2011 paper, in return for curing these men and revealing his secrets, how much livres of money did Louis XIV gift to Robert Tabor in total?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 50000, "file_name": "", "Answer Explanation": "Louis XIV awarded Tabor the huge sum of 48,000 livres plus a pension of 2,000, along with the title of chevalier."}
{"task_id": "206", "Question": "According to Alison Klairmont Lingo's 1999 paper \"The Fate of Popular Terms for Female Anatomy in the Age of Print\", what are the terms in the second column, row 14?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Barres froissees", "file_name": "", "Answer Explanation": "In the first line of the second column is \"Paris\"  and \"13. Barres froissees\" in the fourteenth line."}
{"task_id": "362", "Question": "https://www.youtube.com/watch?v=4_BCuiLMUhM\nIn the video from 1:04 to 1:10, a military aircraft appears in the video. Which of the following statements about this type of aircraft is incorrect?                                                                                                        A. Its principal designer later became Deputy Chief Designer at Blohm & Voss.\nB. It retired in 1945.\nC. It was first deployed in the Poland battlefield.\nD. Its manufacturer was later merged into Messerschmitt-Bölkow-Blohm (MBB).", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "", "Answer Explanation": "The aircraft in the picture is a Junkers Ju 87. It was first deployed during the Spanish Civil War instead of the Poland warfare. "}
{"task_id": "243", "Question": "The Menghe School of Medicine is one of the important schools in the history of Chinese medicine. May I ask in which location/province did the Menghe School of Medicine ultimately take shape?\nA. shanghai\nB.wujin，jiangsu\nC.beijing \nD.xinan，anhui\n", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "", "Answer Explanation": "Menghe medicine originated in Menghe, but eventually formed in Shanghai, and was facilitated by the formation and development of the school by Shanghai traditional Chinese medicine practitioner Ding Ganren and his disciples."}
{"task_id": "084", "Question": "Where is this mural painted? A. Dunhuang B. Penjikent C. Kizil D. Longmen E. Datong", "Level": 3, "Answer Type": "Multiple Choice", "Final answer": "C", "file_name": "084.png", "Answer Explanation": "This is a wall painting from the inner wall of the right corridor of Kizil 224."}
{"task_id": "298", "Question": "Une feuille de ce manuscrit indiquait clairement double projet de Raymond Aron: « Le petit livre ou la longue introduction que je me propose d’écrire part de deux projets : préparer une réédition de Paix et guerre entre es nations et lenrichir par une présentation critique du texte de 1962; rédiger l’essai que je concus quand je terminai mes Mémoires, un essai comparable à...... » A) De l'esprit des lois de Montesquieu\nB) Le Capital de Karl Marx\nC) L'éthique protestante et l'esprit du capitalisme de Max Weber\nD) De la démocratie en Amérique d'Alexis de Tocqueville\nE) Les Origines du totalitarisme de Hannah Arendt\nF) Le Jahre der Entscheidung d'Oswald Spengler", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "F", "file_name": "", "Answer Explanation": "Dans la note de bas de page de l'introduction de la huitième édition de La paix et la guerre entre les nations, il est mentionné qu'une page du manuscrit rédigé par Aron avant sa mort en octobre 1983 indique clairement ses deux projets d'écriture. Il y est écrit : Le petit livre ou la longue introduction que je me propose d’écrire part de deux projets : préparer une réédition de Paix et guerre entre es nations et lenrichir par une présentation critique du texte de 1962; rédiger l’essai que je concus quand je terminai mes Mémoires, un essai comparable au Jahre der Entscheidung d'Oswald Spengler"}
{"task_id": "195", "Question": "Where can people buy nourishing beef sauce(补身牛肉汁）according to the picture?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Watsons Pharmacy", "file_name": "195.png", "Answer Explanation": "In the lower left corner of the picture, you can see \"Watsons Pharmacy on Shanghai Main Road is selling various medicines\", including nourishing beef sauce."}
{"task_id": "086", "Question": "What does this painting intend to convey?\nA. Monkeys plant and appreciate exotic flowers.  \nB. Humans evolved from monkeys.  \nC. Monkeys also possess complex social structures.  \nD. Blind speculators are like monkeys.", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "D", "file_name": "086.png", "Answer Explanation": "In 1636, according to an 1841 account by Scottish author Charles MacKay, the entirety of Dutch society went crazy over exotic tulips. As Mackay wrote in his wildly popular, Memoirs of Extraordinary Popular Delusions and the Madness of Crowds, as prices rose, people got swept up in a speculative fever, spending a year’s salary on rare bulbs in hopes of reselling them for a profit.\n\nMackay dubbed the phenomenon “The Tulipomania.”\n\n“A golden bait hung temptingly out before the people, and one after the other, they rushed to the tulip-marts, like flies around a honey-pot,” wrote Mackay. “Nobles, citizens, farmers, mechanics, sea-men, footmen, maid-servants, even chimney-sweeps and old clothes-women, dabbled in tulips.”\n\nWhen the tulip bubble suddenly burst in 1637, Mackay claimed that it wreaked havoc on the Dutch economy."}
{"task_id": "093", "Question": "『解体新書』において、「尻」とはどういう意味か。\n\nア　お尻\nイ　上丘\nウ　下丘\nエ　睾丸\nオ　脳中水道管\n", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "イ", "file_name": "『解体新書の謎』\n2010年5月10日第1版第1発行\n定価：（本体3,000円＋税）\n著者大城孟\n発行者 市原敬之", "Answer Explanation": "第92ページの記述に基づき、中脳の背側面は実に奇妙な凹凸がいっぱいで、 見方によっては会陰部そっくり。 そこで西洋の解 剖学者は各凹凸に会陰部と似せて、 以下のごとく に類似解剖名を付けたのである。 \n(1)尻*(de Bill = buttocks) 上丘のこと。 松果体近傍にある小高い部分。 髄質の紐により間脳と連絡し、 視床枕および外側膝状体に入る。"}
{"task_id": "187", "Question": "To whom was this astrolabe offered as a gift?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Safavid shah Sulṭān Ḥusayn", "file_name": "187.png", "Answer Explanation": "The astrolabe is an adjustable instrument that maps the stars, and has many other functions. The device can be set to the user’s location on earth, and to the correct time. On the front, the curling pointers on the openwork plate (al-`ankabut in Arabic, or spider) are each labelled with a star’s name. Invented in late classical times, the astrolabe was perfected in the early Islamic period. Astrolabe, brass, with incised text, mapping lines and decoration, instrument with six latitude plates, openwork rete (`ankabut), sight-rule (alidade), wedge (faras) and pin, dedicated to Safavid shah Sulṭān Ḥusayn, produced and decorated by `Abd al-Husayn ibn `Abd al-A'imma', Isfahan, Iran, dated 1120H, 1708-1709."}
{"task_id": "245", "Question": "Hygiene posters can effectively play a role in publicity.The worker pictured here covers his mouth with a handkerchief when coughing, and the poster is accompanied by a text mentioning the prevention of tuberculosis.Can you look at this poster and tell me which of the following periods the style of the poster is least likely to appear?\nA.1950s\nB.1960s\nC.1970s\nD.1930s", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "D", "file_name": "245.png", "Answer Explanation": "The exact date of the poster is 1955. However, the style belongs to the period after the founding of the People's Republic of China, not the period of the Republic of China before October 1949."}
{"task_id": "326", "Question": "Who is the author of the following text?\nКогда мне предложили написать вступительное слово к первой публикации дневниковых и рабочих записей Леонида Ильича Брежнева, я не предполагал, насколько их прочтение окажется связано с личными воспоминаниями. Перелистываешь дату за датой, год за годом, и ловишь себя на мысли: а что с тобой происходило в те дни?\nВ сознании как бы сосуществуют два потока времени: череда официальных и неофициальных событий, упоминаемых Леонидом Ильичем, и собственные зарубки, сохраненные памятью иной раз по причудливым обстоятельствам. [Answer in Russian]", "Level": 2, "Answer Type": "exactMatch", "Final answer": "А. Н. АРТИЗОВ", "file_name": "", "Answer Explanation": "This text is extracted from the introductory remarks of the book Leonid Brezhnev: Working and diary entries."}
{"task_id": "317", "Question": "Who is the father of the tomb owner Yu Shi？", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Yu Ji", "file_name": "317.tif", "Answer Explanation": "The fourth column of the epitaph mentions that Yu was the eldest daughter of the censor Yu Ji"}
{"task_id": "363", "Question": "“盛京将军晋”指的是谁？", "Level": 2, "Answer Type": "exactMatch", "Final answer": " 晋昌 ", "file_name": "363_1.jpeg;363_2.jpeg", "Answer Explanation": ""}
{"task_id": "126", "Question": "\tWhich emperor issued this flood management decree?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Jiaqing", "file_name": "126.png", "Answer Explanation": "Judging based on files information."}
{"task_id": "321", "Question": "墓主娄贵华的封号是什么？", "Level": 2, "Answer Type": "exactMatch", "Final answer": "顺阳郡君", "file_name": "321.png", "Answer Explanation": "墓志中信息：“文宣王以事上闻，翰嘉义节，封顺阳郡君。”"}
{"task_id": "405", "Question": "What is the original source of the notes written on this page?", "Level": 3, "Answer Type": "exactMatch", "Final answer": "John Josselyn, New-Englands rarities discovered in birds, beasts, fishes, serpents, and plants of that country", "file_name": "405.jpg", "Answer Explanation": "At the top of the page, the text reads: 'Out of New England Raryties by John Jossaline [...]'."}
{"task_id": "271", "Question": "\tAccording to the dialogue shown in the image, who is the person acting at the beginning?(For answers, please use the language referred to in the material)", "Level": 2, "Answer Type": "exactMatch", "Final answer": "\t小囝", "file_name": "271.png", "Answer Explanation": "需要识别手写体方言字，识别率会影响到方言种类判断。\"儂是要去𠳝\nnoong3 z2 iau c’e3 va3\n儂垃拉做𠳝\nnoong3 læh la3 tsoo3 va3\n儂垃拉做啥\nnoong3 læh la3 tsoo3 sa3\n起頭 吃早飯 前頭\nc’e3 du c’uk tsau2 van zen de\n啥人起頭白相个\nsa3 niung c’e3 du bæh siang3 kuk\n是伊个小囝\nz2 ye kuk siau2-nön【479】\""}
{"task_id": "311", "Question": "2.『糖業便覧』の209ページと『南洋開拓拾年誌』の146ページを読むに基づいて、松江春次が南洋興発株式会社に就任している間に新品種甘蔗を導入した理由を指摘してください。\n\nA.旧品種の甘蔗Rose Bambooは赤腐病にかかりやすい。\nB.旧品種の甘蔗Otaheite Caneは萎縮病にかかりやすい。\nC.旧品種の甘蔗Cheribon Caneは耐倒伏性が悪い。\nD.旧品種のサトウキビRose Bambooは筬象虫に侵入されやすい。", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "D", "file_name": "", "Answer Explanation": "『糖業便覧』の209ページを読むと、当時流行していた甘蔗品種には、Rose Bamboo、Otaheite Cane、Cheribon Caneの3種類があり、Rose Bambooはサイパン島で主に導入された品種であることが分かる。 Rose Bambooという品種は甘蔗の糖分と水分が高く、繊維含有量が低いため、耐転倒性が悪く。『南洋開拓拾年誌』の146ページによると、このような状況も、Rose Bambooが「筬象蟲」の侵入を招きやすい原因となっている、そして赤腐病、萎縮病などの病気を引き起こす。だから本題の正解は「D」です。"}
{"task_id": "046", "Question": "Who among the following is closer to Michel Foucault’s understanding of paradigm/exemplum? A. Karl Popper B. Thomas Kuhn C. Plato D. Gilbert Simondon E. Socrates", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "", "Answer Explanation": "Thomas Kuhn’s concept of paradigm is about disciplinary matrix or examples universally recognized by scientific achievements that, for a time, provide model problems and solutions for a community of researchers, while Michel Foucault’s understanding of paradigm is related to the episteme(s)  implicating “rules of formation” which govern what constitutes legitimate forms of knowledge for a particular cultural period. The latter one shows affinities to Plato’s use of paradigm in his dialectic. For other options, Kuhn’s theory in The Structure of Scientific Revolutions challenged Karl Popper’s opinions with progressivism in science, both Gilbert Simondon and Foucault were inspired by their teacher Georges Canguilhem but diverged their approaches to the philosophy of science and technology, and Plato composed his philosophical dialogues assuming the role of his teacher Socrates."}
{"task_id": "139", "Question": "\tIn which year was this speech delivered?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 1962, "file_name": "139.mp3", "Answer Explanation": "On 26 March 1962, in a radio and television broadcast, the French President, Charles de Gaulle, urges the population to support the French Government’s Algerian policy and endorse the ceasefire and self-determination in Algeria.\nLe 26 mars 1962, le président de Gaulle prononce une allocution radiodiffusée et télévisée dans laquelle il exhorte la population française à soutenir la politique algérienne du gouvernement français et à adopter le cessez-le-feu et l'autodétermination en Algérie."}
{"task_id": "069", "Question": "Based on its material form, which dynasty is most likely to have the first printing of this book? A. Southern Song Dynasty B. Jin Dynasty C. Late Ming Dynasty D. Qing Dynasty", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "069.png", "Answer Explanation": "Each page of the book has been folded, with the creases facing towards the outside of the book. Therefore, the thin black line in the upper left corner of the picture is actually the thin black line at the center of each sheet of paper in the book, known as the \"细黑口\". The book has two borders on each page, the inner border is thin and the outer border is thick. The horizontal stroke of the character is thin on the left and thick on the right, and its right end forms an upward triangle. Tilt the horizontal pen slightly to the left, with a tilt angle of less than 5 degrees. The thickness of the vertical pen varies from top to bottom. This type of writing feature, similar to the Tang Dynasty calligrapher Ouyang Xun, is called \"欧体字\". The \"欧体字\" and \"细黑口\" are both characteristics of Fujian printed books from the Southern Song Dynasty to the Yuan Dynasty. In contrast, the characters in the Jin Dynasty engraved editions have a greater horizontal inclination, usually around 10 degrees; In the late Ming Dynasty, the horizontal strokes were rarely tilted, while the vertical strokes had the same thickness in both directions, with thicker black lines at the center of each piece of paper."}
{"task_id": "083", "Question": "Who is the God that this Veda Hymn address? A. Vajra B. Soma C. Uṣa D. Agni E. Indra F. Marut G. Śiva    The text is: इ॒त्था हि सोम॒ इन्मदे॑ ब्र॒ह्मा च॒कार॒ वर्ध॑नम् \nशवि॑ष्ठ वज्रि॒न्नोज॑सा पृथि॒व्या निः श॑शा॒ अहि॒मर्च॒न्ननु॑ स्व॒राज्य॑म् ", "Level": 3, "Answer Type": "Multiple Choice", "Final answer": "E", "file_name": "", "Answer Explanation": "Several  typical features are mentioned: thunder-armed, drive Dragon(Vṛtra) from the earth. Indra killed Vṛtra with his vajra."}
{"task_id": "246", "Question": "Uit welk boek komt deze illustratie", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Beschrijvinge van Nieu Nederlandt", "file_name": "246.png", "Answer Explanation": "identify the source of the image"}
{"task_id": "049", "Question": "Определите жанр этой берестяной грамоты.", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "военно-политическое донесение", "file_name": "049.png", "Answer Explanation": "Грамота No 590 (стратигр. посл. треть XI в., Нутн.)\nЖанр: донесение\nСодержание: «Литва пошла войной на карел»\nПеревод: Литва пошла войной на карел.\nЭто военно-политическое донесение. Как и другие подобные донесения, оно не имеет адресной формулы; это явно связано с необходимостью конспирации.\nПомимо текста, грамота содержит большой тамгообразный знак; быть может, это личный знак, заменяющий имя автора-лазутчика.\nК сожалению, при первоначальной датировке грамоты No 590, основанной на полевой оценке, была допущена серьезная ошибка, которая проникла и в издание (где грамота отнесена к концу XII в.). Ошибка была исправлена в ходе итогового стратиграфического анализа всей совокупности находок Нутного раскопа, проведенного П. Г. Гайдуковым (см. Гайдуков 1992: 81).\nПо предположению В. Л. Янина (1998: 265-266), грамота относится к 1069 г., когда полоцкий князь Всеслав Брячиславич предпринял поход на Новгород через водскую землю, где и могло произойти столкновение сопровождающих князя литовцев с карелами."}
{"task_id": "364", "Question": "Qui est la personne qui a donné ce discours? ", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Simone Veil", "file_name": "364.m4a", "Answer Explanation": "\nSimone Veil, rescapée de la Shoah, est ministre de la Santé le 26 novembre 1974 lorsqu’elle présente devant l’Assemblée nationale le projet de loi sur la dépénalisation de l’interruption volontaire de grossesse (IVG)."}
{"task_id": "050", "Question": "О чем изображено на данной лубочной картинке?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "О Масленице", "file_name": "050.png", "Answer Explanation": "Вся картинка разделена на три полосы (вертикально). Вверху этих полос в середине изображение Масленицы и Семика, с боков и внизу их шесть квадратиков-картинок с делами Масленицы. Над изображением: «Сказание осемике иомасленице», кругом картинки по рамке: «Честь и похвала какъ масленица семика ксебе вгости звала изволте посмотреть какъ величала». По бокам текст: «Честь ипохвала как масленица… ты же моя перепелочка». Затем в 5 квадратах помещено 5 картинок: 1.трое саней в упряжке едут из ворот; 2.к воротам подъезжают два музыканта верхом на свиньях, передними двое пеших с волынками — «Передние скачут на свиньях верхами с разными музыки и гудками\"(№8); 3. Четверо за столом обедают (№11); 4.сцена драки у городских ворот — не пускают масленицу в народ; 5.гуляющие возвращаются домой на двух санях, перед ними музыкант играет на дудке, другой пляшет. Внизу в правом столбце шестая картинка: четверо гуляк, впереди парень подает целовальнику в окно шапку, сзади стоит парень, которого рвет ручьем, за ним ожидают своей очереди мужик с бабой. Под картинками и вокруг шестой картинки текст: «Ныне нам объявляется о масленице… Ахоша исъсебя что заложить амасленицу проводить чтобъ намъ понеи нетужить да бы впреть срадостию получить» Ров. т.1 с.307−308 №93 — наш лист в точности не совпадает с описаниями Ровинского, но он близок по расположению текста к изначальному листу, картинки отличаются от описанных у Ровинского (где возможны сопоставления, отмечено).\nМасленица — это праздник, знаменующий проводы зимы и встречу весны. Изначально он имеет древние языческие корни, связанные с днем весеннего равноденствия 20 марта. С приходом христианства дата Масленицы стала зависеть от начала Великого поста и Пасхи и выпадать на первую неделю поста. В православной традиции эту неделю называют Сырной седмицей, когда уже нельзя есть мясо, но разрешены молочные продукты. Последний день, когда можно было есть мясо, — это Мясопуст, воскресенье перед Масленицей.\nМасленицу часто сравнивают с русским карнавалом. Похожие праздники есть и в других странах: например, Mardi Gras во Франции или Shrove Tuesday в Великобритании.\nГлавный символ Масленицы — блины, которые ассоциируются с солнцем и поминанием предков, согласно поверьям, помогающим с будущим урожаем. Кроме блинов, готовили лепешки, вареники и «жаворонков» из ржаной муки. Также популярной традицией была братчина — совместное пивоварение и распитие пива всей деревней. "}
{"task_id": "088", "Question": "What kind of medicine did this woman use to kill multiple patients?", "Level": 3, "Answer Type": "exactMatch", "Final answer": "Atropine", "file_name": "088.png", "Answer Explanation": "It wasn’t until June 1868, when 24-year-old Marie-Catherine Fritzgès fell ill at the Pension Desarzens in Geneva, that the authorities acted. It was much too late.\n\nFritzgès had been befriended by a fellow guest, Marie Jeanneret, a nurse. Jeanneret poisoned her with atropine, a derivative of belladonna, deadly in large doses. Fritzgès was lucky. She lived. Others – at least six over the previous nine months – had died. Jeanneret likely tried to kill around 30 people."}
{"task_id": "270", "Question": "\tWho is the author of the Chinese poem shown in the image?(For answers, please use the language referred to in the material)", "Level": 2, "Answer Type": "exactMatch", "Final answer": "郑有敦", "file_name": "270.jpg", "Answer Explanation": "二月春深客思迷，鸟声偏向小楼啼。倚阑不肯轻归去，芳树浓烟日正西。In conclusion, the poem expresses a feeling of quiet sorrow or wistfulness, where the beauty of the external world highlights the traveler’s internal turmoil or longing. The traveler is appreciating the moment but is also acutely aware of their own state of being away from home, perhaps missing loved ones or feeling a sense of displacement.The poem describes a scene in late spring, where the traveler is lost in thought, birds are singing near a small pavilion, and the person leaning on the railing is reluctant to leave. The scene is set in the evening, with fragrant trees and dense smoke as the sun sets in the west.The sentiment of the poem is melancholic and bittersweet."}
{"task_id": "325", "Question": "When was the letter written in the picture (month and year)?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "October 1713", "file_name": "325.jpg", "Answer Explanation": "According to the source, this letter is written by Peter I to Romodanovskiy on October 1713."}
{"task_id": "398", "Question": "What is the name of the philosopher mentioned in the inscription?(For answers, please use the language referred to in the material)", "Level": 3, "Answer Type": "exactMatch", "Final answer": "程頤", "file_name": "398.png", "Answer Explanation": "Ming Dynasty Inscription Recognition\"程子視箴\n    〔碑首〕：宸翰\n    心兮本虛，應物無迹。操之有要，視為之則。蔽交於前，其中則遷。制之於外，以安其內。克己復禮，久而誠矣。\n    視聽言動四箴者，乃宋儒程氏頤之所作也。程氏說人之生也，其性本善，後被物欲交攻，而此性始有不善。視聽言動四者，或不能中此，乃受病之處，居中而制萬事者心也。心之所接，必由視聽得之，視聽之不明不聰，則言動皆違天理，然視居其首焉。程氏說凡人於視，不無被那諸般物色所蔽，惟中心安之。凡視無不明，勿使外物蕩其中，常使中制於外可也，《書》云『視遠惟明』即此意也。要操存之在吾心，無有遠邇，視之如一，辨其是非，觀其善惡，以吾心之正為較察，然後可免於昏亂之失矣。朕惟人皆以視為明，而人君所視者，尤為要焉。果以此為則，深為益也。凡觀其邪正，辨其賢否，不為奸巧之所惑，庶幾忠與不肖，不得并進，用舍不至於倒置矣！嗚呼察之。\""}
{"task_id": "238", "Question": "In 1933, T.V. Soong applied to Britain and the United States for a postponement of the Boxer Indemnity. How much did he estimate that the government's expenditure would be reduced? A. $10 million B. $15 million C. $20 million D. $25 million E. $30 million F. $100 million G. $200 million", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "", "Answer Explanation": "There is a clear record in the FRUS archives：：The Minister in China (Johnson) to the Secretary of State\nPeiping, February 17, 1933—11 p.m.\n[Received February 18—3:20 a.m.]\n159. My 125, February 7, noon [11 a.m.]. I have now received from Nanking a note from the Minister of Foreign Affairs dated February 13 accompanied by a translation the substance of which is as follows:\n“The National Government by great efforts succeeded in balancing its budget during 1932 without recourse to borrowing; particulars as to how this was accomplished together with a full statement of the financial situation are contained in the report of the Minister of Finance dated December 15, 1932. Reduction of military expenditures and conversion of the loans were major factors in making possible the success of the National Government in this regard but the postponement of the American and British portions of the indemnity thereby reducing expenditures by almost $20,000,000 annually was likewise essential in making possible a balanced budget.\n\nThe difficulty of stabilizing the national finances has been greatly increased due to the reduction of customs revenues in the past year by about 25 percent. This reduction has resulted from the worldwide depression and from the Japanese seizure of the entire revenues of Manchuria thereby throwing upon the rest of the country the entire burden of loan and indemnity service. Unhappily these conditions still continue.\n\nThe National Government can scarcely go further in increasing revenue or curtailing expenditure. To resume indemnity payments at once in accordance with the schedule would disturb the financial equilibrium just attained with such difficulty.\n\nThe National Government appreciates fully the undertaking given that the present postponement does not constitute a precedent for [Page 663]the future. In existing difficult conditions however the National Government feels that it has no option but to seek a temporary continuation of the existing arrangement. The National Government being fully aware that activities are currently proceeding which are dependent for support upon indemnity payments would of course undertake to make arrangements with the agencies concerned for the support of these activities early in coming year.\n"}
{"task_id": "164", "Question": "who is the speaker of this recording？", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Queen Elizabeth II", "file_name": "164.mp3", "Answer Explanation": "From the recording we can see that“god save the Queen”“as this critical moment in our history”“25 years ago,my grandfather broadcast the first of these Christmas messages”“new commonwealth”,which explicitly shows the speaker‘s identity."}
{"task_id": "070", "Question": "When is it most likely that the inscription was written based on the font? A. Mid Western Zhou Dynasty B. Late Western Zhou Dynasty C. The Spring and Autumn Period D. The Warring States Period", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "070.png", "Answer Explanation": "Most of the fonts in this inscription are close to the late Western Zhou Dynasty, but there are a few writing styles that are not found in other Western Zhou inscriptions and instead resemble the style after the Spring and Autumn Period.For example, in the early Western Zhou Dynasty, the character \"十\" presented a spindle shaped vertical axis; In the middle and late stages, the writing style of \"one vertical plus one dot\" emerged. But the \"十\" in this inscription is one vertical and one horizontal, which matches the writing style of Spring and Autumn Period well, rather than the Western Zhou Dynasty."}
{"task_id": "108", "Question": "Finish the blank with a number.\nIn May 1850, the NRA launched the New York Industrial Congress, bringing together benevolent societies, social reformers, and workers’ associations.The first meeting attracted____ delegates representing an impressive array of labor organizations, including window shade painters, bookbinders, hat finishers, jewelers, and silversmiths.", "Level": 1, "Answer Type": "exactMatch", "Final answer": 110, "file_name": "", "Answer Explanation": "In May 1850, the NRA launched the New York Industrial Congress, bringing together benevolent societies, social reformers, and workers’ associations.The first meeting attracted 110 delegates representing an impressive array of labor organizations, including window shade painters, bookbinders, hat finishers, jewelers, and silversmiths. "}
{"task_id": "287", "Question": "What is the approximate length of the coastline within the planning area?  A.3KM  B.4KM  C.5KM D.6KM E.7KM", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "287_1.png", "Answer Explanation": "take a reference from the map(287_2.png), such as Hetao area in the south of Shenzhen River, and then calculate the shorelines of the planning site (the grey area)"}
{"task_id": "359", "Question": "https://archive.org/details/MarketStreet19064KScan20181016\nIn which year was construction of the road that the cameraman is following in this video first started?", "Level": 2, "Answer Type": "exactMatch", "Final answer": 1847, "file_name": "", "Answer Explanation": "From the front of a cable car, a motion picture camera records a trip down Market Street, San Francisco, California, from a point between 8th & 9th Streets, Eastward to the cable car turnaround at the Ferry Building. Market Street, which cuts across the city for three miles (4.8 km) from the waterfront to the hills of Twin Peaks, was laid out originally in an 1847 survey by Jasper O'Farrell, a 26-year-old trained civil engineer who had immigrated there."}
{"task_id": "327", "Question": "Who drew this artwork?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Nicolas de Larmessin", "file_name": "327.jpg", "Answer Explanation": "According to the source, this French engraving depicts two young Russian tsars ruling simultaneously – Peter I and his older brother Ivan."}
{"task_id": "211", "Question": "Which riverback is the fort in the picture located on?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Cayster River", "file_name": "211.png", "Answer Explanation": "In this paper(Hittite Military Roads in Asia Minor: A Study in Imperial Strategy with a Map.), the location of this fort is specified“THE BLACK ROCK FORT OF AnoN KARA HISSAR ON THE INLAND CAYSTER FL.: POSSIBLY\nTHE HITTITE FORTRESS OF HAPANUWA ON THE RIVER ASTAR ”"}
{"task_id": "316", "Question": "What position had Fengshen Jilun been transferred to？", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Right Assistant Minister of Revenue", "file_name": "316.jpg", "Answer Explanation": "The seventh and eighth columns of the document provide answers to the questions"}
{"task_id": "337", "Question": "\nWhere is the writing location of this divorce certificate?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Shunyi County", "file_name": "337.png", "Answer Explanation": "Judging based on image information"}
{"task_id": "059", "Question": "What profession did this man engage in?A. Sponsor   B. Writer   C. Painter   D. Engraver", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "D", "file_name": "059.png", "Answer Explanation": "Portrait of one of the engravers of Fuchs' 'de Historia....'\n\nThis division of labor was captured most famously in the portrait that adorns the last page of Fuchs's De historia stirpium (1542; fig. 1.14). Two craftsmen are called painters (pictores); Albrecht Meyer is shown drawing the picture of a plant and Heinrich Fiüllmaurer is seen transferring the drawings onto the woodblocks; Veit Rudolf Specklin, who cut those woodblocks, is shown below as the cutter (sculptor). We should not, however, take this portrait too liter-d ally, since we know from the surviving drawings for De historia stirpium in the Austrian National Library that both Füllmaurer and Meyer drew the original sketches and probably both did the tracing.66 What neither did was the cutting of the woodblocks. Specklin (d. 1550), the block-cutter, was active in Strasbourg and may have cut woodcuts for other printed books, for instance those for the Bible (1531) for the Zurich printer Christoph Froschauer. It is unclear, however, when or where Specklin cut the woodblocks for Fuchs.\nIn the preface to his book, Fuchs wrote: \"The block cutter [ sculptor] Veit Rudolf Specklin, by far the best in Strasbourg, excellently imitated the admi-rable industry of painters: he has so skilfully expressed the outlines of each picture by carving (sculpendo) that he seems to compete with the painter for glory and victory.\"69 A comparison between the painter and the sculptor was a favorite topic in the Renaissance genre of paragone, a competition between the arts; Leonardo da Vinci, Michelangelo Buonarotti (1475-1564), and Galileo Galilei all composed treatises in which the relative merits of various mimetic arts were discussed.7o Fuchs's comment on Specklin is a little more nuanced."}
{"task_id": "074", "Question": "When is it most likely that this text was written based on its content? A. At the end of the Eastern Han Dynasty B. At the end of the Western Jin Dynasty C. At the end of the Eastern Jin Dynasty D. At the end of the Sui Dynasty E. An Shi Rebellion F. Five Dynasties and Ten Kingdoms", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "074.png", "Answer Explanation": "This is an ancient letter in Sogdian language unearthed from Dunhuang. It was mentioned that due to the invasion of the Huns, Luoyang had suffered from war. This is most in line with the situation in the late Western Jin Dynasty."}
{"task_id": "073", "Question": "What is the situation of Tibet reflected in this document? A. The Tibetan Dynasty was powerful. B. Some tribes in Tibet were powerful. C. All Tibet tribes were declining. D. The Tibetan Dynasty was declining.", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "073.png", "Answer Explanation": "This manuscript is a Dunhuang Tibetan document, written by the Khan of the Uyghur regime in Ganzhou. The establishment of the Uyghur regime in Ganzhou was the result of the downfall of the Tibet Dynasty. In the letter, the Khan mentioned that Tibetan people were sending troops to attack the Hexi Corridor. He should be referring to a specific Tibetan tribe. It can be seen that some Tibet tribes were still powerful."}
{"task_id": "170", "Question": "Who is the owner of the clock tower and factory in the picture?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Zhang Jian", "file_name": "170.png", "Answer Explanation": "照片中码头的牌匾是：“大生码头” 结合近现代史的知识，这是清末企业家张謇的大生纱厂的图片"}
{"task_id": "201", "Question": "According to Philip D. Curtin's essay\"Sugar Comes to the Atlantic Islands\",how much sugar did São Tomé produce in 1560 approximately?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "2,500 metric tons", "file_name": "", "Answer Explanation": "The Portuguese success is clear enough from production and export figures, even allowing a wide margin for error. The Portuguese introduced sugar from Madeira to Brazil only in the mid-1540s. By 1560, production had reached about 2,500 metric tons (roughly the production of either Madeira or São Tomé at that time). By 1580, it had doubled once more to reach 5,000 tons. By 1600, it was up to 16,000 tons, and,by 1630, it was more than 20,000 tons."}
{"task_id": "390", "Question": "Please fill in the blanks: The evolution trajectory of the ___ character in oracle bone inscriptions developing into ____ and ____.", "Level": 3, "Answer Type": "exactMatch", "Final answer": "鬲、鬳、獻", "file_name": "390.png", "Answer Explanation": "The traditional form of \"献\" is written as \"獻\", with its earliest form being \"鬳\" and the radical being \"鬲\". In some oracle bone inscriptions, \"鬲\" is used to represent \"献\"."}
{"task_id": "079", "Question": "Who is the samtso ačari mentioned in this Old Uighur text? A.  Šilabaḍre B. Faxian C. Xuanzang D. Šingqu Säli E. Aśoka   The text is: šrirnalandaram-ka  eltd[ilär] anta tägdökdä kamag [kuvrag] yıgılmıš ärdi, samt[so ačari] olar-nı birlä körüšü t[ükättök] dä š[ilaba]ḍre ačari bašınt[a][yegir]mi [a]čari-ka  samtso ača]rig uduzturup [drmaguptake] ačari-ka yüküntür [gäli]… …dı-lar , d(a)rmaguptake [ačari] ärsär , kayken lüši [tegmä] šilabadre ačari käntü öz", "Level": 3, "Answer Type": "Multiple Choice", "Final answer": "C", "file_name": "", "Answer Explanation": "The text mentions \"šrirnalandaram那爛陀\" and \" šilabaḍre戒賢\", which records the experience of Xuanzang in India. The translation of the text is available on VATEC: und geleiteten ihn in das śrīnālandārāma[-Kloster].(Als er dort ankam, war)(die) ganze Gemeinde (?) (versammelt). Nachdem der Tripiṭaka-Meister mit ihnen die Begrüßungs[zeremonie] vollzogen hatte, stellte man am [oberen] Ende, [wo] der Meister āryacandra (?) [saß], (einen speziellen Sitz) auf (und nötigte den Tripiṭaka-Meister) sich zu setzen ...(Dann befahl man) zwanzig ... Meistern,(den Tripiṭaka-)Meister zu geleiten, (und) ihn sich vor dem Meister (Dharmaguptaka) verneigen zu lassen. Dharmaguptaka ācārya (ist)(der [auf Chinesisch] Kaiken Lüši (genannte)śīlabhadra ācārya:"}
{"task_id": "307", "Question": "This is the same imperial edict from the Yuan dynasty, recorded in The Collected Inscriptions of the Mountains and the Right (山右石刻丛编) and Complete Works of the Yuan Dynasty (全元文). The former lists it as 'The Edict on the Lands of Huo Yue Temple' (霍岳庙田地诏), while the latter lists it as 'The Sacred Edict Inscription of Huo Yue Temple' (霍岳庙圣旨碑). According to these two materials, who issued this edict?\n\nA. The Emperor\nB. The Crown Prince\nC. Darughachi(regional overseer)\n", "Level": 2, "Answer Type": "exactMatch", "Final answer": "B", "file_name": "307.pdf", "Answer Explanation": "《山右石刻丛编》及《全元文》收录这一元代命令文书，分别著录为“诏”及“圣旨”，均不严谨。 \"诏\"是皇帝发布的命令，\"圣旨\"也是指皇帝的指令，容易招致误解。但是这不是皇帝发布的命令文书，“长生天气力里，皇帝福荫里”是公文起首语，次句“海山太子令旨”是关键，指示该文书是海山太子的命令。"}
{"task_id": "378", "Question": "What is the original printed title of the seventeenth-century book about the Huron-Wandet identified on this library catalogue page?", "Level": 3, "Answer Type": "exactMatch", "Final answer": "Le grand voyage du pays des Hurons, situé en l'Amérique vers la mer douce, és derniers confins de la nouvelle France, dite Canada [chez Denys Moreau]", "file_name": "378.jpg", "Answer Explanation": "Two book entries are catalogued here: James Sadeur, New Discovery of the Southern World (London, 1693) and Gabr. Sagard, Voyage du Pays des Hurons avec un Diction (Paris, 1632). However, the original book titles and publisher information are not written on the page. Retrieving such details requires consulting reliable bibliographical sources. ChatGPT is able to identify the latter entry in its correct historical context, but the model can only return the titles as transcribed in the catalogue, not the original printed forms.\tThe second seventeenth-century travel book listed is Le grand voyage du pays des Hurons, situé en l'Amérique vers la mer douce, és derniers confins de la nouvelle France, dite Canada, originally printed by Denys Moreau in Paris, 1632."}
{"task_id": "180", "Question": "What unit do these people belong to?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Irkutsk Police Fire Department", "file_name": "180.jpg", "Answer Explanation": "This photograph from the private archive of Sergei Mikhailovich Chashchin relates to the establishment of a firefighting service in eastern Siberia in the nineteenth and early twentieth centuries. It includes materials about early firefighting equipment, the organization of a Siberian firefighting team, and the leaders of Siberia's first firefighting service.The caption for this photo reads“Irkutsk police fire department. Exercise with tarpaulins, shields, crowbar and buggers”"}
{"task_id": "379", "Question": "According to this deed from early eighteenth-century New England, what is the relationship between Johan Pattukqua and the sachem Quequenap (or Quequenab), who conveyed the land? A. Johan Pattukqua was a witness at the meeting in which the deed was issued B. Johan Pattukqua was the scribe of the sachem C. Johan Pattukqua was a previous owner of part of the land D. Johan Pattukqua was the receiver of the land E. Johan Pattukqua was a friend of the sachem", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "379.jpg", "Answer Explanation": "The English translation of the sixth line reads: 'the swamp, where the oldfields of Johan Pattukqua end'. While ChatGPT can identify the structure of this document based on the information provided, it currently cannot process Algonquian languages (likely Wampanoag) from the colonial period. However, AI may assist future textual and contextual analysis of Indigenous handwriting that remains undeciphered."}
{"task_id": "207", "Question": "According to Marcy Norton's 2006 article in American Historical Review, what percentage increase in the value of \"non-European groceries\" as a proportion of the total value of British imports occurred between 1559 and 1800?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 0.26, "file_name": "", "Answer Explanation": "whereas in 1559 “non-European gro_x0002_ceries” accounted for less than 9 percent of the total value of English imports, by\n1800 that proportion had risen to almost 35 percent."}
{"task_id": "255", "Question": "Who gave the speech recorded in this video?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Ferdinand Sauerbruch", "file_name": "255.mp4", "Answer Explanation": ""}
{"task_id": "389", "Question": "This picture depicts the process of mummy-making. What is the purpose or symbolic meaning of the sickle-shaped knife shown in the picture? \nA. To remove all the internal organs of the deceased and sever the connection with the past. \nB. To restore the functions of the organs and ensure the deceased's life in the afterlife. \nC. It is also a tool for cutting the umbilical cord of newborns and symbolizes rebirth. \nD. It is the belongings of the deceased before death and symbolizes the deceased's life before death.", "Level": 3, "Answer Type": "exactMatch", "Final answer": "C", "file_name": "389.jpg", "Answer Explanation": "The Egyptians firmly believed that the soul of a deceased person would not perish but would still adhere to the corpse or statue. Since the Old Kingdom, the Egyptians have attached great importance to the making of mummies. The complete process of mummy-making includes the ritual of searching for the body, the ritual of purification (dissecting the body, extracting the internal organs, and removing the fat), reciting incantations, etc., and many accessories emerged. The sickle-shaped knife shown in the picture is one of the ritual implements used in the \"opening\" ceremony. On the one hand, the opening ceremony can enable all organs to resume their functions and ensure that the deceased's life in the afterlife is normal. On the other hand, this ritual implement may be the same tool as the one used to cut the umbilical cord of newborns, thereby strengthening the theme of rebirth.It is noteworthy that the heart is the sole internal organ that has been retained. The act of burying the deceased along with their belongings, which symbolizes their life during their lifetime, was a prevalent practice in ancient China, particularly during the Han Dynasty when there was a conviction that \"treat the deceased as if the deceased were still alive\"."}
{"task_id": "409", "Question": "1.甘蔗害虫「筬象蟲」の成長形態のイメージを以下に示します。添付資料に基づいて「筬象蟲」がどの成長段階で甘蔗に最も危害を与えるかを判断してください。これに対して松江春次が南洋興発株式会社の社長を務めていた間、どのような有効な措置を取って対応しましたか？\n\nA.成蟲の段階。 捕殺を実施する。\nB.幼蟲の段階。 天敵を引き入れる。\nC.蛹の段階。 新しい甘蔗の品種を導入する。\nD.繭の段階。 甘蔗を焼き払う。", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "409.png", "Answer Explanation": "『太平洋諸島の作物害虫と防除』の39—40ページを読んだ後、「筬象蟲」は繭、幼虫、蛹、成虫の4つの成長段階で甘蔗に大きな危害を及ぼすことがわかった。その中で幼虫段階「筬象蟲」は甘蔗の内部で成長して発育し、甘蔗の汁を吸うことは甘蔗にとって最も危害が大きい。また、『南洋開拓拾年誌』の146—148ページを読んでみると、松江春次は南洋興発株式会社の社長を務めていた間、甘蔗の焼却、「筬象蟲」の天敵の導入などの一連の措置をとっていたが、その中で「筬象蟲」の天敵を導入するのが最も効果的であることがわかった。だから本題の正解は「B」です。"}
{"task_id": "090", "Question": "Why was Afire created as a summer movie in the ignored German tradition? A. Experiencing a feeling of fever caused by the Covid during the seeking for inspiration B. The time and place envisaged for the story C. The use of the fire spirit from the four elements since ancient Greek D. The topic of male-female relationships, which seems to be the stereotype of summer plot E. About the passing/threshold of ‘long adolescence’ F. Partly referencing or getting inspiration from Berlinale by Guillaume Brac and Louder Than Bombs by Joachim Trier ", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "E", "file_name": "", "Answer Explanation": "We assume that the literal fire is a metaphor, yet it does consume two of the four who live in the summer house and so is less peripheral than it first seems. Perhaps the point of ‘Afire’ is that in the face of the apocalypse all of our petulance and self-absorbedness counts for nothing, though the film does wangle a happy ending out of the conflagration. Not that Leon is aware of any of this as he peers through curtains and around door frames, aggrieved and hostile, waiting to be disappointed. The delicious irony of the character is that, despite spending much of the film covertly and clumsily spying on the other characters, Leon views the world through the prism of his own smarting ego. Which means he sees virtually nothing of the emotional charges and social dynamics around him."}
{"task_id": "168", "Question": "Who is the protagonist of this mosaic painting?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Santa Pudentiana", "file_name": "168.jpg", "Answer Explanation": "Pudentiana is a virgin and martyr of the 2nd century who refused to worship the Roman Emperors Marcus Aurelius and Antoninus Pius as deities.This is a classical mosaic paintingDetail of a Paleochristian mosaic from the basilica of Santa Pudenziana in Rome, c. 410 AD, depicting Saint Pudentiana"}
{"task_id": "072", "Question": "When is the most likely age for this bronze artifact based on its material form? A. Early Western Zhou Dynasty B. Middle and Late Zhou Dynasty C. The Spring and Autumn Period D. The Warring States Period", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "072.png", "Answer Explanation": ""}
{"task_id": "014", "Question": "Please finish the blank with a kind of cathedral.\nAccording to \"Prenzlauer Berg, Berlin, 1870–present: A Neighborhood on the Fringe of Germany\" ,in 1909, the _______conducted a commission on poverty which\nfound, “the needy must be supported, especially the sick, elderly, widows, orphans,unemployed and the helpless…A noon meal has been established, during which the pastors‟families and parishioners cook for the needy.”", "Level": 1, "Answer Type": "exactMatch", "Final answer": " Segenskirche", "file_name": "", "Answer Explanation": " In 1909, the Segenskirche conducted a commission on poverty which found, “the needy must be supported, especially the sick, elderly, widows, orphans, unemployed and the helpless…A noon meal has been established, during which the pastors “families and parishioners cook for the needy.”"}
{"task_id": "345", "Question": "According to the author's own account, what kind of people is this poetry collection drawn from?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Concubines and Maidservants", "file_name": "345.png", "Answer Explanation": "愚因暇日检阅诸史与夫杂说外传之文，见其中记载姬媵妾侍有可书者，如神仙之凌华、璇涓，鬼魅之宠奴、桃枝，歌舞之樊素、小蛮，乐艺之宋袆、阿翘，节义之碧玉、绿珠，忠孝之上清、彩云。此类甚多，裒而集之，韵以四言，皆于句首见其名氏，共一百七十六句，计八十有八联，厘为上下卷，目曰《姬侍类》。偶非最传，世姑欲留为家藏耳。偶士夫求观，写录弗及，因付之梓，以呈好事君子。或明窗净几间，读经史厌倦时，取而阅之"}
{"task_id": "113", "Question": "\tTo whom is this letter written?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Pavasovich", "file_name": "113.jpg", "Answer Explanation": "Letter to Pavasovich, serdar of Shibenik and Skradin kapitenias (provinces). 1135 A.H./1722 - 1723 A.D. 1 f., 305 x 209 mm, paper. Coll. 67. Berchich. No. 62."}
{"task_id": "377", "Question": "What is the original printed title of the seventeenth-century book about Terra Australis identified on this library catalogue page?", "Level": 3, "Answer Type": "exactMatch", "Final answer": "A new discovery of Terra incognita Australis, or, The southern world [Printed for John Dunton ...]", "file_name": "377.jpg", "Answer Explanation": "Two book entries are catalogued here: James Sadeur, New Discovery of the Southern World (London, 1693) and Gabr. Sagard, Voyage du Pays des Hurons avec un Diction (Paris, 1632). However, the original book titles and publisher information are not written on the page. Retrieving such details requires consulting reliable bibliographical sources. ChatGPT is able to identify the latter entry in its correct historical context, but the model can only return the titles as transcribed in the catalogue, not the original printed forms.\tThe first seventeenth-century travel book listed is A new discovery of Terra incognita Australis, or, The southern world, originally printed for John Dunton in London, 1693."}
{"task_id": "146", "Question": "What was the percentage of silver content in Roman coins of the Roman Empire in 117 AD？", "Level": 1, "Answer Type": "exactMatch", "Final answer": 0.87, "file_name": "", "Answer Explanation": "Table 1 on the second page of the article provides relevant data"}
{"task_id": "063", "Question": "С чем связано данное объявление?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "С полосою отчуждения КВЖД/С КВЖД", "file_name": "063.png", "Answer Explanation": "Железнодорожная жизнь на дальнем востоке 1914 г. № 7, С. 30.: Заводы Торгово-промышленного Товарищества \"Имяньпо\" находились на станциях Имяньпо и Ханьдаохэцзы, которыми явились одни из главных станций полосы отчуждения Китайско-Восточной Железной Дороги."}
{"task_id": "319", "Question": "Where is Cui Xingxiu from？", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Wucheng, Qinghe", "file_name": "319.tif", "Answer Explanation": "The fifth column of the document provide answers to the questions"}
{"task_id": "222", "Question": "Where does the text come from?(Answer Format:Institution name; Document type; Date accurated to day）-There are persons in Birmingham who are designated as merchants but who act rather as agents having in fact few or no mercantile transactions of their own. Many of these agents are highly respectable in their character and conduct, although generally speaking not possessed of much property. They are paid by a commission on the transactions which they effect and for the most part, when they receive orders from abroad, particularly from America, they are furnished with bills on London and Liverpool [merchant] houses, with which they pay for goods purchased for their correspondents. These bills are frequently drawn by the bank of the U.S. and generally on the most eminent houses in this country, such as Baring Brothers & Co., Thomas Wilson & Co.,Finlay, Hodgson & Co., Thomas Dickinson & Co. and others, and in Liverpool on Cropper, Benson & Co., Sands, Hodgson & Co., W. & G. Maxwell, Maury, Latham & Co., W. & J. Brown & Co., and others. The paper which these mercantile agents negotiate is held in high estimation by the banks here [in Birmingham], and is perhaps on the whole considered the best in the market.\"", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Bank of England Birmingham letters, January 22, 1827. ", "file_name": "", "Answer Explanation": "In this paper(Racism, Slavery, and Free Enterprise: Black Entrepreneurship in the United States before the Civil War),the picture is cited fromBank of England Birmingham letters, January 22, 1827\""}
{"task_id": "361", "Question": "https://www.youtube.com/watch?v=lx6km37pC3U\nAt 04:42 - 08:59, the screen shows a public green space. Which of the following historical facts about the place is incorrect?\nA.\tThere is a monument in the center of this saqure-like public space. This monument got its name from the pro-Union rallies held there on the eve of the Civil War.\nB.\tWhen this clip was filmed, there was no underground garage in the area.\nC.\tBased on the layout and facilities of the square in this clip, we can infer that the video was shot after the end of the Spanish-American War.\nD.\tThis place is on the list of California Historical Landmarks (CHL).", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "", "Answer Explanation": "This place is Union Square, San Francisco. The area got its name because it was once used for Thomas Starr King rallies and support for the Union Army during the American Civil War. However, the 97 ft (30 m) tall monument in the centre of this square was dedicated to Admiral George Dewey's victory at the Battle of Manila Bay during the Spanish–American War. It also commemorates U.S. President William McKinley, who had been recently assassinated."}
{"task_id": "103", "Question": "Which cooperative community meets both of the following conditions: 1) Non-Fourierist phalanx, 2) Workers make up nearly half of the members. A. Brook Farm  B. Nashoba Community  C. Northampton Association of Education and Industry  D. Fruitlands", "Level": 1, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "", "Answer Explanation": " Northampton Association of Education and Industry had some superficial similarities to Fourierist communities and members who watchedthe larger movement keenly, but it was not Fourierist itself."}
{"task_id": "015", "Question": "Please finish the blank with a number.In London , the percentage growth rate of apprenticeship presentments was _____per cent per year from the 1510s through the 1550s, compared with the some what slower annual rate of 1.53 per cent across the next five decades. ", "Level": 1, "Answer Type": "exactMatch", "Final answer": 2.12, "file_name": "", "Answer Explanation": "The percentage growth rate of apprenticeship presentments was 2.12per cent per year from the 1510s through the 1550s, compared with the some_x001f_ what slower annual rate of 1.53 per cent across the next five decades."}
{"task_id": "037", "Question": "Was gilt als das zentrale inspirative Erlebnis für Alfred Döblin, der chinesische Roman „Die Drei Sprünge von Wang-lun“ zu verfassen?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Der Aufstand korenaischer Goldwäscher ", "file_name": "", "Answer Explanation": "Die Quelle des Romans ist kompliziert. Vermutlich hat Döblin unterschiedliche Ereignisse, z. B. die Berichte über die Revolution im Nobember 1911 und die Proklamation der chinesischen Republik am 12. Feb. 1912, zusammengemischt, und durch seine Umdeutung verzählt er eine neue chinesische Geshichte. Aber es ist sicher, dass Döblin laut des Zeitungsartikel über den Aufstand koreanischer Goldwäscher in einem sibirischen Bergwerk skizzierte er den Entwruf des China-Romans. Er hat in seinem Leinenheft solche Stichwörter untergeschrieben: Von Petersburg ihnen entgegen (oder / Moskau) moderne Europäer / Das Entsetzensregiment König Pauls. / Dazu widrige[?] Kosakenschwärme / Die Goldfundstätte an d[er] Lena wird von den / Chinesen gewonnen / Allmählich das moderne Arbeiterregime, Bergwerk, / Kasernen. Die Ausbeutung. Verbindung von / Kapital mit Militär: das Blutbad / Die moderne Wettrüstung, der Kampf aller gegen / alle. Eine moderne Fabrikstadt, Groß- stadt [. . .]« (WL 501)."}
{"task_id": "038", "Question": "In welchem Jahr hat T.V. Soong Berlin besucht?", "Level": 2, "Answer Type": "exactMatch", "Final answer": 1933, "file_name": "", "Answer Explanation": "Auch der Besuch T. V. Soongs in Berlin vom 21. bis 26. Juli 1933 als Abschluß einer Good-Will-Tour in westliche Industrieländer war trotz aller Bemühungen der Diplomaten und Militärs und eines Empfangs durch Vizekanzler v. Papen kurzfristig ohne greifbare Erfolge geblieben."}
{"task_id": "217", "Question": "Where does this text come from?（Answer Format:At least provide the title of the paper, the author, the publication journal, the issue number and the page numbers.）---In a feudal society:-(I) The ruling class should consist of groups of fighting men,each group chained together by links of an exhaustive personal bond of mutual service-a bond so personal that, in the last analysis, it should obtain, in each link, between two armed men only, lord and vassal: and so exhaustively personal that the one should swear to the other fidelity even unto death. Although the vassal's service is usually rewarded with a grant of land, land enters into this\nrelation only as a secondary factor, the primary motive power being the personal agreement in arms between the lord and his man. (2) There, however, being other classes of people also, the division of all the classes, including the warrior class, should coincide with their private tenures of land, -the private land law of this peculiar society recognizing no absolute ownership, (except perhaps in the supreme overlord, if he did exist), but only a series of relative tenures. (3) In the general\npolitical life of the society as a whole, these private tenures of land should condition the exercise of public rights and obligations; and the superior rights of land should fall into the hands of the privately armed men, who should accordingly assume all the public functions of State; -in other words, the ruling class having secured the control of arms and land, there should result the singular spectacle of the private usurpation of public rights, and the public utilization of private institutions;that is, in government, in finance, in military affairs and in the administration of justice, there should be a complete confusion or coalescence of\nthe public and the private.", "Level": 1, "Answer Type": "exactMatch", "Final answer": "K. Asakawa, \"Some Aspects of Japanese Feudal Institutions\", TASJ, XLVI, Part 1\n(1918), 78-79.", "file_name": "", "Answer Explanation": "In the paper(“Feudalism in Japan-A Reassessment.” ),this text was cited from K. Asakawa, \"Some Aspects of Japanese Feudal Institutions\", TASJ, XLVI, Part 1\n(1918), 78-79."}
{"task_id": "408", "Question": "The characters in the picture are oracle bone script. Please determine which period this object belongs to？A.盘庚及以后 B.武丁及以后 C.廪辛及以后 D.武乙及以后", "Level": 3, "Answer Type": "exactMatch", "Final answer": "A", "file_name": "408.png", "Answer Explanation": "断片，其文为 “上阙。大甲、大庚、中阙。丁、祖乙、祖，中阙。一羊一南，下阙。”此片虽残阙，然於大甲、大庚之间不数沃丁，中丁、“中” 字直笔尚存。祖乙之间不数外壬、河亶甲，而一世之中仅举一帝，盖亦与前所举者同例。结合殷世数表，应为盘庚及以后时期。\n"}
{"task_id": "374", "Question": "图片中的五件器物都出自北宋吕氏家族墓地中，请对这五件器物的早晚关系进行排序：A.23154 B.31524 C.51342 D.15432", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "374.png", "Answer Explanation": "北宋吕氏家族墓多数墓葬有出土明确纪年信息的墓志铭可供早晚判断（该报告已发表，默认文本可被分析），但难点在于合葬墓中器物的早晚下葬时间判断需要结合图像分析类型学。此类耀州窑韩瓶的类型学发展规律为，口部从盘口逐渐转向唇口，最终转向口沿外翻状态；在器物胎釉方面，先逐渐走向成熟，但到北宋末期又略有下降，是反映北宋耀州窑生产起伏发展的典型器物。"}
{"task_id": "171", "Question": "What historical event does this oil painting reflect?", "Level": 1, "Answer Type": "exactMatch", "Final answer": " French Revolution", "file_name": "171.jpg", "Answer Explanation": "The clothing styles of the characters in the painting, such as men's wigs, women's long dresses, and complex headwear,indicating that this should be a scene from 18th century Europe. The image of soldiers in red uniforms, helmets, and spears, as well as the tense atmosphere in the picture; Combining historical knowledge, this is an oil painting depicting revolutionaries arresting members of the royal family during the French Revolution"}
{"task_id": "318", "Question": "How old did Lady Lu live？", "Level": 2, "Answer Type": "exactMatch", "Final answer": 26, "file_name": "318.tif", "Answer Explanation": "The fourth column mentions that Lady Lu passed away at the age of 26"}
{"task_id": "335", "Question": "Whose signature is this? [Answer in Russian]", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Алекса́ндр I Па́влович", "file_name": "335.jpg", "Answer Explanation": "This is the handwritten signature of the Tsar himself"}
{"task_id": "411", "Question": "Where is the inscription on the wooden beam in the picture？", "Level": 3, "Answer Type": "exactMatch", "Final answer": "Qazi Mosque, Bharuch", "file_name": "411.jpg", "Answer Explanation": "There are relevant explanations under the image on page 205 of the article"}
{"task_id": "212", "Question": "What was the average number of chemists that Bayer hires each year during 1872 to 1876?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 1.8, "file_name": "212.png", "Answer Explanation": ""}
{"task_id": "360", "Question": "https://www.youtube.com/watch?v=lx6km37pC3U\nIn the video, between 00:13 and 00:25, a monument is shown on the left side of the screen. In which year was it unveiled?", "Level": 2, "Answer Type": "exactMatch", "Final answer": 1897, "file_name": "", "Answer Explanation": "00:13 – 0025, the Native Son's Monument visible at the intersection of Turk and Mason streets, beyond which lies the unfinished Flood Building and, to the far right, the Call Building tower. The monument was unveiled on September 5, 1897."}
{"task_id": "366", "Question": "Who is the translator of 'the new and revised editon'of China's Destiny mentioned in the telegram?\" A.WANG Chong-hui  B.Albert F, Lutley  C.Philip J. Jaffe D.Chiang Kai-shek", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "366.png", "Answer Explanation": "The telegram shown in Image 1 was located within F.O.371/41629. This archival collection contains a newly compiled translation, with the translation's cover page and introduction visible in Images 3 and 4. The cover page bears the translator's signature: \"Albert F. Lutley.\""}
{"task_id": "101", "Question": "Why did the concept of freedom transform from the Neo-Romanism one, focusing on civil liberty and self-government by expressing of political claims through the formulation of rules/laws, to the liberalism explained as the absence of restraint or interference (or as Isiah Berlin’s words, the negative liberty)? A. Protecting the free circulation and property rights during the rise of commercial society B. Responding to the idea of the Enlightenment and the French RevolutionC. Dejustifying the conceptual basis of law sharing by the political heritage of the Glorious Revolution and the American Independentists D. Re-discovering/inventing the natural rights of man as a universal idea and value E. Referring to the intellectual renovation by the German theory of natural law F. Coordinating the British government of moderate quality than the radical one with the philosophers of utilitarianism", "Level": 1, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "", "Answer Explanation": "Some have seen the new view as a creation of utilitarian political philosophy. Others have taken a broader perspective and associated the emergence of the new view with the rise and development of commercial society in the course of the eighteenth century. However, both explanations fail to provide an answer to the main historical puzzle that needs to be solved: what caused the tradition of legal thinking in which the new view of liberty was embedded to ascend so suddenly to a position of ideological dominance in less than twenty years between the late 1770s and the 1790s? The answer is that the new view of liberty was widely espoused as a means of fending off the republican and democratic potential of the established view that liberty consists in independence."}
{"task_id": "163", "Question": "Who is the author of this article? [Answer in Chinese]", "Level": 1, "Answer Type": "exactMatch", "Final answer": "载沣", "file_name": "163.png", "Answer Explanation": "According to the original text, this is an edict regarding the Sichuan Road Protection Movement. The reigning emperor at that time was Puyi, but he was too young to govern. The author of the original text is Regent Zaifeng"}
{"task_id": "158", "Question": "Which GULAG camp was this diary found in?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "The Barabanicha labour camp", "file_name": "158.jpg", "Answer Explanation": "Known from the source."}
{"task_id": "385", "Question": "What explains Cameron's inability to effectively rebut the Leave campaign's disinformation regarding Turkey's imminent EU accession during the 2016 referendum?A.He did not believe such a statement would have a positive impact on the current media climate.B.He could not confirm the progress of Turkey's accession to the EU. C.Such a statement would significantly damage UK-Turkey relations.D.His identity as a democratic leader compelled him to adopt measured and prudent rhetoric.", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "D", "file_name": "385.png", "Answer Explanation": "At the time, the issue of Turkey's accession to the EU was raised by the Brexit camp and became a dominant topic in the public discourse for a period. Lindsey's research shows that after Cameron responded to the issue by stating, 'There is no prospect of Turkey joining the EU in decades,' UK-Turkey relations had already been severely damaged. Under such circumstances, a straightforward further declaration that 'Turkey will not join the EU' would have had a tangible positive impact on the battle for public opinion and alleviating public concerns. However, Cameron chose not to do so. Here, we need to introduce some theoretical perspectives. Cain's research suggests that leaders in democratic countries tend to 'employ a tone of soberness and prudence that reveals a central concern for ordinary people.' This habitual approach led Cameron to think more from his position as prime minister, opting for a more cautious statement—a point that is also corroborated in his memoirs.(A)Persuasion is vital to the practice of democratic leadership, making speech and communication of fundamental importance. Yet, democratic citizens habitually suspect political rhetoric as being either deceitfully empty or dangerously subversive. Rhetoric is thus central in democracy while paradoxically appearing either useless or pernicious. A consequence of this paradox for democratic leaders is that they are forced to avoid fine oratory in favour of a rhetorical style that sounds un-rhetorical, seeming to be plain factually-informative speech. This unique democratic form of rhetoric, which we have called an artless art, seeks to instil trust and to avoid appearing to talk down to the sovereign people.(B)Once again, Cameron \nstrongly repudiated all these claims: ‘There is no prospect of Turkey joining the EU in \ndecades. You cannot find an expert on this subject – you’ve been quoting lots of experts \n– you cannot find one, because it’s not going to happen.’\n103\nUp until this point, Turkey, like many other EU members and candidate countries, had \nsteered clear of becoming involved in the referendum debate. However, the \nincreasingly strong tone taken by the sides now forced it to respond. Mevlüt Çavasoğlu, \nthe Turkish Foreign Minister, argued that it was not ‘right’ that Turkish membership \nhad become a central issue in the campaign. His country had never been a ‘burden’ on \nthe EU.104 Others in Turkey were far more scathing. Speaking on the BBC, Ilnur Çevik, \nPresident Erdoğan’s chief adviser, said that his country had been ‘flabbergasted’ by \nBritain’s stand. Noting that the Turkish Government had thought that the prime ministerwas its ‘chief supporter’ in its quest for EU membership, he said that Turkey now felt \n‘taken in’ by his stance. As he explained, ‘the way [Cameron is] putting it, “they were \nnever going to get in anyway, we just said we’ll go along with them”, that kind of \nattitude is deeply hurting the Turks…it is very insincere.’ As for the claims that millions \nof Turkish citizens would try to enter the UK after accession, he repudiated these by \nasking, ‘why should we be flooding Britain? There’s no reason. Whatever exists in \nBritain also exists in Turkey. We’re not going to go there just because you produce \nCadbury’s chocolate and Maltesers.’105 Meanwhile, on the day before the referendum, \nPresident Erdoğan even waded into the debate, albeit indirectly. Launching a scathing \nattack on the way in which the EU was treating Turkey, and accusing it of not wanting \na ‘Muslim-majority country’, he even suggested that Turkey might consider holding its \nown referendum on whether to continue EU accession talks. \n"}
{"task_id": "055", "Question": "What kind of disease was the formula in the picture used to treat?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Cough", "file_name": "055.png", "Answer Explanation": "Wuwei Medical Bamboo Slips of the Han Dynasty，治久咳上气喉中如百虫鸣状世歲以上方"}
{"task_id": "082", "Question": "Who is the 尚書職方郎中 mentioned in this Khitan Inscription? A.完顏撒離喝 B.黃應期 C.王圭 D.完顏晟 ", "Level": 3, "Answer Type": "Multiple Choice", "Final answer": "B", "file_name": "082.png", "Answer Explanation": "This is 大金皇弟都統經略郎君行記 written in Khitan script. 黃應期's name is mentioned in the last line."}
{"task_id": "279", "Question": "what is the first character?（provide the correct transcription with traditional Chinese ）", "Level": 2, "Answer Type": "exactMatch", "Final answer": "南", "file_name": "279.png", "Answer Explanation": "basic skills for recognizing the Chinese character"}
{"task_id": "264", "Question": "Please fill in the blank: Mr. McKenna is holding a little monster who holds a hammer and a burning torch and the words \"______\" emblazoned across its body.", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Militancy", "file_name": "264.jpg", "Answer Explanation": "Dialogue includes: Mr. McKenna (to presiding deity of International Medical Congress) \"You look as if you knew all about microbes, sir. Couldn't you find me an antidote to this?\" Mr. McKenna is holding a little monster who holds a hammer and a burning torch and the words \"Militancy\" emblazoned across its body."}
{"task_id": "342", "Question": "Based on this image (August), I would like to know how many countries were tentatively scheduled to participate in the Summer Olympics on August 20th?", "Level": 2, "Answer Type": "exactMatch", "Final answer": 126, "file_name": "342_1.png;342_2.png", "Answer Explanation": "Given that Rhodesia was excluded from the Olympics on August 22nd, and 125 nations eventually participated starting August 26th, it indicates that 126 nations were tentatively expected prior to the exclusion"}
{"task_id": "022", "Question": "Please finish the blank with a conference.\n_____gave way to the First Latin American Evangelical Conference, which\nconvened in Buenos Aires, Argentina, on July 18, 1949.", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Committee of Latin American Cooperation (CCLA)", "file_name": "", "Answer Explanation": "CCLA gave way to the First Latin American Evangelical Conference, which convened in Buenos Aires, Argentina, on July 18, 1949.\n\n\n"}
{"task_id": "295", "Question": "This poem is the English translation of a poem by a Chinese poet. Please analyze which Chinese poet it is?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Si Kongtu", "file_name": "295.png", "Answer Explanation": "The original author of this poem is Si Kongtu. This English version is included in Sunflower Splendor (1975) edited by Wu-chi Liu and Irving Yucheng Lo."}
{"task_id": "056", "Question": "In the book Picturing the Book of Nature: Image, Text, and Argument in Sixteenth-Century Human Anatomy and Medical Botany, what artistic style does the author attribute to this image ?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Naturalism", "file_name": "056.png", "Answer Explanation": "Albrecht Dürer, Large Piece of Turf (1503)\n\n\nRoughly contemporary to Leonardo's anatomical sketch is a watercolor  by Albrecht Durer (1471 - 1528), commonly known as the Large Piece of Turf (1503). As Karen Reeds observed, \"The plants are observed from the vantage point of, say, a hare, close to the ground, peering upward at the tallest grasses. The botanical clarity of the scene is enhanced by what is not there: Durer had tidied away the usual litter of dead grasses, leaves, and moss. The muddy ground from which the plants spring is rendered with a loose wash that makes the controlled brush and pen lines of the plants stand out all the more distinctly. Using a technique found in his woodcuts and etchings, Durer models each plant in its own shadows - none casts a shadow on any other, even where the low sunlight catches the rosette of the unfolding plantain. The clarity of the composition and the perfection of each plant within it support the argument... that Neo Platonism had strongly influenced Durer's vision.\"\n\nDurer's sketch shares with Leonardo the technique of \"hyperrealism\" by emphasizing key features and selecting out potential optical confusions. Such a selection, in Durer's case, was directed by a sense of something beyond appearances in nature, as he believed that a good painter should render visible the Platonic idea latent in his mind. Durer also had an interest in understanding the patterns underlying the workings of nature; he studied proportional relations in the human body, and sought to put the artist's craft on a more certain foundation in geometry.\n\nLeonardo and Durer were superb masters of \"naturalistic\" techniques that could be deployed for various purposes; they were curious about the principles underlying nature, and they sought to establish art on a more generalized footing. In short, these were skilled and informed draftsmen of nature, but neither their techniques nor their subject matter (the human body and plants) guaranteed that the object depicted was observed directly and represented faithfully, or that the pictured object existed at all. It would simply be unwise to presume that \"naturalistic\" pictures are transparent windows onto nature and natural objects of the past. They are not the premodern equivalents of photographic shots of actual, individual specimens, which record specific moments and accidental details like torn leaves, bent stems, grit or dirt, without correction or omission.\n"}
{"task_id": "040", "Question": "Etwa wie viele europäische Siedler lebten bis zum Ersten Weltkrieg in Südwestafrika, und wie viele davon waren Deutsche? A.13000 12000 B. 15000 12000 C.14000 12000 D.15000 13000", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "", "Answer Explanation": "﻿Bis zum Ersten Weltkrieg lebten etwa 14000 europäische Siedler in Südwestafrika, darunter 12000 Deutsche."}
{"task_id": "375", "Question": "What is the exact date of the completion of the inquistion according to the text? A.January 28,1351 B.January 27,1351 C.January 28,1350 D.January 27,1350", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "D", "file_name": "375.png", "Answer Explanation": "According to A Handbook of Dates For students of British history,the Feast of the Purification of the Virgin Mary, also known as Candlemas, is celebrated on February 2 in the Christian medieval calendar. Edward III began his reign on January 25, 1327, so his 24th regnal year ran from January 25, 1350 to January 24, 1351. According to Perpetual Yearly Calendar, \"Wednesday before the Purification, Edward III \" should be January 27, 1350."}
{"task_id": "400", "Question": "In the campaign of the 2016 Brexit referendum,why was the slogan \"Project Fear\" become a powerful weapon against the remain camp? A.It exposed the truth to ordinary people B.It could be easily amplified and spreaded by the pro-leave presses C.It exposed the flaw in the Remain camp's lack of emotional arguments. D.It serves as a strong anti-establishment narrative.", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "BC", "file_name": "", "Answer Explanation": "The picture(400.png) revealed the dominent position of the pro-leave tabloids.As tabloids are always good at spreading simple arguments and slogans, this could be considered as a major factor. The memoir of a Remain campaign leader revealed their team's post-defeat analysis, with multiple statements highlighting the lack of emotional appeal in their arguments.（B）As Oliver recalled in his memoirs, here is a clip on their opinions:\n(a)(From Oliver himself) Our reading of the polling was the economy would trump immigration. It didn’t – at least not in the way we thought it would. Many found the big government numbers too big and too specific to be believable. We deployed a parade of experts, which should, in a rational world, have been more than enough to make the economic case for remain and against leaving. But it obviously wasn’t.\n(b)(From Roland Rudd) They(leave camp) were ‘nasty bastards’ – coming up with slogans (including‘project fear’ and ’ take back control’ ) that were effective.(c)(From Sir Brendan Barber) Brendan believes ‘Project Fear’ was overdone and the emergency budget backfired badly, saying, ‘The Chancellor and Alistair Darling were undoubtedly happy with it, but it came across as bullying and threats.’\n(d)(From Caroline Lucas) We won on the facts, but we lost on the emotional appeal … There were too many people who felt they had nothing to risk or lose\n"}
{"task_id": "058", "Question": "What's the name of the man in this picture?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Veit Rudolph Speckle ", "file_name": "058.png", "Answer Explanation": "058_Answer_Explanation.png"}
{"task_id": "371", "Question": "You are presented with an image of a 3rd century BCE statue made of marble, depicting a ruler in royal attire. What cultural and political significance can be inferred from the statue’s design, materials, and iconography, considering the historical context of the era? (If more than one answer, select more than one)             A. The ruler’s divine right to rule: The regal posture, intricate crown, and scepter suggest the ruler’s divine mandate and the belief in the ruler’s connection to the gods, reinforcing the divine right theory that was central to monarchies during the era.\n\nB. A symbol of military conquest: The ruler’s detailed armor and military stance suggest their power came from military conquest, likely symbolizing strength and dominance over neighboring territories.\n\nC. A representation of cultural fusion between Greek and local artistic traditions: The design incorporates both Hellenistic Greek and local artistic styles, reflecting the era’s political strategy of cultural unification to consolidate control over diverse regions.\n\nD. The ruler as a religious leader, rather than just a political figure: The use of divine symbols and ceremonial attire suggests the ruler’s role as a religious figure, merging the political and spiritual leadership of the region.\n", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "AC", "file_name": "371.png", "Answer Explanation": "Why A and C are the correct answers:\n • A. The ruler’s divine right to rule:\n • Explanation: The statue, with its regal posture, intricate crown, and scepter, symbolizes the ruler’s divine right to govern, which is a common concept in monarchies of ancient times. The depiction suggests that the ruler’s authority is divinely ordained, a political belief central to many ancient civilizations. This aligns with the iconography of rulers who were seen not only as political figures but also as divine or semi-divine beings with the mandate to rule.\n • C. A representation of cultural fusion between Greek and local artistic traditions:\n • Explanation: The design of the statue incorporates both Hellenistic Greek and local artistic styles, which reflects the blending of cultures. During the Hellenistic period, many regions were influenced by Greek culture, and this fusion in art and architecture was a common political strategy to consolidate power and unify diverse peoples under a single ruler. The statue’s design indicates an effort to combine Greek and local traditions, showcasing cultural integration for political purposes.\n\nWhy B and D are incorrect:\n • B. A symbol of military conquest:\n • Explanation: This option focuses on the statue’s armor and military stance, suggesting the ruler gained power through military conquest. However, the statue’s design emphasizes political and religious power through the crown and scepter, which are symbols of sovereignty and divine rule rather than military dominance. While the ruler may have been a military leader, the statue itself is more focused on the political and divine authority, not military conquest. Hence, B does not accurately reflect the main message of the statue.\n • D. The ruler as a religious leader, rather than just a political figure:\n • Explanation: While the statue may have some religious symbolism, such as the crown, it primarily emphasizes the ruler’s political and divine authority, not solely religious leadership. The figure depicted in the statue is likely a political leader with a divine mandate to rule, rather than a religious leader. Therefore, D overemphasizes the religious aspect, ignoring the political and cultural significance that the statue also conveys. The statue reflects the fusion of both political and religious aspects, not just one."}
{"task_id": "017", "Question": "Please finish the blanks with two numbers.\nIl Proletario started as a weekly and promptly went out of business in_____ due to lack of funds, but it soon was resurrected in Paterson, New Jersey, in_____. ", "Level": 1, "Answer Type": "exactMatch", "Final answer": "1897;1898", "file_name": "", "Answer Explanation": " Il Proletario started as a weekly and promptly went out of business in1897 due to lack of funds, but it soon was resurrected in Paterson, New Jersey, in 1898. "}
{"task_id": "019", "Question": "Please finishthe blank with a number.In 1825, in Franche-Comté the Duc de Choiseul received 1.5 million francs and ______hectares of forest. ", "Level": 1, "Answer Type": "exactMatch", "Final answer": 2000, "file_name": "", "Answer Explanation": "In 1825, in Franche-Comté the Duc de Choiseul received 1.5 million francs and 2000 hectares of forest. "}
{"task_id": "085", "Question": "why was Ibrāhīm Khān Zū al-Qadr ousted from the governorship of Fārs in 1555AD/ 962AH by Shāh Ṭahmāsb?Because he blinded who?", "Level": 3, "Answer Type": "exactMatch", "Final answer": "kalāntar", "file_name": "", "Answer Explanation": "Ibrāhīm Khān Zū al-Qadr was a son of Ilyās Bayg, the first Safavid governor of Fārs appointed by Shāh Isma'īl in 1503AD/ 909AH. When Ghāzī Khān Zū al-Qadr died in 946AH, he was appointed by Shāh Ṭahmāsb as successor of Ghāzī Khān. Because of his ability, Ibrāhīm Khān played a crucial role in the Safavid warfare agaisnt the rebels and the external enemies. He not only had a good relationsnhip with Bahrām Mīrzā, the Shāh's brother, but he also accumulated a lot of wealth through his position as governor of Fārs. The Shāh had already concerned about his influence in the Safavid political system, while Ibrāhīm Khān was so ambbitious that he wanted to consolidate his autority in the Fārs region and acted as a local Shāh. This was a situation that the Shāh could not tolerate. The Shāh was waiting for an opportunity to depose him from the governorship. In 1555AD/ 962AH, the opportunity came. Ibrāhīm Khān blinded a Shīrāzī kalāntar, an unusual action in the Safavid political system, so the Shāh seized the opportunity to outpost him."}
{"task_id": "403", "Question": "May I ask which country was the biggest obstacle for China in the disputes over water rights between the Nanjing Nationalist Government of 1930s and the countries like Britain, the United States, France and Japan? What was the main reason for that country to prevent the treaty? A. Britain, for economic reasons B. Britain, for military reasons C. United States, for economic reasons D. United States, for military reasons E. Japan, for economic reasons F. Japan, for military reasons", "Level": 3, "Answer Type": "exactMatch", "Final answer": "F  ", "file_name": "403_1.pdf;403_2.pdf;403_3.pdf;403_4.pdf;403_5.pdf;403_6.pdf;403_7.pdf;403_8.pdf", "Answer Explanation": "Although the customs and tax authorities of countries like Britain and the United States held greater influence, the reason why the case of the recovery of the waterway rights by the Nationalist Government ended without success in the end was mainly due to the fact that the Japanese side used various means to indefinitely postpone the implementation of the new regulations until the outbreak of the full-scale War of Resistance against Japanese Aggression. The trigger that prompted the Nationalist Government to accelerate the process of recovering the waterway rights was the December 8th Incident in Shanghai. During this process, the Navy Department of the Nationalist Government played an important role in training waterway workers and other aspects. The Japanese Navy Department and the General Staff Department also deeply participated in this diplomatic negotiation. Additionally, among various demands from Japan, it can be found that Japan has never given up the option of freely hiring waterway workers in order to obtain the right to ships entering and leaving ports, especially in the issue of military ships' access during the war."}
{"task_id": "357", "Question": "https://www.youtube.com/watch?v=KlM4_wln-rc\nこのビデオによると、次の歴史的推論のうちどれが間違っているでしょうか?\nA.この作戦はレイテ沖海戦の重要な部分であった。\nB.1521 年 3 月、初の地球一周航海の際、フェルディナンド・マゼランとその乗組員は、海戦が行われたこの場所を航海した最初のヨーロッパ人でした。\nC.日本海軍はアメリカ海軍に合計3隻の巡洋艦を失った。\nD.中将西村祥治は山城で戦死した。", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "", "Answer Explanation": "日本海軍はアメリカ海軍に合計2隻の巡洋艦（最上と阿武隈）を失った。"}
{"task_id": "035", "Question": "Richard Wilhelm hat in Frankfurter China-Institut ein paar wissenschaftliche Zeitschrifte veröffentlicht. Eine davon wurde an dem Namen 2 Mals geändert. Welche Zeitschrift ist es?   ", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Sinica. Zeitschrift für Chinakunde und Chinaforschung", "file_name": "", "Answer Explanation": "Sinica ist eine Zeitschrift vom China-Institut seit 1927, deren Vorgängerpublikation “Chinesische Blätter für Wissenschaft und Kunst” war. Im Jahr 1927 wurde die Sinica \"Sinica. Mitteilungen des China-Instituts zu Frankfurt am Main\" gennat. Ein Jahr später veränderte es sich nochmal, und wurde zu \"Sinica. Zeitschrift für Chinakunde und Chinaforschung\". "}
{"task_id": "247", "Question": "Which Chinese book does this illustration come from?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Tang Shi Hua Pu", "file_name": "247.png", "Answer Explanation": "This page comes from a set of illustrated volumes of Tang poetry. It depicts Wang Wei's Zhu Li Guan (The Bamboo Lodge).Wang Wei (701–761) was a renowned Chinese poet, painter, and musician during the Tang Dynasty. \"The Bamboo Lodge\" is a famous poem written by him, which reflects the themes of solitude and nature, often seen in his art and poetry."}
{"task_id": "137", "Question": "Which dynasty did this bamboo slip come from?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "qin", "file_name": "137.png", "Answer Explanation": "The first column in the slip reads: \"卅四年八月癸巳朔甲午，司空腾敢衷戍洞庭郡“This type of font mainly existed during the Qin and Han dynasties，and the chronology method used in this bamnoo slips only appeared in the Qin Dynasty and early Western Han Dynasty, considering that the reign of the Western Han kings during this period did not exceed thirty years,it could only be Qin dynesty.Besides,\"洞庭郡”only existed in Qin dynasty."}
{"task_id": "331", "Question": "In which city was this found?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Biharkresztes", "file_name": "331.jpg", "Answer Explanation": "Known from the source."}
{"task_id": "289", "Question": "Zhou Xin（周新）, originally named Zhou Zhixin, was from Nanhai, Guangdong. During the Ming Dynasty, in the Hongwu and Yongle periods, he served as an official in various capacities, including as a judge in the Dali Temple, an Imperial Censor, and an Inspector General. Renowned for his skill in adjudicating cases, he earned the nickname \"Cold-Faced Iron Magistrate.\" After his death, he was enshrined at the Wushan City God Temple in Hangzhou.\n\nAfter serving as a巡按 (circuit supervisor) in Fujian and Beijing during the Yongle period, where did Zhou Xin serve next?\nA. Zhejiang\nB. Yunnan\nC. Beijing\n", "Level": 2, "Answer Type": "exactMatch", "Final answer": "B", "file_name": "", "Answer Explanation": "据《明史》卷一六一《周新传》所载仕历，其巡按福建、北京后，“还朝，即擢云南按察使。未赴，改浙江。”考诸史实，这一说法有误。\n\n按《明太宗实录》，永乐三年（1405）九月丙申“升山西道监察御史周新为云南按察使”，永乐六年（1408）三月庚申“改河南布政司左参议易英、云南按察使周新皆于浙江”，周新实赴云南按察使之任。又西平侯沐晟彼时镇守云南，其弟昂协助理政。沐昂与众多云南官员有交往，其《素轩集》收录赠周新任满回京之诗《送周宪使》，是为周新任职云南之旁证（沐昂《素轩集》卷三，收《明别集丛刊》第1辑第34册，黄山：黄山书社，2013年，页32）。\n\n检国图藏三一三卷本《明史纪传》、四一六卷本《明史》之周新本传，均记周氏“还朝，即擢为云南按察使，久之，改浙江”（《明史纪传》卷八四，北京国家图书馆藏钞本，页3a；〔旧题〕万斯同《明史》卷二〇六，收《续修四库全书》，史部第67册，页570），大致无误。然王鸿绪雍正元年进呈本《明史稿》，误改为“还朝，即擢云南按察使，未赴，改浙江”（王鸿绪《明史稿》，《列传》卷四二，台北：文海出版社，页380），遂与史实乖离。\n\n王鸿绪之误改，应是受《国朝献征录》所收黄佐《周志新传》误导（焦竑《国朝献征录》卷八四《周志新传》，上海：上海书店出版社，1987年，页3565）。黄佐作此传，“用彭森所撰《传》、《水东日记》、《广州志》、《松江志》参修”，称周氏“擢云南按察使，未赴，有旨改浙江。”（黄佐《广州人物传》卷一四，收《四库全书存目丛书》，史部第90册，济南：齐鲁书社，1997年，页522、524）彭森《传》为黄《传》史源之一，检彭《传》，即称周新“已而擢云南按察使，未及莅政，有命转浙江。”（徐纮《皇明名臣琬琰录》卷一九《冷面寒铁公传》，收《原北平图书馆甲库善本丛书》第241册，北京：国家图书馆出版社，2013年，页1047）。由是，可厘清黄《传》、王《传》致误之由。而殿本《明史·周新传》之误，是承袭王鸿绪本而来。"}
{"task_id": "349", "Question": "What is the number of all Negroes found on board ships as attested by the signatures of Gilfillan and Wm. Armstrong?", "Level": 2, "Answer Type": "exactMatch", "Final answer": 286, "file_name": "349.webp", "Answer Explanation": "We Whose Names are hereunto subscribed do certifie that we did carefully inspect the afore going Vessels on the 30th Day of Novemr 1783. And that on board the said Vessels we found, the Negroes mentioned in the afore going List, amounting to One Hundred and forty Two Men, Ninety Women, and fifty four Children, and to the best of our Judgement, believe them to be all the Negroes on Board the said Vessels"}
{"task_id": "030", "Question": "Please finish the blank with a number.\n Gregory King in his 1696 work noted that the per capita taxes paid in Holland were _____times greater than the per capita tax revenues in England and France. ", "Level": 1, "Answer Type": "exactMatch", "Final answer": 2.5, "file_name": "", "Answer Explanation": "Gregory King in his 1696 work noted that the per capita taxes paid in Holland were 2.5 times greater than the per capita tax revenues in England and France."}
{"task_id": "053", "Question": "What are the two key characters for identifying these bamboo slips?【Please answer in the language of the material】", "Level": 2, "Answer Type": "exactMatch", "Final answer": "敝昔", "file_name": "053.png", "Answer Explanation": "Tianhui Medical Bamboo Slips "}
{"task_id": "350", "Question": "Where in what year was this film most likely shot?\nA.1860, London, England\nB.1914, California, USA\nC.1942, Vancouver, Canada\nD.1918, Delhi, India", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "350.mp4", "Answer Explanation": "Records the Golden Spike celebration of the completion of the Northwestern Pacific Railroad on 23 October 1914 at Kane's Rock, Humboldt County, California.\n4'36″ logo on the train: “Redwood Empire Special”；\n9'44″ subtitle:\"Giant Southern Pacific engines haul 9,175-ton cargo over the Sierra .. the longest and heaviest train ever taken'over the hill\" in one block\""}
{"task_id": "068", "Question": "Uit welk boek komt deze afbeelding? Wie heeft het geschreven?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Het Amboinsche Kruidboek \nGeorgius Everhardus Rumphius", "file_name": "068.jpg", "Answer Explanation": "Identifying the picture "}
{"task_id": "399", "Question": "Read the ancient text and decide which of the following types of all crimes is not mentioned in the text?\nA Public disorder; B Personal debt and property disputes; C Disruption of military administration; D Sex offenses; E Violation of business codes; F Crimes of official duty", "Level": 3, "Answer Type": "exactMatch", "Final answer": "F", "file_name": "399.png", "Answer Explanation": "Gu tang lv shu yi (Thirty volumes)，published in Yuan Dynasty [1271-1368] \"保任不如所任，證不言情，詐冒官司。\n第二十六卷 雜律 凡三十四條\n坐賊致罪，國忌作樂，私鑄銭，城内街巷走車馬，向城官私宅射，施機鎗作坑穽，醫合藥不如方，丁匠防人等疾病，受寄彻費用。一問荅。\n負債違契不償，負債强撁掣畜產。良人爲奴婢質債，错認良人爲奴婢。愽戯賭財物，舎宅車服器物，侵巷街阡陌，占山野陂湖利。犯夜，從征從行身死，應給傳送剩取，不應入驛而入。姦徒一年半，姦x麻親及妻 姦從祖母姑 ，姦父祖妾 。一問荅。\n奴姦良人，和姦無婦女罪名，監主於監守內姦，校斛斗秤度，器用絹布行濫\""}
{"task_id": "370", "Question": "Which literary work's translation is shown in the picture?", "Level": 3, "Answer Type": "exactMatch", "Final answer": "A Midsummer Night's Dream", "file_name": "370.png", "Answer Explanation": "The picture shows an excerpt from Zhu Shenghao's manuscript translation of William Shakespeare's A Midsummer Night's Dream."}
{"task_id": "010", "Question": "Please finish the blank with a numbers.\n_______consultants participated in the AISA Conference (Association of International Schools in Africa) in 1972.", "Level": 1, "Answer Type": "exactMatch", "Final answer": 5, "file_name": "", "Answer Explanation": " Even though there was some concern about whether the organization would ever come together, Travis continued to push for formalization of the Sub-Sahara Regional Group by agreeing to host the December 1972 conference in Addis Ababa. This was to become one of the three most important conferences in the first 12 years of AISA history, with a larger attendance at this meeting than at the previous two in Kampala and Kinshasa.Of 28 participants, 5 were consultants."}
{"task_id": "044", "Question": "This map depicts mining in Qing Dynasty China.What minerals were they mining?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "silver", "file_name": "044.png", "Answer Explanation": "Interpretation: The mountain in the picture is a mine, there is a mine cave in the mountain, and under the mountain there are many people picking, carrying, and picking the ore, and washing the ore in the water pond by the river, which shows the mining of the traditional silver ore mines in Yunnan."}
{"task_id": "123", "Question": "who might be the author of this drawing?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Pieter Schenk", "file_name": "123.png", "Answer Explanation": "This is a printing titled Two Chinese Ladies Playing Cards, ca. 1711–1720, etching, hand colored, 24.0 × 16.8 cm. it is made by Pieter Schenk II,engraver, dealer and publisher in Amsterdam and Leipzig. \nThis print now is in the collection of Rijksmuseum, Amsterdam."}
{"task_id": "197", "Question": "What year was this newspaper published?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 1922, "file_name": "197.png", "Answer Explanation": "The American Commercial Counsellor's letter for the relief of the redundant copper coins was published in 1922."}
{"task_id": "064", "Question": "Что явилось одной из главных причин кризиса золотодобывающего комплекса Дальстроя после 1953 г.? \nА. снижение обеспеченности запасами россыпного золота\nБ. перевод всей производственной системы организации на свободный труд\nВ. дефицит квалифицированных кадров\nГ. проблемы организации принудительного труда", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "Б", "file_name": "", "Answer Explanation": "Гребенюк П. С. Кризис Дальстроя и проблемы развития золотодобывающего комплекса на Северо-Востоке СССР в 1954-1957 гг., Новейшая история России, Т. 13, №4, 2023:\nВ статье рассматриваются основные факторы развития золотодобывающего комплекса Дальстроя после создания в декабре 1953 г. Магаданской области. Причинами кризисных явленийв золотодобыче Дальстроя с конца 1940-х гг. были многие факторы, в том числе снижение обеспеченности запасами россыпного золота, уменьшение среднего содержания золота в песках, дефицит квалифицированных кадров, проблемы организации принудительного труда, а также управленческие решения, определившие сосредоточение поисковых работ на золоторудных месторождениях в пределах Колымской золотоносной зоны и переориентацию Дальстроя преимущественно на разведку и добычу олова. Одной из главных причин кризиса золотодобычи после 1953 г. являлся перевод всей производственной системы организации на свободный труд. Процесс трансформации экономической модели сопровождался проблемами организации свободного и принудительного труда, высокой текучестью кадров, необходимостью подбора квалифицированного персонала для обслуживания бульдозеров, экскаваторов и промывочных приборов, размещения, благоустройства и создания условий для гражданских работников, в том числе бывших спецпоселенцев, а также обеспечения работы с заключенными на новых договорных условиях. Численность работников золотодобывающей промышленности за 1953-1957 гг. сократилась более чем в два с половиной раза. Руководство региона, сохраняя систему льгот и опираясь на отработанные схемы (оргнабор, общественный призыв) и административные ресурсы, пыталось заместить персонал. Использование принудительного труда заключенных против привлечения «вольнонаемных» работников на золотодобыче Северо-Востока в 1950-е гг. уже не было обусловлено экономическим расчетом в сравнении с периодом 1930-х - первой половины 1940-х гг. В 1950-е гг. вместе с уменьшением объемов ручной работы, ростом механизации и автоматизации труд заключенных становился все более затратным и менее эффективным."}
{"task_id": "203", "Question": "According to Linda Bryder's paper \"Sex, Race, and Colonialism: An Historiographical Review\", in which part of the city were Hong Kong's licensed brothels serving Europeans located?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "eastern end", "file_name": "", "Answer Explanation": "Licensed brothels in Hong Kong were segregated - thosecatering for Europeans at the eastern end of the city, those for Chinese atthe western end."}
{"task_id": "334", "Question": "What field is this fragment of bamboo slip mainly related to?\nA. military B. economy C. administration D. faith and belief", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "334.jpeg", "Answer Explanation": "The original text mentions:“夷胡隧七石具弩傷二” indicates that the soldier wounded the enemy  by his nu.Thus,the answer  is A"}
{"task_id": "145", "Question": "What year was this photo taken？", "Level": 1, "Answer Type": "exactMatch", "Final answer": 1943, "file_name": "145.jpg", "Answer Explanation": "There is an introduction below the image on page 36 of the article"}
{"task_id": "348", "Question": "How old is Isaac Wilkins?", "Level": 2, "Answer Type": "exactMatch", "Final answer": 15, "file_name": "348.webp", "Answer Explanation": "The answer is in line 25 of the table"}
{"task_id": "263", "Question": "What is the name of the first person on the left in this picture?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Isb", "file_name": "263.jpg", "Answer Explanation": ""}
{"task_id": "065", "Question": "Which two of the following are Republicans in the Democratic-Republican community?A. George Moser  B. John Watts  C. David Allison  D. Daniel Morgan", "Level": 2, "Answer Type": "Multiple choice", "Final answer": "A", "file_name": "", "Answer Explanation": "George Moser is President of the Republican Society of Lancaster County, Pennsylvania\n"}
{"task_id": "358", "Question": "https://archive.org/details/MarketStreet19064KScan20181016\nIn this video, the cameraman is walking straight down the street toward a specific high-rise building at the end of the road. Which of the following statements about this building is incorrect?\nA.\tThe completion of the Golden Gate Bridge increased the building's passenger flow.\nB.\tThe 1906 earthquake caused severe damage to the building.\nC.\tThe architect of this bulding also designed the William Berryman Scott House.\nD.\tThe building is an example of the late 19th century Beaux-Arts style.", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "", "Answer Explanation": "From the front of a cable car, a motion picture camera records a trip down Market Street, San Francisco, California, from a point between 8th & 9th Streets, Eastward to the cable car turnaround at the Ferry Building. The well built reinforced Ferry Building with its arched arcades survived both the 1906 and the 1989 earthquakes with little damage."}
{"task_id": "162", "Question": "Who is the person in the photo? [Answer in Chinese]", "Level": 1, "Answer Type": "exactMatch", "Final answer": "端方", "file_name": "162.jpg", "Answer Explanation": "can be seen from the inscriptions \non both sides of the photo"}
{"task_id": "081", "Question": "The Stele is written in Aramaic in 9th century BCE. What is mentioned in the inscription? A. House of David B. Solomon the king C.Shāhanshāh D. King of Israel", "Level": 3, "Answer Type": "Multiple Choice", "Final answer": "A", "file_name": "081.png", "Answer Explanation": "The Tel Dan Stele is a fragmentary stele containing an Aramaic inscription which dates to the 9th century BCE. It is the earliest known extra-biblical archaeological reference to the house of David."}
{"task_id": "303", "Question": "At The Manufacturers' and Mechanics' Dinner in Philadelphia in 1809, Adam Seybert delivered a famous speech, praising both the development of manufacturing and reflecting the changes that had begun to occur in the minds of people at that time. He emphasized the importance of improving machines. Which two items were not included in the reasons?\nA.Adapt to the production structure dominated by large-scale manufacturing \nB.Respond to the demands of the members of the domestic society and premium society \nC.Emphasizing the differentiation of mechanics \nD.Deny the image of the manufacturer as a non-producer \nE.Emphasized that the factory should replace the functions of the mechanics' committee\n", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "A、C", "file_name": "", "Answer Explanation": "Among many manufacturing institutions, large-scale manufacturing did not gain the upper hand in the early 19th century. Although manufacturers had developed the consciousness of industrial capitalists, they still relied to a large extent on mechanics.\n"}
{"task_id": "244", "Question": "Tang Zonghai is a famous Chinese medicine scholar in modern times; he invented the concept of \"qihua\" to counter the anatomical theory of Western medicine, and the historical community has studied it in depth. Which of the following is NOT the theoretical source of Tang Zonghai's concept of 'qihua'?\nA.Basic theories of traditional Chinese medicine\nB.Steam engines and water vapour\nC.Hot gases from combustion\nD.The breath produced by the human breath.", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "", "Answer Explanation": "Authoritative scholars Sean Hsiang-lin Lei believe that Tang Zonghai proposed this theory inspired by the steam engine, but there is also a word for qihua in the basic theory of traditional Chinese medicine."}
{"task_id": "315", "Question": "Who manages the affairs of the Imperial Tea Room?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Sheng Zhu and Buyan Dalai", "file_name": "315.jpg", "Answer Explanation": "The second and third columns of the document provide answers to the questions"}
{"task_id": "235", "Question": "On September 15, 1944, Chiang Kai-shek talked with General Carton de Mart. In addition to mentioning the latest situation in the Chinese theater, he also mentioned the Allied operations in which theater\nA、Pacific theater\nB.、Soviet-German theater\nC.、Bakhtiari theater\nD.、Burma theater\nE.、North African theater\nF.、Western theater in Europe\nG.、Nordic theater\n", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "", "Answer Explanation": "The National Archives, Reference: FO 954/7A/193, contains a detailed account of this conversation.Following for prime minister from General carton de mart.\nSaw Chiang kai-shek who maintains that kweilin will hold out for two or three months.I do not think so but even if it does it will not alter the fate that the airfields will be unusable。 This will leave only liuchow as an eastern airfield for bombers and its position makes it very insecure if kweilin is invested and Japanese advance from the south continues as it is doing at present。\nChiang kai-shek  asked me if i know what decisions had been taken during Mountbatten’s Visit to England。I replied i had no information on the subject。 Mountbatten  wishes me to tell Chiang kai-shek  that he （Mountbatten）is to exploit the success obtained by fourteenth army and northern combat area command. I prefer aimoly to say i do not know the decisions the decisions arrived at as it is ridiculous to expect Chiang kai-shek visit  to England resulted merely in such a decision, he will at once see decisions have been taken which we do not wish to divulge. I am certain that information given solely to Chiang kai-shek will go no further and i do not see how we can expect his whole-hearted cooperation unless we give him information on broad lines. He also asked if I knew anything about  the Quebec conference. I said i did not.\n  He then spoke about the allied force that is to operate in the Bakhtiari theatre and he hoped that British troops were to be included in this force. I said I had no information on the subject but very much doubted it. He wished me to wire to you expressing his hope that the British Government would do their utmost to arrange this. He attached much importance to this point."}
{"task_id": "172", "Question": " In order to demonstrate the brilliance of culture and the self-esteem of the country to Japan, the North Korean mission has a set of measures.\nWhat is this set of customary forms?\n", "Level": 1, "Answer Type": "exactMatch", "Final answer": " Wearing Tang style Taoist robes and military uniforms", "file_name": "", "Answer Explanation": "In order to demonstrate the brilliance of culture and the self-esteem of the country to Japan, the North Korean mission has a set of measures。The usual form is that as soon as the ship arrives on the other side, the members of the delegation \"all wear Tang Dynasty Taoist robes and assist the generals in battle\nKasai military uniform, like crossing the sea ritual. In that era, the system of clothing and headwear was often a symbol of civilization.The embassy always displays the authentic civilization in solemn traditional costumes.\n"}
{"task_id": "039", "Question": "Wie hoch war der Beteiligungsanteil der Luftschiffbau Zeppelin GmbH an der Dornier-Tochtergesellschaft des LBZ-Konzerns bis zum Jahr 1932?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "56,66%", "file_name": "", "Answer Explanation": "Bis 1932 ergab sich folgender Beteiligungsschlüssel bei der Dornier-Tochter des LBZ-Konzerns: Luftschiffbau Zeppelin GmbH 56,66%, Aero-Union (bzw. Deutscher Aero-Lloyd bzw. Luft-Hansa) 33,33%, Claude Dornier 10%."}
{"task_id": "130", "Question": "According to the 2001 mother tongue cencus of Ukraine, which district (using up-to-date administrative division) did the largest Rusyn-speaking population dwell in among Transcarpathia?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Mukachevo Raion", "file_name": "", "Answer Explanation": "130.jpg"}
{"task_id": "122", "Question": "What might be the theme of this screen?\nA.  Spring Morning in the Han Palace\nB.  Ladies in the Shade of Paulownia", "Level": 1, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "122.png", "Answer Explanation": "Titled Spring Morning in the Han Palace (Han Gong Chun Xiao), the composition presents an idealized, ahistorical view of the lives of women in an imperial palace of the Han dynasty (206 BCE–220 CE)."}
{"task_id": "179", "Question": "Who is the foreigner in the back row, second from the left?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Morris 'Two Gun' Cohen（Morris Abraham Cohen）", "file_name": "179.jpg", "Answer Explanation": "This photo was taken in July 1925 at a memorial to Dr. Sun Yat-sen.General Morris ‘Two Gun’ Cohen is at the back, second from the left."}
{"task_id": "343", "Question": "Please tell me based on the picture information, who is the left-wing supervisor for the sixth year of Daoguang?[Answer in Chinese]", "Level": 2, "Answer Type": "exactMatch", "Final answer": "奕经", "file_name": "343.png", "Answer Explanation": "Judging based on image information"}
{"task_id": "286", "Question": "Who is the painter of the map?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Cheng Dachang", "file_name": "286.png", "Answer Explanation": "Cheng Dachang, a scholar of the Southern Song dynasty, depicted the Yugong shanchuan dili tu in the fourth year of Chunxi (1177). "}
{"task_id": "412", "Question": "In which monastery were these murals found?", "Level": 3, "Answer Type": "exactMatch", "Final answer": "St. George's Cathedral Yuriev Monastery (Георгиевского собора Юрьева монастыря)", "file_name": "412.jpg", "Answer Explanation": "Known from the source."}
{"task_id": "344", "Question": "According to this article, multiple counties and prefectures were established in this area throughout history, and their changes and relocations have made it difficult to verify the local history. Which counties and prefectures are mentioned in the article? [Answer in Chinese]", "Level": 2, "Answer Type": "exactMatch", "Final answer": "胶东郡（县）、长广郡（县）、即墨县、卢乡县", "file_name": "344.png", "Answer Explanation": "国朝以昌潍与平度均属莱州府，而平度为散州，名始定焉。此其广轮所届，瞭然可见者也。然其间代祀绵邈，沿革纠纷，胶东、长广递为郡县，即墨、卢乡移徙分更，非溯厥源流，徵山川，考城池，乌得其条贯而无所差池？旧志召其乡先生官一夔撰"}
{"task_id": "003", "Question": "Please finish the blank with a name.\nAccording to \" A Historiographic Review of Literature on the Origins of the Arab-Israeli Conflict\",_______in his book condemns Britain's failure to use sufficient force to end the Arab rebellion in 1936。", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Answer: H. J. Simson", "file_name": "", "Answer Explanation": "In a stunningly blunt manner, H. J. Simson, in British Rule and Rebellion (1937), condemns Britain's failure to use sufficient force to end the Arab rebellion in 1936."}
{"task_id": "266", "Question": "Read the article “Life of the Party” in that manuscript and answer what is the name of the present-day secretary?(For answers, please use the language referred to in the material)", "Level": 2, "Answer Type": "exactMatch", "Final answer": "王香保", "file_name": "266.jpg", "Answer Explanation": "Chinese Newspaper Identification and Transcription in the 1920s\"【党的生活】四号运输工会少年共产团的工作刷新（王东山）\n运输工会四号工人中少年共产团二十六号小组，从成立至今已经八个多月。当初成立的时候有俄国同志在内协同做工，成绩狠好，后来俄国同志有别的工作，不能长久在此帮忙，而小组书记又因工作忙碌，不能按时到会，工作不免有些衰落情形。八个多月中间增加了十余名团员，在数目上算是不错，然而在知识和训练上却是没有一点进步。因为三个月未曾开一次会，怎样能得训练和研究的机会呢？其未能开会的原因：（一）因为书记工作多不能按时到会。（二）秋季运输工会干活时候太多，没有时间到会。去年十二月二十日召集了一个小组的全体大会，举王香保同志为新的书记，照第二区团部的计划，共三分部:（一）组织由王深林负责。（二）政治由王香保负责。（三）经济由蔡洪友负责。决定今后每星期开大会一次，开讨论会一次，半月出一次壁报，各同志按时到会，所负的责任都要督促他切实进行，以后二十六组少年共产团才能有相当进步。\n\""}
{"task_id": "226", "Question": "According to the 2001 mother tongue cencus of Ukraine, which district (using up-to-date administrative division) did the largest Rusyn-speaking population dwell in among Transcarpathia?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Viipuri", "file_name": "226.jpg", "Answer Explanation": "The historic town of Viipuri, the regional centre of Karelia, was the subject of the first published “realistic” landscape image from Finland. It remained a permanent feature of Finnish landscape imagery until its cession to Soviet Union in 1944. (Dahlberg 1716)."}
{"task_id": "176", "Question": "Where is this historical material stored?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Shanghai Library\n", "file_name": "176.png", "Answer Explanation": "Judging based on the seal in the picture\n\n\n\n\n\n"}
{"task_id": "301", "Question": "Nathaniel Aspinwall introduced the sericulture industry to Connecticut, New York, New Jersey and Pennsylvania from the 1760s to the 1790s, but failed to drive the sericulture boom. Which of the following is not the main reason?\nA.The United States lacked cocoon markets. B.The French Revolution diverted people's attention from the silkworm industry in the north due to cotton cultivation in the southern United States C.Britain abandoned the prohibitory system D.Northern Americans attach more importance to business\n", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "", "Answer Explanation": "The abandonment of the prohibitory system by Britain was the reason for the expansion of the American silk market in the early 19th century."}
{"task_id": "104", "Question": "Which ancient greek papyrus is this excerpt below taken from: \nκληδὼν δὲ κλίτα ὡς Πίτωνα τοξεύσας,\nτῶι Ζεὺς δαιδουχεῖ παρ' ἡμέραν κατ' ἄγαν,\nτῶι γᾶς ἐν βώλοις ξανθοὶ τίκτονται καρποί.\nA.Papyrus of Vienna G29825\nB.Berlin Papyrus 6870\nC.Papyrus Oxyrhynchus 2436\nD.Papyrus Oslo 1\n", "Level": 1, "Answer Type": "mutipleChioce", "Final answer": "B", "file_name": "", "Answer Explanation": "The papyrus signed with number 6870 in the Berlin Egyptian Museum was discovered in 1918 in Contrapollinopolis (Tebais), being a reverse of a military document dated for the end of the year 156 AD, which is terminus ante quam non for the whole document. The discovery has become famous thanks to the five musical fragments - three pieces of them have text with musical notation inscribed above, and two are only musical notes. Among these three pieces of poetry with musical notation only one - the paian - is interesting, because the other two we can hardly call even fragmentary: there are just few letters.\nStandard edition of the text with supplementation by M.L. West from West-Pohlmann “canonical” edition40 looks as below:\nΠαιάν, ώ Παιάν, [χα] Ip’ ώνα[ξ κτήτορ Πυθοΰς,] \nτον Δάλου τέρπει τάς [άμφικλύστας αϋ]λών, \nκαι δ{εfivai Ξάνθου [γάς σύγκληροι Τερμι]λών \nπαγαί τ’ Ίσμηνο[ΰ καλλικράνου τ’] Εύ[ρώ]τα· \nΠαιάν, δς Μούσα[ις κύκλωι τάς \"Ιππου] κράνας \nϋμνων έξάρ[χεις καλάν άνδεί]ξας φωνάν, \nδς πϋρ β[αλλούσαις άμφ’ αϊγλαν] χαίταις στέψας \nΛατοΰ[ς τι μωρών ηιξας σάς] ματρός λώβαν \nκληδών ά[φθαρτας παΐδ’ άμπίσχει τον Λατοΰ]ς, \nτώι Ζευς· δαιδουχεΐ [στιλπνάν έξάψας αύ]γάν, \nτώι γάς έν βώλοις ξα[νθοί τίκτονται καρποί.\n"}
{"task_id": "067", "Question": "Wie heeft dit manuscript geschreven?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Frederick  Schouman", "file_name": "067.png", "Answer Explanation": "The author of this manuscript"}
{"task_id": "119", "Question": "Which army unit did Harry Jerele serve in?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "\t192nd Tank Battalion\n", "file_name": "119.png", "Answer Explanation": "According to the Defense POW/MIA Accounting Agency (DPAA), U.S. Army Private 1st Class Harry Jerele, 26, of Berkeley, Illinois, who was captured and died as a prisoner of war during World War II, was accounted for December 20, 2023. The original source provides this photo and other information."}
{"task_id": "304", "Question": "Please confirm which period of water conditions in the lower reaches of the Huangpu River is depicted in this picture from the customs?\nA. Early 19th century\nB. Late 19th century\nC. Early 20th century", "Level": 2, "Answer Type": "exactMatch", "Final answer": "B", "file_name": "304.png", "Answer Explanation": "It was not until the 1860s that the Shanghai Port Affairs Department of the Chinese Customs initiated to conduct regular monitoring of the Huangpu River channel. According to the Huangpu River survey report by the tax office from 1872 to 1893, the comparison of sediment and soil on the embankment in Wusong shows that a large portion of the sediment deposited in the Huangpu River comes from both banks of the river. During seasons with heavy rainfall, it is prone to cause embankment collapse. By the end of the 19th century, the shoals in the lower reaches of the Huangpu River expanded again and the riverbed deepened. During this period, the area of Rat Sand also expanded rapidly, squeezing out a large amount of waterway space. The aforementioned situation is consistent with the hydrological data of the waterway shown in the figure."}
{"task_id": "268", "Question": "What rank was granted to the volunteer Wang Rui (义勇王瑞) after the successful suppression of the Taiwan uprising?(For answers, please use the language referred to in the material)", "Level": 2, "Answer Type": "exactMatch", "Final answer": "九品顶带", "file_name": "268_1.png;268_2.png", "Answer Explanation": "该题目考察AI竖排繁体的识别能力，选用清代《上谕档》这一常见史料，字迹工整，识别难度较低，并附有对应奏折点校竖排本，也可以锻炼AI运用已有知识识别史料的能力。这段文字涉及到的人名、地名数量较多，可以对照训练。此外，文本中包含着大量的官制、奖励相关的用语，这些用语具有固定的使用规范和特定的含义。\n能否精准识别出 “奉上谕” 等具有标志性的奏折书写固定格式，并且能够判断出所处理的文本属于奏折体裁，进而依据相关规则进行合理的句读，成为了检验其能力的关键所在。\"\n咸丰二年十月初五日内阁奉上谕：\n恒裕、徐宗干奏查明拿获匪犯出力各员恳请鼓励并开单呈览一折。上年台湾匪犯王湧等造谣滋事经该镇道督饬所属文武先期访拿，立时扑灭，办理甚属妥速。除该镇道已加恩交部议叙外，所有获犯出力及捐资较多之文武员弁、义首人等，自应分别施恩，以昭激励：台湾府知府裕铎等赏加道衔；副将衔署北路协副将嘉义营参将吕大陆，著交部从优议叙；署城守营参将镇标中营游击富兴阿、署嘉义营参将镇标左营游击曾玉明，均著以参将升用；署淡水厅候补同知朱材哲，著遇有同知缺出，不论繁简，即行补用，并赏加知府衔；署嘉义县知县补缺后即补直隶州知州丁曰健，著准其免补知县本班，即以同知直隶州补用；署淡水厅同知即补通判张启煊，著俟补缺后以同知升用，先换顶带；彰化县知县高鸿飞，著以同知即行补用，嘉义营斗六门都司凌敬先，著赏加游击衔；北路协中营都司升补镇标右营游击曾元福，著交部从优议叙；嘉义营守备李维生，著以都司升用，先换顶带；留台委用建宁镇标守备曹宗铨，著以都司留闽补用；头围县丞王霈，著以知县即行升用；署笨港县城准补漳州府经历张征庸，著以知县升用；准补南投县令吕庆麟，著以应升之缺即行补用；候补县丞程荣春著以县丞，遇缺前补用；候补县丞张传敬、沈时熙，均著赏给六品衔；佳里兴巡检周瑞堂，著以县丞，遇缺即行升用；竹堑巡检俞国祺，著以县丞尽先升用；兴隆里巡检王衢，著以府经历县丞即行补用；大甲巡检陈澧、准补南平县典史高桂馨，均著以县丞升用；候补从九品赵德璜、白鸾卿，均著俟补缺后，以应升之缺即行补用；镇标中营千总项国柱、左营千总江景星，均著以守备留闽升用；北路协右营千总倪捷陞、中营千总钟孝臣，均著以守备留闽即行补用，与项国柱、江景星均先换顶带；葫芦墩汛千总杨建中、镇标候补千总陈捷斌，均著给予守备衔；五品顶带即补千总周梦渭，著俟候补缺后，以守备即补；镇标中营把总杨荣陞，著给予千总衔。北路营额外许清福，著以外委即补；镇标中营把总林登龙、艋舺营外委龚朝俊、大甲汛外委黄日高、嘉义营额外陈彦龄、屯外委莫耿光，均著赏给六品顶带；兵丁苏用璋、林朱俊、陈玉胜、黄超英、吕文良、梁国瑞、欧阳恩，均著以额外即补；义勇王瑞、谢旺、卢斌、吴淮，均著赏给九品顶带。台湾府学教授徐世昌，著赏加六品衔；绅士候选通判杨士珩，著赏加五品衔；义首贡生刘煦、附生黄尚青、高鹏飞、武生翁志朝、武监生李朝荣、俊秀陈恩湛、陈登郡、杨五湖、陈锦川，均著赏给六品顶带；武生戴廷耀、俊秀蔡克勋、齐祥琳，均著赏给八品顶带；民人翁种玉、林洪文、谢应昌、陈德胜、胡珠光、吕世芳、王秉刚、杜春贵、李树珍、杨明修，均著赏给九品顶带。其捐资之布政司理问衔陈维菁，著以詹事府主簿，双月选用；布政司经历衔陈宗元，著以布政司经历，双月选用；山东候补从九品季蓁，著由该省以本班尽先补用；监生陈澄和，著给予太常寺典簿衔；武童吕达芳，著给予千总衔；俊秀吴邦彦，著给予布政司理问衔；俊秀丁继鸿，著作为贡生。所有两次垫用银两，除捐项抵补外，余由该府另筹归款，著免其造册报销。余著照所议办理。该部知道，单并发。钦此。\""}
{"task_id": "297", "Question": "This poem is the English translation of a Chinese poem by the Chinese poet Guo Moruo. Which poem of his is it? [Answer in Chinese]", "Level": 2, "Answer Type": "exactMatch", "Final answer": "《夜步十里松原》", "file_name": "297.png", "Answer Explanation": "The original text of this English translation poem is \"Ye Bu Shi Li Song Yuan\" (夜步十里松原) by Chinese poet Liang Zongdai, which is included in 100 Modern Chinese Poems (1982) by Pang Bingjun, John Minford and Sean Golden."}
{"task_id": "322", "Question": "分析史料，岑仲勉认为娄泉是贺娄伏连的孙子吗？请回答：“是”或者“否”。", "Level": 2, "Answer Type": "exactMatch", "Final answer": "是", "file_name": "322.png", "Answer Explanation": "《元和姓纂》卷九“贺楼”氏“河南”房云：  “后魏镇西大将军、广陵王贺娄伏连，生大拔、蒙。曾孙行本，唐凤州刺史、梁公。泉，武安公。宝，后魏太子太傅、广平伯；生景贤，阳平公。景贤生诠、诠、子干，隋巨鹿公。”岑仲勉校记曰：“《北史》二十《伏连传》:  ‘大拔孙宝，字道成。……天子感其壮志，召宝第二子景贤，……后从入关，封广宁县伯。……后授国子祭酒、侍中，进仪同三司、兼太子太傅。’是宝为大拔之孙，中间尚缺一代，意者泉即大拔之子、宝之父欤。若然，则‘泉’上最少夺‘大拔子’三字，‘宝'上最少夺‘生’字矣。史作‘广宁’此作‘广平’,未详孰是。”由此可知，贺娄伏连之子为大拔，大拔子为娄泉。"}
{"task_id": "193", "Question": "What was the incidence rate in zhejiang province in 1969?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "1000 per 100,000 people.", "file_name": "193.png", "Answer Explanation": "According to the the picture."}
{"task_id": "314", "Question": "Según el razonamiento expresado en el texto, ¿cuál es la conclusión más adecuada sobre la situación de ventas y gestión en el Jardín Zoológico durante el periodo considerado?\nA. Las irregularidades en las ventas del Jardín Zoológico se deben a la negligencia del director, quien nunca propuso ninguna reglamentación interna.\nB. Aunque existen riesgos de abuso por la falta de formalidad en las ventas, no se puede responsabilizar directamente al director, dado que sí había propuesto reglas y la responsabilidad es compartida por la ausencia de normativa vigente.\nC. El uso de una tarifa fija basada en parques extranjeros protege al Jardín de cualquier tipo de pérdida o abuso en la venta de productos.\nD. La única solución viable es cerrar el Jardín Zoológico, ya que el sistema de ventas ha resultado completamente insostenible.\n", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "B ", "file_name": "314.png", "Answer Explanation": "A es incorrecta: El texto dice explícitamente que “ni aun siquiera se puede culpar al Sr. Graells”, ya que en 1864 sí propuso un reglamento para mejorar la gestión;\nB es correcta: Resume fielmente el núcleo argumental del párrafo：Aunque existen riesgos institucionales, en la etapa actual no se puede atribuir la responsabilidad a Graells, quien intentó llevar a cabo reformas;\nC es incorrecta：La tarifa fija, aunque controlada, también genera perjuicios, ya que impide ajustes a la demanda；\nD es incorrecta：extrapola erróneamente el razonamiento, ya que el texto no menciona el cierre del zoológico, sino que enfatiza la necesidad de construir un sistema institucional en el futuro («Consideraciones… para el porvenir…»)."}
{"task_id": "274", "Question": "On which island is Saluafata harbor, surveyed by George F. Emmons in 1839, located?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Upolu", "file_name": "274.jpg", "Answer Explanation": "The map sketch was drawn when George F. Emmons was surveying Saluafata harbor on Upolu Island in 1839."}
{"task_id": "089", "Question": "The man depicted in Portrait No. 40 underwent a tumor removal surgery performed by Dr. Peter Parker. Among the following four individuals, who did not assist Dr. Peter Parker in this surgery?\nA. Messrs Cox\nB. Holgate\nC. Jardine\nD. Cullen", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "089.png", "Answer Explanation": "Seventh report, Chinese Repository vol. 6. 1836-1837, p. 436-437: No. 3488. Cartilaginous tumor. Woo Pun, aged 41, a shoemaker of Pwanyü, have been afflicted with a large unshapen tumor upon the left side of his neck. It hung pendulous from the submaxilliary, extending backward over the external jugular vein and carotid artery, forwards to the opposite side of the trachea and downwards to the breast. For the last ten years its growth was rapid, and from its magnitude it had become very cumbersome. It was as large as the man’s head, and so hard as not to yield to the pressure of the thumb. Centrally it was diseased and having perforated by an escharotics of an Chinese practitioner, it emitted a most offensive discharge. The aperture was half an inch in diameter and as regular as if formed by a drill. The patient kept it closed with a stopple, every morning evacuating some ounces of offensive fluid. His constitution had begun to suffer. On the 19th June, assisted by Messrs Cox, Cullen and Jardine, the tumor was removed in about five minutes. Several veins of considerable size were divided. (...) The tumor was two feet in circumference and weighed 7 lbs. The patient scarce uttered a groan. In twenty minutes he was comfortable in bed. (...) At 1 o’clock A.M. a servant called; and when I arrived at the hospital, the poor man was apparently gasping his last. He was very bloody and evidently made a desperate struggle without success to loosen the bandage. The neck was instantly freed of the roller. His pulse was just perceptible, his extremities were already cold; he foamed at the nose, and breathed stertorously, as in apoplexy. His mouth was immediately freed of phlegm, and his nose of blood; stimulants were applied, and also administered internally, and bottles of warm water put to his feet. (...) Probably the brother [his brother?] fell asleep and awoke only by the almost dying struggle of the patient. Two or three minutes delay in coming to his relief might have been too late! (...) In one month he was perfectly recovered. He has repeatedly visited the hospital. His constitution was wonderfully recovered and from the inroads of the disease and he again enjoys excellent health, and evinced unbound gratitude. He sees to regard the favor received, as conferring on him full liberty to introduce and all his diseased friends. This is very uniformly the case with such as have received any special benefit.\nThis electronic record is derived from historic data and may not reflect our current information. Review and updating of records is ongoing."}
{"task_id": "149", "Question": "文段中“微”这个人要去报复谁？请回答他的姓名。", "Level": 1, "Answer Type": "exactMatch", "Final answer": "有易", "file_name": "149.png", "Answer Explanation": "文段中括号内是简体字的备注，这段文段讲的是“微”去报复“有易”。如果能读出括号内的信息，则应该能作答此题。"}
{"task_id": "267", "Question": "Who was the Taiwan Prefect (台湾府知府) rewarded with an additional title of Daotai (道衔) after the suppression of the uprising?(For answers, please use the language referred to in the material)", "Level": 2, "Answer Type": "exactMatch", "Final answer": "裕铎", "file_name": "267_1.png;267_2.png", "Answer Explanation": "该题目考察AI竖排繁体的识别能力，选用清代《上谕档》这一常见史料，字迹工整，识别难度较低，并附有对应奏折点校竖排本，也可以锻炼AI运用已有知识识别史料的能力。这段文字涉及到的人名、地名数量较多，可以对照训练。此外，文本中包含着大量的官制、奖励相关的用语，这些用语具有固定的使用规范和特定的含义。\n能否精准识别出 “奉上谕” 等具有标志性的奏折书写固定格式，并且能够判断出所处理的文本属于奏折体裁，进而依据相关规则进行合理的句读，成为了检验其能力的关键所在。\"\n咸丰二年十月初五日内阁奉上谕：\n恒裕、徐宗干奏查明拿获匪犯出力各员恳请鼓励并开单呈览一折。上年台湾匪犯王湧等造谣滋事经该镇道督饬所属文武先期访拿，立时扑灭，办理甚属妥速。除该镇道已加恩交部议叙外，所有获犯出力及捐资较多之文武员弁、义首人等，自应分别施恩，以昭激励：台湾府知府裕铎等赏加道衔；副将衔署北路协副将嘉义营参将吕大陆，著交部从优议叙；署城守营参将镇标中营游击富兴阿、署嘉义营参将镇标左营游击曾玉明，均著以参将升用；署淡水厅候补同知朱材哲，著遇有同知缺出，不论繁简，即行补用，并赏加知府衔；署嘉义县知县补缺后即补直隶州知州丁曰健，著准其免补知县本班，即以同知直隶州补用；署淡水厅同知即补通判张启煊，著俟补缺后以同知升用，先换顶带；彰化县知县高鸿飞，著以同知即行补用，嘉义营斗六门都司凌敬先，著赏加游击衔；北路协中营都司升补镇标右营游击曾元福，著交部从优议叙；嘉义营守备李维生，著以都司升用，先换顶带；留台委用建宁镇标守备曹宗铨，著以都司留闽补用；头围县丞王霈，著以知县即行升用；署笨港县城准补漳州府经历张征庸，著以知县升用；准补南投县令吕庆麟，著以应升之缺即行补用；候补县丞程荣春著以县丞，遇缺前补用；候补县丞张传敬、沈时熙，均著赏给六品衔；佳里兴巡检周瑞堂，著以县丞，遇缺即行升用；竹堑巡检俞国祺，著以县丞尽先升用；兴隆里巡检王衢，著以府经历县丞即行补用；大甲巡检陈澧、准补南平县典史高桂馨，均著以县丞升用；候补从九品赵德璜、白鸾卿，均著俟补缺后，以应升之缺即行补用；镇标中营千总项国柱、左营千总江景星，均著以守备留闽升用；北路协右营千总倪捷陞、中营千总钟孝臣，均著以守备留闽即行补用，与项国柱、江景星均先换顶带；葫芦墩汛千总杨建中、镇标候补千总陈捷斌，均著给予守备衔；五品顶带即补千总周梦渭，著俟候补缺后，以守备即补；镇标中营把总杨荣陞，著给予千总衔。北路营额外许清福，著以外委即补；镇标中营把总林登龙、艋舺营外委龚朝俊、大甲汛外委黄日高、嘉义营额外陈彦龄、屯外委莫耿光，均著赏给六品顶带；兵丁苏用璋、林朱俊、陈玉胜、黄超英、吕文良、梁国瑞、欧阳恩，均著以额外即补；义勇王瑞、谢旺、卢斌、吴淮，均著赏给九品顶带。台湾府学教授徐世昌，著赏加六品衔；绅士候选通判杨士珩，著赏加五品衔；义首贡生刘煦、附生黄尚青、高鹏飞、武生翁志朝、武监生李朝荣、俊秀陈恩湛、陈登郡、杨五湖、陈锦川，均著赏给六品顶带；武生戴廷耀、俊秀蔡克勋、齐祥琳，均著赏给八品顶带；民人翁种玉、林洪文、谢应昌、陈德胜、胡珠光、吕世芳、王秉刚、杜春贵、李树珍、杨明修，均著赏给九品顶带。其捐资之布政司理问衔陈维菁，著以詹事府主簿，双月选用；布政司经历衔陈宗元，著以布政司经历，双月选用；山东候补从九品季蓁，著由该省以本班尽先补用；监生陈澄和，著给予太常寺典簿衔；武童吕达芳，著给予千总衔；俊秀吴邦彦，著给予布政司理问衔；俊秀丁继鸿，著作为贡生。所有两次垫用银两，除捐项抵补外，余由该府另筹归款，著免其造册报销。余著照所议办理。该部知道，单并发。钦此。\""}
{"task_id": "351", "Question": "Where is the newspaper industry shown in the film ?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Minnesota", "file_name": "351.mp4", "Answer Explanation": "1'29″ Minnesota in the 20th century is known for its progress in the arts and sciences."}
{"task_id": "300", "Question": "Dans la partie Présentation de la huitième édition du livre La paix et la guerre entre les nations d'Raymond Aron, il est mentionné qu'il existe une contradiction évidente dans la situation actuelle de l'humanité : la contradiction entre l'ordre social entre individus et l'état naturel entre nations. De qui cette idée est-elle tirée ?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Jean-Jacques Rousseau", "file_name": "", "Answer Explanation": "Aron cite un passage de Rousseau sur l'état de guerre : Jean-Jacques Rousseau, Écrits sur l'Abbé de Saint-Pierre, dans Œuvres Complètes, vol. III, « La Pléiade », Gallimard, 1970, p. 610."}
{"task_id": "173", "Question": "According to the picture, which book(a literary figure of the Southern Song Dynasty)  written by Yan Yanzhi did Sun Baoxuan read on the third day of November 1983?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Observing the North Lake Field Collection in Response to the Edict（《应诏《观北湖田收》）", "file_name": "173.png", "Answer Explanation": "\n\nAccording to the text content, it is identified as \"《应诏观湖北田收》\", but this is a typo made by the author in the diary historical materials. The true title of the work is \"《应诏观北湖田收》\""}
{"task_id": "339", "Question": "Based on the shooting time and the main characters in the pictures, speculate what project the team may have been working on at that time?\n", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Cross-border oil and gas resource exploration", "file_name": "339.png", "Answer Explanation": "This photo is selected from Crapp's Collection of Chinese Photography. In December 1913, Crapp arrived in Beijing as an expert from Mobil Oil Company to prepare for the upcoming Sino US joint exploration operation. At that time, Mobil Oil was attempting to enter the Chinese market and control resources through technological cooperation. On February 10, 1914, the Beiyang Government and Mobil Oil Company officially signed the \"Sino US Joint Venture to Establish an Oil Company Contract\", which stipulated that the US side was responsible for technology and dispatching experts, while the Chinese side was responsible for cooperation and providing administrative assistance. Subsequently, a \"National Coal and Oil Mine Survey Team\" was established to initiate the first cross-border oil and gas resource exploration in China."}
{"task_id": "253", "Question": "At which institution did Fred Engst give this report, and in what year? (Answer format: Institution; Year)", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Wuhan Institute of Technology；1979", "file_name": "253.mp3", "Answer Explanation": ""}
{"task_id": "148", "Question": "在图片中重复出现两次地名的是什么山？", "Level": 1, "Answer Type": "exactMatch", "Final answer": "金山", "file_name": "148.png", "Answer Explanation": "图片中部可见“金山”出现了两次"}
{"task_id": "330", "Question": "Who issued this coin in the picture?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "King Stefan Dragutin", "file_name": "330.jpg", "Answer Explanation": "According to the source, this is a Dinar of King Stefan Dragutin, from the 13th century."}
{"task_id": "234", "Question": "This is a historical document. Who is the author expressing his dissatisfaction with?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Lord Amherst", "file_name": "234.png", "Answer Explanation": "A letter sent from the Emperor [Jiaqing or Chia Ch'ing] of China, to the Prince Regent (afterwards King George IV), complaining about the conduct of Lord Amherst, 11 September 1816."}
{"task_id": "135", "Question": "This is a photo of a parade at the Canyon of Heroes in Manhattan in 1926. Who were people celebrating for?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Gertrude Ederle", "file_name": "135.jpg", "Answer Explanation": "Gertrude Caroline Ederle was an American competition swimmer, Olympic champion, and world record-holder in five events. On August 6, 1926, she became the first woman to swim across the English Channel. When Ederle returned home after crossing the Channel in 1926, she was greeted with a ticker-tape parade in Manhattan, with more than two million people along the parade route."}
{"task_id": "230", "Question": "The following is an excerpt of a historical newspaper. Which of the following judgments about this excerpt is true?\nA.\tThis is excerpted from The Times. 2 July 1820.\nB.\tAfter the opening of the London-Birmingham railway, the volume of coal transported on the canal mentioned in the article decreased.\nC.\tThe canal mentioned in this article was built after Thomas Homer proposed it in 1802.\nD.\tIn relation to this canal, Acts 55 & 56 Vict. c. clxxxviii were passed.", "Level": 1, "Answer Type": "multipleChoice", "Final answer": "D", "file_name": "230.jpg", "Answer Explanation": "A: This is excerpted from The Times. 2 August 1920. B: The opening of the London and Birmingham Railway in 1838 actually increased the tonnage of coal carried by the canal. By the early twentieth century, with the Midland trade lost to the railways, and more deliveries made by road, the canal had fallen into a long decline. C: Regent's Canal was built during the early 19th century after the Regent's Canal Act 1812 (52 Geo. 3. c. cxcv) was passed."}
{"task_id": "250", "Question": "С чем связана данная фотография?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "С местным самоуправлением", "file_name": "250.png", "Answer Explanation": "Описание фотографии: Начальство города вместе с попечителем и воспитателями Ивано-Вознесенской школы, сопровождают министра Д. С. Сипягина [Изоматериал] : [фотография]. - Иваново-Вознесенск, 1900. - Проекционная печать с негатива, черно-белая ; 9х12 см. - Российский государственный архив кинофотодокументов. http://www.rgakfd.ru/.\nИсточник электронной копии: РГАКФД\nМесто хранения оригинала: РГАКФД"}
{"task_id": "402", "Question": "请按照器物年代的早晚时间顺序对图片进行排序,从左到右的顺序应该是：A.321；B.213 C.312 D.132 E.231", "Level": 3, "Answer Type": "exactMatch", "Final answer": "A", "file_name": "402.png", "Answer Explanation": "三件器物皆为印纹硬陶坛，均出自安吉上马山墓地，年代分别为：③西周早期、②西周晚期、①春秋晚期。商周之际印纹硬陶上方格类型纹饰的发展规律为：周初，云雷纹逐渐规整化形成重菱形纹；西周早期，重菱形摆正形成回字型，内框粗鼓外框细浅（图③特征），西周晚期回字纹内框退化（图②特征），春秋战国时期，回字纹进一步简化为细方格纹（图①特征）"}
{"task_id": "200", "Question": "According to Suzann Buckley and Janice Dickin McGinnis, what percentage of all new admissions to the Toronto General Hospital in 1917 were for syphilis alone?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 12.8, "file_name": "", "Answer Explanation": "A survey of all new admissions to the Toronto General Hospital in 1917 yielded a rate for syphilis alone of 12.8 per cent."}
{"task_id": "012", "Question": "Please finish the blank with two numbers.\nAccording to \"The Pin-Striped Philanthropists: The Musical Economy of the Huntsville Prison Rodeo/Radio, 1931–1986\",starting in the 1950s, a typical year’s haul was $ ______and in TPR’s final year, it raked in $ ______. \n", "Level": 1, "Answer Type": "exactMatch", "Final answer": "100000;450000", "file_name": "", "Answer Explanation": "Starting in the 1950s, a typical year’s haul was $100,000 ($1,189,000) and in TPR’s final year, it raked in $450,000 ($1,290,575.27). "}
{"task_id": "381", "Question": "According to the image and text description, which of the following instrument refers to \"古象运全仪\"?\nA. Armillary Sphere B. Orrery C. Torquetum D. Triquetrum", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "381.pdf", "Answer Explanation": "First, the image is similar to Peter Apian's torquetum. Second, according to the description, this instrument is used to measure celestial positions in different coordinate systems, and this is the function of torquetums. "}
{"task_id": "306", "Question": "In the third year of the Hongwu reign of the Ming dynasty, an imperial edict was issued to establish an examination system for selecting scholars. The provincial examination (xiangshi) was scheduled to be held in August, and it was stipulated that there would be three rounds of tests. The first round primarily assessed the candidates' understanding of the Four Books and Five Classics of Confucianism. What were the types of questions in the first round of the provincial examination in the third year of Hongwu? (Multiple choices)\n\nA. One question on the meaning of the Classics\nB. Two questions on the meaning of the Classics\nC. One question on the meaning of the Four Books\nD. One question on the difficulties of the Four Books\n", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "BD", "file_name": "", "Answer Explanation": "《明史·选举志二》记： “初设科举时，初场试经义二道，四书义一道。”据此，初场应考经义二道、四书义一道。然而《明史》所载不确。《太祖实录》洪武三年八月乙酉条记：“考试之法大略损益前代之制，初场四书疑问、本经义及四书义各一道。”第一场实际考四书疑一道，经义（本经义及四书义）两道。\n洪武三年乡试所考为四书疑凿然可据，该年会试所试四书题见载史籍（见（明）吴伯宗：《吴状元荣进集》，台北故宫博物院藏明万历金陵周文华校刊本，第1卷，第27a页），其设问方式为四书疑、而非四书义。\n明洪武十七年颁科举定式，此后首场皆考经义及四书义，受此影响，明人常误以为首场亦试四书义，清修《明史》也沿误未改。"}
{"task_id": "290", "Question": "\n\tHow does the article characterize the artistic quality of the Chinese paintings? (Choose the best answer.)A. They ingeniously combine traditional Chinese brushwork with modern Western themes.\t\nB. They authentically represent a fusion of ancient and modern aesthetic ideals.\t\nC. They fail to conform either to Chinese or Western artistic standards and show technical deficiencies.\t\nD. They demonstrate competent adaptation to modern subjects without losing cultural authenticity.\t\nE. They maintain a nostalgic reflection of ancient Chinese artistry.\t\nF. They create a new hybrid style independent from both Chinese and Western traditions.", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "290.pdf", "Answer Explanation": "它们既不是中国风格，也不是西方风格，既不是古代风格，也不是现代风格：它们就是它们自己——只是对在现代主题上缺乏适当技术掌握的危险的可怜见证。"}
{"task_id": "205", "Question": "In his first letter to the Byzantine Emperor Leo III, Pope Gregory II says that he has received an invitation from what specific place in the far West to travel there for the Holy Baptism of the Pope?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Septetum", "file_name": "", "Answer Explanation": "We have just received an invitation from the distant west - from the so-called Septetum - where they desire, by the grace of God, our presence, to go there to give holy baptism."}
{"task_id": "229", "Question": "How many students were there in the Faculty of Letters at the Sorbonne in 1902?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 1830, "file_name": "", "Answer Explanation": "The Faculty of Letters at the Sorbonne had about 120 students in 1887, but by 1902 (following the opening of new buildings) the number of students had risen to 1,830."}
{"task_id": "269", "Question": "Which period is this document format from?\nA. Song Dynasty\nB. Yuan Dynasty\nC. Ming Dynasty\nD. Qing Dynasty\n", "Level": 2, "Answer Type": "exactMatch", "Final answer": "B", "file_name": "269_1.png", "Answer Explanation": "这一文书体式出自元代《新编事文类聚翰墨全书》，为元代平牒、平关文书体式。起首的“皇帝圣旨里”为元代独有公文用语，可判断其断代。"}
{"task_id": "249", "Question": "Who might be the buyer of this covered platter?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Justice Samuel Chase", "file_name": "249.png", "Answer Explanation": "This Chinese platter belongs to a large dinner service bearing the Townley family coat-of-arms. The service, probably ordered by Justice Samuel Chase (1741–1811) of Annapolis, Maryland, displays the enamel-painted arms of Margaret Townley, Chase's aunt."}
{"task_id": "029", "Question": "Please finish the blank with a name.\nThese poor villages, this sorry nature! Long suffering is native to you,\nland of our Russian people!The proud foreign glance cannot comprehend—would not even notice!— what shines secretly through your humble nakedness.Burdened by his cross, throughout your length and breadth,in the rags of a slave, the Heavenly King has walked, blessing you, my native land! \n—Fedor Tyutchev (August 13, 1855), trans. ______", "Level": 1, "Answer Type": "exactMatch", "Final answer": "F. Jude", "file_name": "", "Answer Explanation": " Fedor Tyutchev (August 13, 1855), trans. F. Jude"}
{"task_id": "075", "Question": "以下は正倉院に所蔵されている厚朴とEngelhardia roxburghianaの顕微鏡下での構造図です。この記事の著者は、これらの2枚の画像を使ってどのような問題を説明していますか？A. 正倉院所蔵の厚朴の基原植物とEngelhardia roxburghianaは同じ植物ではなく、顕微鏡下の画像は一致しません。\nB. 正倉院所蔵の厚朴の基原植物とEngelhardia roxburghianaは同じ植物であり、顕微鏡下の画像は完全に一致します。\nC. 正倉院所蔵の厚朴の基原植物とEngelhardia roxburghianaは同じ植物であり、顕微鏡下の画像は完全には一致しません。これは、二つの植物が異なる産地から来たためです。\nD. 正倉院所蔵の厚朴の基原植物とEngelhardia roxburghianaは同じ植物であり、顕微鏡下の画像は完全には一致しません。これは、正倉院所蔵の厚朴が長期間保存されており、表面の繊維が脆くなったためです。E. 正倉院所蔵の厚朴の基原植物は、Engelhardia roxburghiana と同一種であり、彼らの顕微鏡下の画像が完全に一致しないのは、実験方法に欠陥があるためです。", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "D", "file_name": "075_1.png;075_2.png", "Answer Explanation": "図から見ると、第一の画像では二つの植物の影像に差異があり、第二の画像では二つの植物の影像が完全に一致しているため、Bは除外できます。テキストを元にすると、この記事では正倉院に所蔵されている厚朴の基原植物はEngelhardia roxburghianaであると考えています。論文に基づいて、影像に差異がある理由は、正倉院所蔵の厚朴が長期間保存されていたためです:「しかし、『厚朴』の横断面には多数の集晶が存在するのに対し、E. roxburghianaの樹皮の横断面にはあまり存在しないことが異なっている。これは『厚朴』は長期保存で組織が脆くなり、繊維の表面に並んでいた集晶が繊維面から剥がれて横に広がったためであることが分かった。」従って、Ｄはただしいこたえです。"}
{"task_id": "151", "Question": "According to Ned Lud’s Proclamation dated 23 December 1811, which of the following individuals would definitely face the penalty of death as stated?\nA. A former employee of Ned Lud who, after being officially discharged as per the proclamation, provides information about frame - breaking to the Town Clerk.\nB. A constable who conducts inquiries that inadvertently lead to the arrest of a Luddite sympathizer, without any prior knowledge of Ned Lud's cause.\nC. A person who was never employed by Ned Lud but attempts to give information about frame - breaking activities to the Corporation Silley Committee.\nD. An active member of Ned Lud's group who tries to inform the local magistrate about a rival group's frame - breaking actions.\n", "Level": 1, "Answer Type": "exactMatch", "Final answer": "B", "file_name": "151.png", "Answer Explanation": "Answer: B. The proclamation clearly states that any constable found making inquiries that hurt Ned's cause or that of his army will face the death penalty. Option A is ambiguous as the proclamation's stance on former employees after discharge is not entirely clear; Option C mentions a person never employed by Ned Lud, so the death penalty for informants may not apply; Option D involves informing about a rival group, and it's not clear if this violates the proclamation's terms as it focuses on information regarding Ned Lud's own group's frame - breaking.\noriginnal text：Ned Lud’s Proclamation 23 Decr 1811\nI do hereby discharge, all manner of Persons, who has been, employ’d by me, in giveing any information, of breaking Frames, to the Town Clerk, or to the Corporation Silley Committee ~ any Person found out, in so doing or attempting to give any information, will be Punish’d with death, or any Constable found out making any enquiries, so has to hurt the Cause of Ned, or any of his army, Death (by order of King Lud)"}
{"task_id": "225", "Question": "What is the average transferred profit of General Motors and Ford Motor Cars from the Iranian contract from 1936 to 1940?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 394149.2, "file_name": "225.png", "Answer Explanation": ""}
{"task_id": "048", "Question": "Разгадывайте берестяные грамоты и переводите их с древнерусского языка на русский язык. Из этих переводов какие относительно бесспорные? \nА. текст: лнтва въста\nла nа корѣлоу\nперевод: Литва веста ла на корелоу.\nБ. текст: лнтвавъста\nлаnакорѣлоу\nперевод: Литва вестала на корелоу.\nВ. текст: литва въста\nла nа корѣлоу\nперевод: Литва пошла войной на карел.\nГ.  текст: литва въста\nла nа корѣлоу\nперевод: Литва вела войной на карел.", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "В", "file_name": "048.png", "Answer Explanation": "Грамота No 590 (стратигр. посл. треть XI в., Нутн.)\nЖанр: донесение\nСодержание: «Литва пошла войной на карел»\nПеревод: Литва пошла войной на карел.\nЭто военно-политическое донесение. Как и другие подобные донесения, оно не имеет адресной формулы; это явно связано с необходимостью конспирации.\nПомимо текста, грамота содержит большой тамгообразный знак; быть может, это личный знак, заменяющий имя автора-лазутчика.\nК сожалению, при первоначальной датировке грамоты No 590, основанной на полевой оценке, была допущена серьезная ошибка, которая проникла и в издание (где грамота отнесена к концу XII в.). Ошибка была исправлена в ходе итогового стратиграфического анализа всей совокупности находок Нутного раскопа, проведенного П. Г. Гайдуковым (см. Гайдуков 1992: 81).\nПо предположению В. Л. Янина (1998: 265-266), грамота относится к 1069 г., когда полоцкий князь Всеслав Брячиславич предпринял поход на Новгород через водскую землю, где и могло произойти столкновение сопровождающих князя литовцев с карелами."}
{"task_id": "109", "Question": "Finish the blank with a number.\nThe persecutions of Christians came to a dramatic climax in 1637–1638, when the peasantry of Shimabara near Nagasaki, in a daimiate early associated with Christianity, in desperation rebelled against economic, agrarian, and religious oppression. With leadership provided by some dissatisfied ronin, or masterless samurai, _____peasants in an old fortress held out for almost three months against the assault of 100,000 shogunal troops supported by Dutch naval power.", "Level": 1, "Answer Type": "exactMatch", "Final answer": 30000, "file_name": "", "Answer Explanation": "The persecutions of Christians came to a dramatic climax in 1637–1638, when the peasantry of Shimabara near Nagasaki, in a daimiate early associated with Christianity, in desperation rebelled against economic, agrarian, and religious oppression. With leadership provided by some dissatisfied ronin, or masterless samurai, 30,000 peasants in an old fortress held out for almost three months against the assault of 100,000 shogunal troops supported by Dutch naval power. "}
{"task_id": "165", "Question": "Who was he? [Asnwer in Chinese]", "Level": 1, "Answer Type": "exactMatch", "Final answer": "佘英", "file_name": "165.png", "Answer Explanation": "The written words on the botton of photo show his identity"}
{"task_id": "272", "Question": "\tWhat main activity is the person performing according to the dialogue in the image?(For answers, please use the language referred to in the material)", "Level": 2, "Answer Type": "exactMatch", "Final answer": "吃早飯", "file_name": "272.png", "Answer Explanation": "需要识别手写体方言字，识别率会影响到方言种类判断。\"儂是要去𠳝\nnoong3 z2 iau c’e3 va3\n儂垃拉做𠳝\nnoong3 læh la3 tsoo3 va3\n儂垃拉做啥\nnoong3 læh la3 tsoo3 sa3\n起頭 吃早飯 前頭\nc’e3 du c’uk tsau2 van zen de\n啥人起頭白相个\nsa3 niung c’e3 du bæh siang3 kuk\n是伊个小囝\nz2 ye kuk siau2-nön【480】\""}
{"task_id": "066", "Question": "Identify the words of the characters in the cartoon and determine who has the intention of reshaping the government？ A. Citizen Mungo  B. Thomas Jefferson  C. DeWitt Clinton  D. Robert R. Livingston", "Level": 2, "Answer Type": "Multiple choice", "Final answer": "B", "file_name": "066.jpg", "Answer Explanation": "This person can be identified as Thomas Jefferson based on the text in the drawing because next to the text description, Jefferson begins the passage with a quote from Shakespeare's work.\n"}
{"task_id": "161", "Question": "According to the information report from Colonels of the General Staff of the USSR Armed Forces N. Tsygichko and S. Egorov titled “On the situation in the Democratic Republic of Vietnam”, who held a meeting with Bao Dai in June 1949?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "General Revere", "file_name": "", "Answer Explanation": "The original text is: В июне 1949 г. было проведено совещание между начальником французского генерального штаба генералом Ревером и Бао Даем с участием французского верховного комиссара в Индо-Китае генерала Пиньона. На этом совещании обсуждались вопросы создания армии марионеточного правительства подруководством французов."}
{"task_id": "324", "Question": "根据地图，“石鱼山”在“衡山”的哪一个方位？请回答“西北”“北”“南”“西南”这类的方位词。", "Level": 2, "Answer Type": "exactMatch", "Final answer": "西北", "file_name": "324_1.png", "Answer Explanation": "324_2.png"}
{"task_id": "110", "Question": " Which one is a zelotai of Plotinus, instead of an akrotai?\nA. Zoticus\nB. Marcellus Orrontius\nC. Serapion of Alexandria\nD. Aquilinius", "Level": 1, "Answer Type": "mutipleChioce", "Final answer": "D", "file_name": "", "Answer Explanation": "Zēlōtai refers to the ‘disciples’ of Plotinus in his Roman academy, i.e., those who believed in Plotinus’ theories, learnt them, and passed them on in the line of Plotinus, and the figures in the first three options belong to zēlōtai. akroatai, on the other hand, refers only to the general audience in Plotinus’ academy, some of whom did not believe in Plotinus’ philosophy at all. Aquilinius in option D is a Gnostic who did not subscribe to Plotinus’ philosophy at all, and was merely a general audience of Plotinus’ school, i.e. an akroatai."}
{"task_id": "302", "Question": "Please fill in the blank: The Non-Fourierist community that has the closest connection with Fourierist phalanxes is＿？\n", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Skaneateles", "file_name": "", "Answer Explanation": ""}
{"task_id": "309", "Question": "Initially, wooden and bamboo slips were stored in the form of rolls. As time passes, the complete rolls got scattered, and therefore in most cases we can only see single slips. Some of the given slips could be restored into a complete roll, while others are distractions within the given cases. Please find out these restorable slips and sort them in right order as the original roll.", "Level": 2, "Answer Type": "exactMatch", "Final answer": "AHBFIGKL", "file_name": "309_A.png;309_B.png;309_C.png;309_D.png;309_E.png;309_F.png;309_G.png;309_H.png;309_I.png;309_J.png;309_K.png;309_L.png", "Answer Explanation": "The restoration is based on the and handwriting of the manuscripts, the time and figures mentioned and the meaning of the contents of transcriptions. For more detailed explanation, see Ooba Osamu 大庭脩 , Qinhan Fazhishi Yanjiu 秦汉法制史研究, trans. Xu Shihong 徐世虹 ( Shanghai: Zhongxi Shuju, 2017), 163-180."}
{"task_id": "198", "Question": "Who wrote this?\n\"Some day last week I saw a man unloading a lorry full of food stuffs into an old enpty house next to the church at Roe Hampton.I hope you won't mind reading my article in Sunday Graphic as it was essential that I should get the reputation of hating Germany.\"", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Elvira Chaudoir", "file_name": "", "Answer Explanation": "Elvira's coded letter with an apology to Bliel. Catalogue reference: KV 2/2098"}
{"task_id": "407", "Question": "Please analyze the meaning of the eighth character in the third column from the right:\nA. Change clothes\nB. Open the coffin\nC. Lift the coffin\nD. Pay respects to the ancestors", "Level": 3, "Answer Type": "exactMatch", "Final answer": "C", "file_name": "407.jpg", "Answer Explanation": "This image originates from the Burial Laws of the early Western Han Dynasty, found in M77 in Yunmeng, Hubei.The Chinese inscription states: '（彻侯）其杀：小敛用一特牛，棺、开各一大牢，祖一特牛，遣一大牢' The title alludes to the word '开'.The term '小敛' is employed to denote the act of interment of the deceased, which is concomitant with the replacement of burial attire. The term '棺' is used to denote the final convergence of the body into the coffin, that is, the ultimate convergence. The term '开' is used to denote the commencement of the funeral service, during which the coffin is elevated from its position and readied for interment. The term '祖' is used to denote the act of transferring the coffin and bier to the ancestral temple, with the intention of bidding farewell to the ancestors prior to the burial."}
{"task_id": "239", "Question": "What is depicted in this woodcut?\nA. A busy farming scene.\nB. A myth or fable.\nC. The Witch trial.\nD. The progress of agricultural technology.", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "239.png", "Answer Explanation": "Witches apprehended, examined and executed. Published London, 1613. Wellcome Collection.\n\"Witches apprehended, examined and executed, for notable villanies by them committed both by land and water With a strange and most true triall how to know whether a woman be a witch or not.\""}
{"task_id": "041", "Question": "Quelle personnalité politique Aron mentionne-t-il dans les premières pages de l'Essai sur les libertés ? A) John Adams B) Charles de Gaulle C) Thomas Jefferson D) Winston Churchill E) Alexander Hamilton", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "", "Answer Explanation": "Au début de son discours, Raymond Aron a remercié l'Université de Californie et le Comité des Jefferson Lectures. Il a parlé de Thomas Jefferson."}
{"task_id": "275", "Question": "Was the letter writer's problem resolved during the year?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "No.", "file_name": "275_1.png", "Answer Explanation": "This is a letter from Ronald Ross to Karl Pearson requesting a mathematical solution to the mosquito problem. Pearson replied to Ross in 1904 asking for more details, but Ross did not resume correspondence with Pearson until 1905. So the letter writer's problem was not solved that year (1904). The information that “Ross did not respond in a timely fashion” can be found at 275_2.pdf to assist in the determination."}
{"task_id": "057", "Question": "Which book does this illustration come from?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "De Historia Stirpium ", "file_name": "057.png", "Answer Explanation": " De Historia Stirpium is part of a long tradition of herbals, or books that describe plants and their medicinal uses. Before the sixteenth century, most herbals were based on folk traditions and Greek and Roman texts, not on scientific or artistic observation. Leonhart Fuchs broke with tradition by becoming interested in illustrating plants as they looked in nature instead of using conventional (and often bizarrely inaccurate) representations. Fuchs hired three professional artists to help him with this undertaking: Albrecht Meyer, who drew the plants from life; Heinrich Füllmaurer, who transferred the line drawings to woodblocks; and Vitus Rudolph Speckle, who cut the blocks and printed the woodcut illustrations. The beautiful, densely illustrated book that resulted from their efforts contains some of the finest pictures of plants in the sixteenth century, many hand-colored under Fuchs’ supervision for the greatest accuracy. De Historia Stirpium is notable among early scientific books for its inclusion of the artists’ names and portraits in the back of the book.\n\nFuchs’ interest in realistic representations accorded with the Renaissance ideal of naturalism, but it also served a practical purpose – he wanted his book to be a reference for his medical students and fellow doctors. While the images were cutting-edge for their time, Fuchs was not as revolutionary in the text, and his descriptions of each plant’s medicinal properties still draw largely on the writings of Greek and Roman authors such as Dioscorides, Galen and Pliny. Even so, Fuchs did encourage his own students to cultivate and study medicinal plants firsthand. Surviving copies of De Historia Stirpium often contain pressed plant samples, stains, and marginal notes that point to extensive use, and the copy belonging to Special Collections is no exception. In this way, De Historia Stirpium can give modern scholars insight into the ways early physicians studied and administered herbal medicines.\n\nDe Historia Stirpium was more than a lavishly illustrated compendium of remedies. The book also introduced many Europeans to the unfamiliar fruits, vegetables and plants being imported from the Americas. De Historia Stirpium contains the first description and illustration of over 100 species of plants, including pumpkins, squash, chili peppers, and maize, although some species are misidentified. It is thought that some of these plants were drawn from specimens or seeds Fuchs acquired and grew in his own garden."}
{"task_id": "060", "Question": "Where is this botanical garden located?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Leiden ", "file_name": "060.png", "Answer Explanation": "\nThe Hortus botanicus Leiden was founded in 1590, making it the oldest botanical garden in western Europe. Its establishment was closely tied to the founding of the University of Leiden in 1575. At that time, the university's board sought to create a \"hortus medicus,\" or medical herb garden, to support the education of medical students by providing access to plants used in pharmacology. This practical need drove the creation of the Hortus. The founding of both the university and the garden occurred during the Renaissance, a period of intellectual and scientific renewal in Europe. The Renaissance had fostered advancements in many fields, including medicine and botany, which aligned with the university's academic goals. Over time, the Hortus expanded its collection and influence, growing into the four-acre garden it is today."}
{"task_id": "353", "Question": "In the third year of Daoguang reign, how much Tongjinshuijiaoyin (铜斤水脚银）was collected ？", "Level": 2, "Answer Type": "Exact match", "Final answer": "3564Liang", "file_name": "353.png", "Answer Explanation": "Judging from the text in picture."}
{"task_id": "257", "Question": "When was this song recorded in Australia? ", "Level": 2, "Answer Type": "exactMatch", "Final answer": 1896, "file_name": "257.mp3", "Answer Explanation": ""}
{"task_id": "098", "Question": "Finish the blank with a number.\nIn 1881,Great Britain, the nationalists wanted the ministry dismissed in favor of one more acceptable in mid-September; an assembly should be convened, and the size of the army should be increased to _____ men. (Answer Format: number)", "Level": 1, "Answer Type": "exactMatch", "Final answer": 18000, "file_name": "", "Answer Explanation": "Rationale: The nationalists wanted the ministry dismissed in favor of one more acceptable in mid-September; an assembly should be convened, and the size of the army should be increased to 18000 men. \n"}
{"task_id": "393", "Question": "According to the stlye feature and Loehr's theory, which style is it this bronze vessel belong to? A. first style; B. second style; C. third style; D. fourth style; E. fifth style", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "E", "file_name": "393.jpg", "Answer Explanation": "According to Loehr's essay, the fifth style features in ornaments rise above the meandered ground. The flange is also one of the most important features of this time. This vessel had both features mentioned by Loehr, belong to the fifth style. "}
{"task_id": "024", "Question": "Please finish the blank with a number.\nIn 1926, there were as many as ____ separate banking businesses throughout Japan.", "Level": 1, "Answer Type": "exactMatch", "Final answer": 1402, "file_name": "", "Answer Explanation": " In1926, there were as many as 1,402 separate banking businesses throughout Japan.\n"}
{"task_id": "124", "Question": "Is this a finished work by James McNeill Whistler ?\nA. YES\nB. NO", "Level": 1, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "124.png", "Answer Explanation": "This is a sketch by Whistler for his painting The Princess from the Land of Porcelain.Whistler used sketches to prepare the general layout of the composition. Other details were added in later. A surviving sketch depicts flowers, which were later eliminated from the work.This sketch is also known as Sketch for Rose and Silver: La Princesse du Pays de la Porcelaine."}
{"task_id": "031", "Question": "Which ancient king appears in this passage? A. 伏羲氏 B. 神农氏 C. 皋陶氏 D. 颛顼氏 E. 共工氏 F. 有虞氏", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "031.png", "Answer Explanation": "This passage lists the following kings: 卢氏、赫胥氏、乔结氏、仓颉氏、轩辕氏、神农氏、㭏|氏等。"}
{"task_id": "352", "Question": "In the book to which this picture belongs, which page is this picture located on?", "Level": 2, "Answer Type": "Exact match", "Final answer": "Page 12", "file_name": "352.png", "Answer Explanation": "In this paper(The Codex Mexicanus: Time, Religion, History, and Health in Sixteenth-Century New Spain), the source of this picture is specified“ Source:Codex Mexicanus, page 12. Courtesy of the Biblioth` eque National de France.”"}
{"task_id": "117", "Question": "\tFor whom was the epitaph written?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Huangfu Cheng", "file_name": "117.jpg", "Answer Explanation": "The first two columns of the epitaph provide the information needed for this question"}
{"task_id": "259", "Question": "What's the name of the technique used to make this pattern? ", "Level": 2, "Answer Type": "exactMatch", "Final answer": "cuerda seca", "file_name": "259.png", "Answer Explanation": "The technique used to create the multi-coloured pattern is known as ‘cuerda seca’. The designer used a greasy substance to draw the pattern on the surface of the tile. The pattern consisted of discrete compartments which were then filled with coloured glazes. The grease kept the different colours separate during firing. It burnt off during the firing process, leaving ‘cuerda seca’ (‘dry cord’) outlines."}
{"task_id": "143", "Question": "What was the average weekly working hours of Koreans in 1985？", "Level": 1, "Answer Type": "exactMatch", "Final answer": "49 hours", "file_name": "", "Answer Explanation": "Table 2 on page 223 provides the quantitative information required for this issue"}
{"task_id": "199", "Question": "According to Philippa Levine's book\"Prostitution, Race, and Politics: Policing Venereal Disease in the British Empire\",how many non-Chinese were there in Hong Kong in the 1860s?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 121000, "file_name": "", "Answer Explanation": "From the small numbers of the early 1840s, the population grew to around 125,000 in the mid-1860s, all but 4,000 of whom were Chinese."}
{"task_id": "189", "Question": "Where was this sculpture originally located?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Yuanmingyuan (‘Old Summer Palace’)", "file_name": "189.jpg", "Answer Explanation": "Bas relief of Guanyin, the Boddhisattva of Compassion, at the entrance to a cave at Yuanmingyuan,Beijing"}
{"task_id": "033", "Question": "著者は『名医別録』、『図経本草』、『経史証類大観本草』などの古代の本草書を利用して、どのような問題を説明していますか？また、どの本草書に記載されている厚朴が現代で使用されている薬材の厚朴の基原植物と一致しているのでしょうか？\n\nA. 古代本草書における厚朴の基原植物の特徴に関する記録には差異があり、古人が使用した厚朴薬材は複数の植物に由来していることを示しています。『経史証類大観本草』に記載されている厚朴は、今日一般的に使用される厚朴薬材の基原植物と一致しています。\nB. 古代本草書における厚朴の基原植物の特徴に関する記録は基本的に一致しており、『図経本草』に記載されている厚朴は、今日一般的に使用される厚朴薬材の基原植物と一致しています。\nC. 古代本草書における厚朴の基原植物の特徴に関する記録には差異があり、いくつかの書籍には誤った情報が記載されていることを示しています。『経史証類大観本草』に記載されている厚朴は、今日一般的に使用される厚朴薬材の基原植物と一致しています。\nD. 古代本草書における厚朴の基原植物の特徴に関する記録は基本的に一致しており、『名医別録』に記載されている厚朴は、今日一般的に使用される厚朴薬材の基原植物と一致しています。\nE. 古代本草書における厚朴の基原植物の特徴に関する記録は基本的に一致していますが、これらの本草書に記載された厚朴は、現代で使用されている薬材の厚朴の基原植物とは異なります。", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "033.pdf", "Answer Explanation": "問題の前半部分は基本的な情報の検索に関連し、答えは原文に記載されています。「一方で、『名医別録』『図経本草』には品質の異なる厚朴があると記載されており、後述するように本草書における基原植物の記述には複数の植物の特徴が混在していることから、厚朴には複数の基原植物が存在していたことが窺えます。」後半部分は比較的複雑な情報の対照に関わり、文章の前半では現代の厚朴は「モクレン科のカラホオなどの樹皮」であることが記載され、これが『大観本草』の図像と一致していることが述べられています。また、「このことから厚朴は古代からカラホオが使われていたと推定される」と記されています。"}
{"task_id": "251", "Question": "Pouvez-vous m'aide à identifier le mot-clé Canada? Combien y en a-t-il?", "Level": 2, "Answer Type": "exactMatch", "Final answer": 3, "file_name": "251.jpg", "Answer Explanation": "identify the manuscript and locate the keywords that the user required"}
{"task_id": "232", "Question": "Please indicate the name of the farthest ship in the picture.", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Haruna ", "file_name": "232.jpg", "Answer Explanation": "(Japanese Battleship, 1917) In Tokyo Bay, Japan, after 1935. Behind her are the battleships Fuso and Haruna (most distant). Faintly visible in the right distance are two cruisers and an aircraft carrier. The original print came from Office of Naval Intelligence files. U.S. Naval History and Heritage Command Photograph."}
{"task_id": "236", "Question": "Between 1723 and 1735, which province had the most sick leave requests from Qing Dynasty officials?Answer Choices:A、Guangdong  B、Henan  C、Yunnan  D、Fujian  E、Jiangxi ", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "D ", "file_name": "", "Answer Explanation": "He Bian explored this question:Requests for temporary sick leave were also identified from virtually all units of provincial administration within China proper during the Yongzheng reign , The five provinces with the highest number of requests for temporary sick leaves are listed in Table 3. \nTable 3. Provinces with the highest incidence of sick leave requests, 1728–35\n\nRank， Province， Sick leave petitions， Total number of incidents(death, retirement and sick leave)\n1      Fujian       15                       63\n2      Jiangxi      10                       58\n3      Henan        12                       72\n4      Guangdong    11                       73\n5      Yunnan       9                        63"}
{"task_id": "347", "Question": "Where was the tomb owner buried?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Wan 'an Mountain, Yifan Village, Yirui Township", "file_name": "347.png", "Answer Explanation": "From the eighth row on the left, we can see: Wan 'an Mountain, Yifan Village, Yirui Township"}
{"task_id": "023", "Question": "Please finish the blank with a number.\nThe mobilization of evangelical Pentecostal missionaries increased by_____percent in only two years after COMIBAM", "Level": 1, "Answer Type": "exactMatch", "Final answer": 172, "file_name": "", "Answer Explanation": "The mobilization of evangelical Pentecostal missionaries increased by 172 percent in only two years after COMIBAM\n\n"}
{"task_id": "134", "Question": "The image shows a fragment of a newspaper. Please deduce the publication date of this newspaper based on this fragment.", "Level": 1, "Answer Type": "exactMatch", "Final answer": "7th November, 1900", "file_name": "134.jpg", "Answer Explanation": "John Sabine Smith died on 6th November, 1900."}
{"task_id": "013", "Question": "Please finish the blank with a number. According to \"Prenzlauer Berg, Berlin, 1870–present: A Neighborhood on the Fringe of Germany\",the building codes of 1853 stipulated that the courtyards must be large enough for fire trucks and police to enter them, and could be no more than _____ meters high, because of the length of a fire truck ladder.", "Level": 1, "Answer Type": "exactMatch", "Final answer": 22, "file_name": "", "Answer Explanation": "The building codes of 1853 stipulated that the courtyards must be large enough for fire trucks and police to enter them, and could be no more than 22 meters high, because of the length of a fire truck ladder."}
{"task_id": "181", "Question": "Whose headquarters is this?[Answer in Russian]", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Kōichi Shiozawa", "file_name": "181.jpg", "Answer Explanation": "This photo is of the Japanese Marine Corps Headquarters on North Sichuan Road in Shanghai in 1932. At that time, its commander was Kōichi Shiozawa, Commander of the Japanese 1st Foreign Fleet in Shanghai."}
{"task_id": "100", "Question": "Raymond Aron souligne que le monde est divisé en périphérie et centre en fonction de quoi ?  \nA) Des relations économiques  \nB) Des relations politiques  \nC) Des relations culturelles  \nD) Des relations religieuses  \nE) De l'idéologie  \nF) De la force relative des puissances nationales", "Level": 1, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "", "Answer Explanation": "“La représentation du monde divisé en centre et périphérie ne se rapporte pas principalement à cette inégalité des puissants et des faibles, à cette domination ou à cette influence des puissants sur les faibles. Elle se réfère surtout aux rapports économiques. Les pays industrialisés achètent les matières premières des pays en voie de développement. Parfois ces biens primaires sont exploités par des sociétés américaines, britanniques, françaises, voire suisses. Ces sociétés étrangères ne travaillent ces matières premières que dans leur pays d'origine et de nationalité. ”"}
{"task_id": "097", "Question": "Kun je de eerste vijf regels van dit manuscript transcriberen", "Level": 3, "Answer Type": "exactMatch", "Final answer": "Resolutie getrocken adij deesen 14 April 1643\nInt fortt Amsterdam op Curacao\nDoor versheiden tydingh vant Eilant Beunairo, seeckerlick\nbericht dat daer inde pannen goede voorraet van sout was,\nende nu tot de afladinge vande vier aenwesende Compagnies-", "file_name": "097.jpg", "Answer Explanation": "basic skills for 17th-century paeleography"}
{"task_id": "043", "Question": "Who was the maker of the map?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Filchner", "file_name": "043.png", "Answer Explanation": "Explanation: This map shows the upper reaches of the Yellow River, with the Zalinghai and Elinghai visible in the map. There are several routes depicted on the map, but the solid red line is the author's line of travel. The map is the map of the second survey of Gansu and Qinghai by the German Army Lieutenant Filchner, Wilhelm in 1926-1928."}
{"task_id": "213", "Question": "In the research facilities network of Bayer from 1880s to 1900s(including Library room，Patent bureau，Main scientific lab，Technical room，Control lab，Patent dept.，Scientific library，Experimental dychouse，Training lab and Literary dept)., which  facilities is established latest?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Literary dept", "file_name": "213.png", "Answer Explanation": ""}
{"task_id": "120", "Question": "Who is the original author of the excerpted text?                            We have seen how even in its childhood, when it was centred in Vladimir, and later, in its youth, when it was centred in Moscow, the Great Russian [despotic] element was inclined to subdue and absorb various neighbouring regions. The same thing occurred in the religious and intellectual sphere. The Great Russians developed an intolerance of other faiths, a disdain of other nationalities, a very high opinion of themselves. [Answer in Russian]", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Н. И. Костомаров", "file_name": "", "Answer Explanation": "excerption from Ralph Lindheim and George Luckyj, Towards an Intellectual History of Ukraine: An Anthology of Ukrainian Thought from 1710 to 1995, published by University of Toronto Press in 1996."}
{"task_id": "001", "Question": "Which composer from which school of music in history wrote the “heart-shaped score” shown in the picture?\n", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Baude Cordier; Ars Subtilior\n", "file_name": "001.png", "Answer Explanation": "Cordier's rondeau about love, Belle, Bonne, Sage, is in a heart shape, with red notes indicating rhythmic alterations."}
{"task_id": "128", "Question": "On what date was the flood management decree delivered?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "June 27th", "file_name": "128.png", "Answer Explanation": "Judging based on files information."}
{"task_id": "169", "Question": "Who is the recipient?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Dalai Lama", "file_name": "169.png", "Answer Explanation": "手稿原藏于西藏博物馆，因有“八月一号的来信”“1954年”可推断：这是毛泽东写给达赖喇嘛的信件"}
{"task_id": "380", "Question": "Who is the portrait on the left side of the letter \"V\" in the image of the equatorial armillary sphere drawn by Tycho Brahe?", "Level": 3, "Answer Type": "exactMatch", "Final answer": "Copernici", "file_name": "380.pdf", "Answer Explanation": "According to the textual description \"infrà in lateribus hujus pedeftalis hinc indè à foraminis, quod plumbum juxta V habet, utraq; parte funt 4. Icones ornatus gratià folerter appiƈtæ, quæ effigies Ptolemæi, Albategnij & Copernici; tum quoq; noftram repræfentant: quarum binę Copernici videlicet & meajuxta ad vifuntur\", there are four portraits on the instrument, and the two portraits in the picture are Copernici (i.e. Nicolaus Copernicus) and the author himself (i.e. Tycho Brahe). \"N\" and \"C\" on the left side of the letter \"V\" represent Nicolaus Copernicus, while \"T\" and \"B\" on the right represent Tycho Brahe."}
{"task_id": "341", "Question": "Based on the image information, what does the text author think is the relationship between Lin Zexu and Qishan?\nA、 Friends with similar meanings\nB、 Political enemies who are at odds with water and fire\nC、 Colleagues who are at odds with each other in terms of appearance and heart", "Level": 2, "Answer Type": "exactMatch", "Final answer": "C", "file_name": "341.png", "Answer Explanation": "Inferring based on image information"}
{"task_id": "191", "Question": "Which dynasty does this painting belong to?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Ming Dynasty.", "file_name": "191.png", "Answer Explanation": " Anonymous, Fish-basket Guanyin, Ming dynasty, fifteenth century, Ink and color onsilk (140,3 by 75.0 centimeters), Freer Gallery of Art and Arthur M, Sackler Gallery, SmithsonianInstitution, Washington, D.c.: Gift of charles Lang Freer, Catalog F1911.297."}
{"task_id": "256", "Question": "\tIn what year was this speech given?", "Level": 2, "Answer Type": "exactMatch", "Final answer": 1942, "file_name": "256.mp4", "Answer Explanation": ""}
{"task_id": "026", "Question": "Please finish the blank with a number.\nAccording to  \"The Economic Organization of Winemaking: French Cooperatives and California Corporations in Historical Context\",in a report sponsored by the US Department of Agriculture in 1915, a researcher reported that “at least _____ acres of vines had been lost in the preceding decades; worse, only a few had been replanted in the past ten years, and of those, many were still not planted on resistant rootstock\" ", "Level": 1, "Answer Type": "exactMatch", "Final answer": 250000, "file_name": "", "Answer Explanation": " In a report sponsored by the US Department of Agriculture in 1915, a researcher reported that “at least 250000 acres of vines had been lost in the preceding decades; worse, only a few had been replanted in the past ten years, and of those, many were still not planted on resistant rootstock\" \n"}
{"task_id": "241", "Question": "Who is the male figure in this altarpiece?\nA. Jesus.\nB. Saint Anthony.\nC. Saint Francis.\nD. Saint George.", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "241.png", "Answer Explanation": "Altarpiece dedicated to Saint Anthony and Saint Margaret\nLluís Borrassà, the second son of the painter Guillem Borrassà, was part of a family of painters from Girona which worked in this country from the mid-14th century until the mid-15th century. There is documentary evidence that in 1383 Lluís Borrassà's painting workshop was open in the city of Barcelona, soon to become one of the largest workshops in the city, where numerous artists, helpers and collaborators worked. His arrival in Barcelona coincided with the moment when the Italianate Gothic style, prevalent in this country throughout the second half of the 14th century, whose chief disseminator had been the Serra brothers' workshop, was exhausted and going into decline. The new International Gothic art that in those years was beginning to be produced in Flanders, Paris or Milan was characterised by leaving behind the balance and the sober harmony of the shapes and the colours, made fashionable by the artists from Siena of the 'trecento', in order to introduce a new naturalistic aesthetic based on the dynamism and the movement of the figures and the use of very bright and contrasting coloured pigments. The Episcopal Museum conserves possibly the most representative collection of work by Lluís Borrassà, through which we can follow the introduction and development of this new artistic current in his work. The altarpiece of Saint Anthony the Abbot and Saint Margaret from Rubió, despite being a modestly sized altarpiece, introduces in the lateral scenes this new narrative language based on very explicit gestures like the scene of the saint's dialogue, refusing Olybrius' advances."}
{"task_id": "011", "Question": "Please finish the blank with a number.\nAccording to \"Labor, Urbanization, and Political Imagination in Namibia, 1943-1994\",at the time of the Custodian of Enemy Property’s confiscation of the OMEG holdings at the beginning of the Second World War, OMEG owned ______hectares (about 230 square miles) of farm and timber land. ", "Level": 1, "Answer Type": "exactMatch", "Final answer": 59817, "file_name": "", "Answer Explanation": "At the time of the Custodian of Enemy Property’s confiscation of the OMEG holdings at the beginning of the Second World War, OMEG owned 59,817 hectares (about 230 square miles) of farm and timber land. "}
{"task_id": "027", "Question": "Please finish the blank with a number.\nArchaeological investigations show that between 700 and 900 C. E. _____temples and temple complexes were constructed on the southern slopes of Mount Merapi in central Java. ", "Level": 1, "Answer Type": "exactMatch", "Final answer": " thirty-three", "file_name": "", "Answer Explanation": "Archaeological investigations show that between 700 and 900 C. E. thirty-three temples and temple complexes were constructed on the southern slopes of Mount Merapi in central Java.\n"}
{"task_id": "095", "Question": "առաջին աշխարհամարտի ընթացքում օսմանյան բանակում ծառայող հայ զինվորների թիվը մոտավորապես ինչքա՞ն է։Ա. 100 հազար Բ. 50 հազար Գ. 30 հազար Դ. 200 հազար\nԵ. 250 հազար Զ. 300 հազար", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "Ա", "file_name": "", "Answer Explanation": ""}
{"task_id": "184", "Question": "Who is the main character depicted in this thangka?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Lobzang Palden Yeshe, sixth Panchen Lama", "file_name": "184.png", "Answer Explanation": "Buddhist hanging scroll (thangka) of Lobzang Palden Yeshe, made by an unknown artist in the 18th century with colours on cotton in Tibet. The main figure is Lobzang Palden Yeshe (1738-80), sixth Panchen Lama and teacher of Emperor Qianlong."}
{"task_id": "121", "Question": "\tWhat is the title of the original essay from which this text is excerpted?\nWe have seen how even in its childhood, when it was centred in Vladimir, and later, in its youth, when it was centred in Moscow, the Great Russian [despotic] element was inclined to subdue and absorb various neighbouring regions. The same thing occurred in the religious and intellectual sphere. The Great Russians developed an intolerance of other faiths, a disdain of other nationalities, a very high opinion of themselves. [Answer in Russian]", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Две русские народности ", "file_name": "", "Answer Explanation": "excerption from Ralph Lindheim and George Luckyj, Towards an Intellectual History of Ukraine: An Anthology of Ukrainian Thought from 1710 to 1995, published by University of Toronto Press in 1996."}
{"task_id": "233", "Question": "What are the three approaches in Chinese Gazatte studies?  (Answer Format:The History of XXX)", "Level": 1, "Answer Type": "exactMatch", "Final answer": "The history of the press, the history of the state, \nand the history of information in society", "file_name": "233.jpg", "Answer Explanation": ""}
{"task_id": "260", "Question": "Who is the designer for this wallpaper? \n", "Level": 2, "Answer Type": "exactMatch", "Final answer": "George Gilbert Scott", "file_name": "260.png", "Answer Explanation": "This wallpaper was produced by the company of William Morris, however, it was not designed by Morris himself. A letter from Morris's business manager suggests that this paper was the work of the architect George Gilbert Scott (1839-1897). In 1874 Scott was one of the founders of Watts & Co, a company which issued some wallpapers in a similar style."}
{"task_id": "166", "Question": "Who is the victim in the photo?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Zhao Erfeng", "file_name": "166.jpg", "Answer Explanation": "Judging based on both sides of the photo"}
{"task_id": "401", "Question": "甘蔗害虫「筬象蟲」の成長形態のイメージを以下に示します。添付資料に基づいて「筬象蟲」がどの成長段階で甘蔗に最も危害を与えるかを判断してください。これに対して松江春次が南洋興発株式会社の社長を務めていた間、どのような有効な措置を取って対応しましたか？\n\nA.成蟲の段階。 捕殺を実施する。\nB.幼蟲の段階。 天敵を引き入れる。\nC.蛹の段階。 甘蔗を焼き払う。\nD.繭の段階。 新しい甘蔗の品種を導入する。", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "401_1.pdf;401_2.png;401_3.pdf", "Answer Explanation": "最初のテキストを読んだ後、\n「筬象蟲」は繭、幼虫、蛹、成虫の4つの成長段階で甘蔗に大きな危害を及ぼすことがわかった。\nその中で幼虫段階「筬象蟲」は甘蔗の内部で成長して発育し、\n甘蔗の汁を吸うことは甘蔗にとって最も危害が大きい。\nまた、2番目のテキストを読んでみると、松江春次は南洋興発株式会社の社長を務めていた間、\n甘蔗の焼却、「筬象蟲」の天敵の導入などの一連の措置をとっていたが、\nその中で「筬象蟲」の天敵を導入するのが最も効果的であることがわかった。"}
{"task_id": "131", "Question": "Whose plan for reinforcing the Singer Building through the installation of additional column lines and footings, a.k.a. the “Singer Building Extension”, was adopted?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "O. F. Semsch", "file_name": "", "Answer Explanation": "The architect's engineer, Mr. O. F. Semsch, reported a plan for reenforcing the building through the installation of additional column lines and footings, which was adopted. This work of raising the old Singer Building to a height uniform with that of the Bourne and Bourne Addition was known as the “Singer Building Extension.”"}
{"task_id": "356", "Question": "Please indicate the language of the following passage and the historical document from which it was extracted and translated.\n\nКингуниль кии-бурисчэ истачийаа\n1. Көдэ йаwнар тудэ чаҕадьэл-буньил чаҕадьэлҕа чаҕадьэйуол-мораw параwааньэй. Таҥ чаҕадьэлги амучэ усулуобуйаҕа ууйуол-мораwньэй тадаатэ кодэҕа эл чаҕадьэчуон поньаатэйэҥ монул чуҥдэ анмолҕинь эwльэйуол-мораwньэй.\n2. Көдэ йаwнар тудэ чаҕадьэрэн wиэйуолньэҥ көдиньбандьэ поҕодэлэ-нэмэлэ мэдьуол-мораw параwааньэй.\n3. Көдэ тудэ wиэйуол wальэдаҕат эл охойчэндьэрукунэҥ мэдьуол-мораwньэй. Таҥньэги тудэ кэдэл тадаатэ нимэндьиигин наадиимэрукунпэдаҕа мэ пэлуол-мораwньэй.\n4. Көдэ йаwнар тудэ интэриэспэ чоҥнулҥинь профсоюзлэ wиэрэҥ, тадаа чилиэн ҥолуол-мораw параwааньэй.", "Level": 2, "Answer Type": "exactMatch", "Final answer": "(Tundra) Yukaghir; Universal Declaration of Human Rights", "file_name": "", "Answer Explanation": "/"}
{"task_id": "404", "Question": "This is the picture and transcription of ‘ The Table of Staffing Establishment of Donghai Commandery’（东海郡吏员簿） excavated from Yinwan Han Tomb M6(尹湾6号汉墓). Other manuscripts excavated from the same tomb have some records of chronology, such as the second year of Yongshi(永始二年, 15 BCE) , the fourth year of Yongshi(永始四年, 13 BCE) , the first year of Yuanyan(元延元年, 12 BCE) , the second year of Yuanyan(元延二年, 11 BCE) and the third year of Yuanyan(元延三年, 10 BCE) .  However, there is no such direct record in the given case. Please tell which of the following years is not a possible chronology of the give case.\nA. 20 BCE\nB. 16 BCE\nC. 12 BCE\nD. 8 BCE", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "404.pdf", "Answer Explanation": "The mentioned Xinyang Marquisate(新阳侯国) was established in the second year of Hongjia or 19 BCE, while Wuxiang Marquisate(郚乡侯国) was abolished in the third year of Jianping or 4 BCE. Thus the manuscript must reflect the situation between them due to the existence of those two marquisates. For the time of establishment and abolish of each marquisate, see Ma Menglong 马孟龙, Xihan Houguo Dili 西汉侯国地理 ( Shanghai: Shanghai Guji Chubanshe,2021) , 459-602."}
{"task_id": "174", "Question": "\n What did the author read from 3pm to 5pm based on the text content?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Annals of the Ming Dynasty", "file_name": "174.png", "Answer Explanation": "The character 'ǎ r' in ancient Chinese means from 3 pm to 5 pm in the afternoon. According to the corresponding content of the text, it can be inferred that the author was reading the book 'Annals of the Ming Dynasty（《明纪》）' at this time\n"}
{"task_id": "061", "Question": "What's the name of this painting?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Satire on Tulip Mania", "file_name": "061.png", "Answer Explanation": " Satire of Tulip Mania, painted by Jan Brueghel the Younger circa 1640."}
{"task_id": "391", "Question": "These are some fragments from Juyan New Bamboo and Wooden Slips(居延新简). Some of them could be put together and thereby reconstructed, while others serve as distractors within the given cases. After reconstructing as many slips as possible and making their transcriptions, please tell which of the following texts does not occur in the reconstructed manuscripts.\nA. 責不可得書到驗問審負知君錢白報謹驗問當辭曰迺十一月中從知君貸錢三千六百以贖婦當負臧貧急毋錢可償知君者謁報敢言之\nB. 下隧長薛隆書到言/丞相史弘\nC. 隧卒籍賞有青等廼辛巳府遣\nD. 賞伏地再拜請卿足下善毋恙甚善官", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "B ", "file_name": "391_1.jpg;391_2.jpg;391_3.jpg;391_4.jpg;391_5.jpg;391_6.jpg;391_7.jpg;391_8.jpg;391_9.jpg;391_10.jpg;391_11.jpg;391_12.jpg;391_13.jpg", "Answer Explanation": "The reconstructions are based on the shapes and grains of the fragments, the strokes and handwriting of the manuscripts, and the meaning of the contents of transcriptions. The results are:\n01_01 with 01_07, transcription: 責不可得書到驗問審負知君錢白報謹驗問當辭曰迺十一月中從知君/n貸錢三千六百以贖婦當負臧貧急毋錢可償知君者謁報敢言之\n01_06 with 01_13, transcription: 〼隧卒籍賞有青等廼辛巳府遣□〼\n01_09 with 01_11, transcription: 〼見吏桼人隧長薛隆爲部吏卒載八月食〼\n01_02 and 01_04 with 01_12, transcription: 賞伏地再拜請/n卿足下善毋恙甚善官……錢買□〼/n〼三百至五六月〼/n〼……謹〼\nA '〼' in the transcriptions means the end of the reconstructed slip remains broken. A '□' means there is an unidentifiable character in the original manuscript. A '/n' means the start of a new line.\nChoice A, C and D occur in the transcriptions, while '書到言/丞相史弘', a part of choice B, occurs in the distractor 01_03, and '隧長薛隆', another part of choioce B, occurs in the reconstructable 01_09.\nFor more detailed explanation of each reconstruction, see http://www.bsm.org.cn/?hanjian/9634.html,  http://www.bsm.org.cn/?hanjian/9566.html, http://www.bsm.org.cn/?hanjian/8972.html, http://www.bsm.org.cn/?hanjian/8886.html."}
{"task_id": "077", "Question": "大庭脩による「落札帳」の研究に基づき、この「落札帳」の資料について、以下のどの解釈が正しいですか？\n\nA. この文献の中で、書籍の価格は長崎商館の書物目利によって定められた。\nB. 『今古奇観』一部一セット十二冊の最終落札価格は十二両三分であった。\nC. 『朱子文集』一部一セット五冊の最終落札価格は二十二両五分であり、落札者は三枝であった。\nD. この文献における書名の後に続く書籍の価格は、長崎に到着した中国商人の販売価格である。E. 『金石萃編』の一部は八セットであり、落札者は長ヲカであった。", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "Ｃ", "file_name": "077.png", "Answer Explanation": "大庭脩の解釈に基づき、「落札帳」は日本商人が長崎の会所で商品を確認し、入札した記録であり、AとDは誤りです。『今古奇観』の入札記録によると、金沢やの入札価格が最も高く、十五両六分であり、Bは誤りです。《金石萃編》の最終的な落札者は三枝であり、Eは誤りです。Cは資料の情報と一致しています。"}
{"task_id": "228", "Question": "Based on this drawing, which of the following options is incorrect?\nA.It depicts the singing and dancing activities of black slaves in the late 19th century.\nB.The scene it depicts takes place in a market in New Orleans.\nC.Along with the arrival of these slaves came the musical traditions of black Africa. These musical elements greatly influenced the later forms of black music such as jazz, blues, and call and response.\nD.The artist of this work is one of Mark Twain's collaborators.", "Level": 1, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "228.jpg", "Answer Explanation": "This illustration was created in 1886. However, it depicts slave dances in New Orleans 40 some years earlier."}
{"task_id": "278", "Question": "Through this 1912 letter sent to Sun Zhuang by Peng Yizhong (who was engaged in the newspaper business in Beijing in the early Republican period of the late Qing Dynasty), this letter cannot provide which of the following research perspectives? A. The development of the newspaper industry in Xinjiang during the late Qing and early Republican period, for example, which newspapers in the east might have been the source of information for its press; B. The political situation in Xinjiang during the late Qing and early Republican period; C.Peng Yizhong's personal experience in Xinjiang; D. The Qing government's rule in Xinjiang (Multiple choice)", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "D", "file_name": "278.jpg", "Answer Explanation": "Based on the content of the letter, it can be seen that Peng mainly ordered newspapers and periodicals from Sun, and as an important figure in the newspaper industry in Xinjiang in the late Qing Dynasty, the newspapers and periodicals he ordered and the channels he used were closely related to the development of the local newspaper industry; furthermore, the letter mentions the military coup in Xinjiang during the period of the establishment of the Republic of China, as well as his personal response under this circumstance, which is extremely helpful for the study of the local situation as well as for the completion of Peng's personal biography. This is extremely helpful for studying the local situation and completing Peng's biography."}
{"task_id": "156", "Question": "According to No.077 archive of the Ministry of Defence of the USSR, Department 2-й, in 1965, how many people from the I Belarusian front was killed in Poland during the war in 1941-1945?\n\n", "Level": 1, "Answer Type": "exactMatch", "Final answer": 129960, "file_name": "", "Answer Explanation": "Known from the source material."}
{"task_id": "394", "Question": "In all, how many vehicles and men were captured by Duo You（多友） in the attack on the Xian Yun（玁狁） tribe?", "Level": 3, "Answer Type": "exactMatch", "Final answer": "127,28", "file_name": "394.jpg", "Answer Explanation": "This material tells how Wu Gong ordered Duo You to attack the Xian Yun tribe. The capture of vehicles by Duo You is mentioned twice, the first time being 117, the second time being 10, and the two together being 127. The captives are mentioned three times, 23, 2 and 3 respectively, totalling 28."}
{"task_id": "136", "Question": "What does' thief 'refer to in the imperial edict?  \nA. The Taiping Rebellion\nB. White Lotus Sect Uprising  \nC. Boxer Rebellion\nD. Small Sword Society Uprising", "Level": 1, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "136.png", "Answer Explanation": "most he edict repeatedly mentions regions such as Hubei  Jingzhou , and Xiangyang , which were core areas of the White Lotus Sect Uprising (1796–1804). These locations align with historical records of the rebellion’s spread.\n"}
{"task_id": "384", "Question": "How many place names that fall within the present-day city of Nanjing, Jiangsu Province, appear in this poem (including the title)? 《贈別上元主簿張著》上書一見平津侯，劍笏斜齊秣陵尉。朝垂綬帶迎遠客，暮鎖印囊飛上吏。長樂花深萬井時，同官無事有歸期。回船對酒三生渚，繫馬焚香五願祠。日日澄江帶山翠，綠芳都在經過地。行人看射領軍堂，遊女題詩光宅寺。風流才調愛君偏，此別相逢定幾年。惆悵浮雲迷遠道，張侯樓上月娟娟。", "Level": 3, "Answer Type": "exactMatch", "Final answer": 7, "file_name": "", "Answer Explanation": "7个。现在仍存在的今地名或知名度高的历史地名有三个：“上元”即上元县，是南京的旧称；“秣陵”也是南京的旧称；“光宅寺”今仍存在，在城南老虎头。需要结合地理志书记载的、现在知名度不高的历史地名有2个：“五愿祠”，现存文献中有“五愿树”“五愿木”；“张侯楼”，老虎头为孙吴娄侯张昭旧宅。需要结合诗文上下文文意推断的，现在彻底不存在的历史地名有2个：“三生渚”与“领军堂”，由于全诗内容均为在南京的游览过程，出于地名对仗，也都是在南京范围内存在的地名。本题需综合使用历史学考证、地理学方法以及文学理解，以找全所有地名。部分地名由于文学创作原因和实际表示不同、形成异名（张侯楼、五愿祠），部分地名现今无考（三生渚、领军堂），AI基于既有的知识难以直接找出。但以对仗的修辞手法结合文意不难看出均在上元县即今南京范围内。需要说明的是，即使AI查找到了相应的地名，对地名本身的介绍也与实际情况存在一定甚至较大偏差。"}
{"task_id": "129", "Question": "Which year did Friedrich Hölderlin make his trip to Fulda, a city in Hesse, Germany?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 1794, "file_name": "", "Answer Explanation": "In his letter to G. W. F. Hegel in 10th July 1794, he told Hegel that he recently travelled to Fulda."}
{"task_id": "045", "Question": "Why did Locke write his Two Treatises of Government, or under what circumstance/context and with what specific purpose/intention? A. Defending for the Glorious Revolution B. Supporting for American thought of independence C. Responding to the Exclusion Crisis D. Questioning the arguments in Hobbes’ Leviathan", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "", "Answer Explanation": "Locke’s Two Treatises of Government & Peter Laslett’s “Introduction”to John Locke’s Two Treatises of Government, which, in detail, analyzed the words used by Locke and his personal book collection during the period of writing Treaties"}
{"task_id": "365", "Question": "When was this speech given? ", "Level": 2, "Answer Type": "exactMatch", "Final answer": "22 July, 1939", "file_name": "365.m4a", "Answer Explanation": "Wang Jingwei believed that China could not win the war against Japan and should instead cooperate with Japan to maximize its post-war interests. He argued that the communists’ advocacy for continued resistance served only to protect the Soviet Union, not China. This is a record of Cantonese."}
{"task_id": "096", "Question": "هذه قصيدة للشاعر المصري حافظ إبراهيم ،\nجاءَ وَالأحلامُ في أصفادِها\nطبعَ الظلمِ على إغلاقِها\nأمِنَ التقليدِ فيها فغدت\nإصرَ التقييدِ فيها ونُهى\nجاءَها هوجٌ بشَاوٍ دونَهُ\nوانبرى يصدَغُ من أغلالِها من هو الكاتب الغربي الذي ورد ذكره في هذه القصيدة؟", "Level": 3, "Answer Type": "exactMatch", "Final answer": "فكتور هوغو\nVictor Hugo", "file_name": "", "Answer Explanation": "حافظ إبراهيم شاعر مصري معروف من أوائل القرن العشرين، لُقِّب بـ \"شاعر النيل\" و\"شاعر الشعب\". قام بترجمة رواية البؤساء لفكتور هوغو، وكانت هذه القصيدة بعنوان فكتور هوغو، حيث تشاركا الإيمان بتحرير الفقراء من قيودهم."}
{"task_id": "036", "Question": "Wo hat Hermann Gipperich die kaufmännische Lehre geschafft? ", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Tschifu", "file_name": "", "Answer Explanation": "Hermman Gipperich ist ein Angestellter vom deutschen Auswärtigen Amt, der lange Zeit in China gearbeitet. Er kam nach China, weil sein Vater Emil Gipperich ein Geschäft in Shandong gehabt. So hat er in Tshifu sein Geschäftsstudium gemacht. "}
{"task_id": "382", "Question": "Identify the artists in the following advertisements and calculate the prices for different artists and different themes. Determine which artist's paintings are more expensive. \nA 醒圆居士 B 曉汀 C 馬孟容", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "382.jpg", "Answer Explanation": "Based on the Tang-style Fu (scrolls), Artist A has a higher average price per chi."}
{"task_id": "292", "Question": "关于图中器物的年代和产地正确的选项是：A.唐代晚期越窑 B.北宋中期耀州窑C.北宋晚期台州窑 D.南宋早期龙泉窑", "Level": 2, "Answer Type": "exactMatch", "Final answer": "C", "file_name": "292.jpg", "Answer Explanation": "北宋中期开始，中国窑业格局发生巨变，随着王安石变法中“用近易远”政策等一系列因素导致越窑走向衰弱，但越窑使用垫圈装烧的工艺传统影响甚广；与此同时龙泉窑逐渐兴起，并在北宋晚期后发展出自我特色，广泛流行双面刻划花结合箅点的装饰，技术上使用独具特色的垫饼装烧。台州沙埠地区地处上述两大窑口核心区的中间位置，又在窑址中发现和北方耀州窑交流互鉴的痕迹，其产品呈现出延用越窑垫圈工艺、借鉴耀州窑刻花技术、追随龙泉窑装饰风格的交融之态，图中这件碗就是典型的北宋晚期台州地区窑业产品的典型案例。"}
{"task_id": "310", "Question": "This is the picture and transcription of slip 8-135 of Liye Qin Slips ( 里耶秦简 ) . Which of the following statement is true according to the given material.\nA. The whole manuscript was written by Jiu (樛), the acting construction supervisor ( sikong shou, 司空守 ) of Qianling（遷陵） County.\nB. Lang (狼) made a fake ship for Qianling County.\nC. The acting deputy of Qianling (Qianling shou cheng, 遷陵守丞) blamed the acting construction supervisor for reproting the case of Lang too late.\nD. Lang had lost the ship by the time when the manuscript was written.", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "310_1.docx", "Answer Explanation": "310_2.png"}
{"task_id": "387", "Question": "What is the average rate of decrease of the land tenanted according to the text? Please use the best statistics methods.(Final ending round to an integer) (1 toft=1/4 acres,1 bovate=15 acres)A.57% B.50% C.58% D.60%", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "387_1.png;387_2.png;387_3.png", "Answer Explanation": "We need to figure out the number of land tenanted before and after the pestilence in every document and some narratives might be a little obscure. According to the theory of weighted mean, we add up all the acres before pestilence: 7 tofts+4 tofts+4 bovates+44acres=106.75acres. We add up all the lessened acres after pestilence:3 tofts+3 tofts+3 bovates+14acres=60.5acres. Finally,the ending equals to 57%.(60.5/106.75*100%,round to integer)"}
{"task_id": "227", "Question": "Which of the following options is incorrect in describing this picture?\nA.The person standing on a high place in the center of the picture speaking to the crowd was the leader of the Republican Left of Catalonia at the time.\nB.This picture was taken on 14 April 1931.\nC.This photograph records the events that marked the beginning of the revived Generalitat of Catalonia.\nD.The square where this photo was taken was named after a nearby church.", "Level": 1, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "227.jpg", "Answer Explanation": "Francesc Macià proclaimed the Catalan Republic in Plaça de Sant Jaume, Barcelona, 14 April 1931. Macià proclaimed a Catalan Republic on 14 April, but after negotiations with the provisional government he was obliged to settle for autonomy, under a revived Generalitat of Catalonia. Catalonia was granted a statute of autonomy in 1932, which lasted until the Spanish Civil War."}
{"task_id": "338", "Question": "What was the name of the location where this picture was taken at that time?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Hanseong", "file_name": "338.png", "Answer Explanation": "Judging based on image information.In 1911, the term \"Gyeongseong\" in South Korea referred to the capital at that time.\nJingcheng \"was the term used during the Japanese colonial period to refer to the former capital of the Joseon Dynasty, Hanseong. After the liberation of the Korean Peninsula, this city was renamed \"Seoul\"."}
{"task_id": "372", "Question": "图中的器物是什么朝代生产的？", "Level": 3, "Answer Type": "exactMatch", "Final answer": "西晋", "file_name": "372.png", "Answer Explanation": "图中的堆塑罐是仅出现于东汉晚期到东晋早期的典型丧葬用器。此件为带有龟趺碑自铭器，上可识别字体有“出始宁，用此靈……宜子……”，包含了器物名称、产地和吉语三部分。始宁为汉晋时绍兴上虞一带古地名，也是早期越窑的核心生产地。从多层贴塑等繁复器物造型和吉语习惯可判断为西晋器物，结合同墓地出土的其他带“元康”年号的堆塑罐可以进一步确定其为西晋早期产品器物。"}
{"task_id": "140", "Question": "Which deceased was this epitaph written for?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Shen Chang", "file_name": "140.tif", "Answer Explanation": "The first and third columns of the document provide answers to the questions"}
{"task_id": "147", "Question": "图中有一个墓，是谁的墓？", "Level": 1, "Answer Type": "exactMatch", "Final answer": "周孝子", "file_name": "147.png", "Answer Explanation": "图中左上角位置有“周孝子墓”"}
{"task_id": "028", "Question": "Please finish the blank with a name of report with its author.\nAccording to \"The People’s School: A History of Oregon State University\", _________provided details for two new programs,one for the School of Vocational Education, which would prepare students to teach high school subjects that were offered in the college’s technical schools,with education courses required as minors. ", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Kerr’s Biennial Report for 1922", "file_name": "", "Answer Explanation": "Kerr’s Biennial Report for 1922 provided details for two new programs,one for the School of Vocational Education, which would prepare students to teach high school subjects that were offered in the college’s technical schools,with education courses required as minors. \n"}
{"task_id": "354", "Question": "When was this map of India drawn?（Accurate to the year)", "Level": 2, "Answer Type": "Exact match", "Final answer": 1856, "file_name": "354.png", "Answer Explanation": "The map is specified\"Indian under Dalhousie, 1856\"."}
{"task_id": "177", "Question": "Where was this photograph taken?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Outside the Canidrome", "file_name": "177.jpg", "Answer Explanation": "Photograph taken outside the Canidrome. See article in 'The Argus' (17 February 1938): http://trove.nla.gov.au/ndp/del/article/11149506."}
{"task_id": "336", "Question": "What era is this a historical video of Taiwan from\nA. Japan occupied era\nB. Qing governed era\nC. KMT goverrned era", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "336.mp4", "Answer Explanation": "A huge portrait of Chiang Kai shek appeared in the video, emphasizing the cult of personality during the martial law period in Taiwan"}
{"task_id": "202", "Question": "According to The North - China Herald and Supreme Court& Consular Gazette (1870-1941)of 18 July 1898, the American Newman was hanged for the murder of a man from which country many years ago?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Portuguese", "file_name": "", "Answer Explanation": "Since the execution of Newman,the American hanged for the murder of a Portuguese whom he found with his paramour, many years ago,no person of Oaucasian origin has been executed in Hongkong."}
{"task_id": "091", "Question": "When lanterna magica was introduced to Japan, it was widely used and emphasized in scientific and intellectual writing/picturing. Which element did play a significant role in such process at the intersection between art and science? A. The Japanese tradition of kage-e (shadow pictures), which adopts similar principles of optics B. For providing the vivid experience of scientific phenomenon and political events, for example, the memory of Lu Xun and the fictional event of magical lantern C. The magical lantern could serve as a tool for scientific and art education, seeking a wide demand of cultivation during the crisis of nation-state building and modern spirit forming D. The magic lantern shows affinities to the optical structure of eyes, which is rooted in European seeking for religious issues, scientific research, and philosophical thinking", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "D", "file_name": "", "Answer Explanation": "The introduction and increasing use of the magic lantern in the late eighteenth and early nineteenth centuries coincided not only with the development of a materialistic rather than metaphysical understanding of nature and the human body, but also specifically with the development of optical theory in Japan. In view of this, it is noteworthy that an envisaged connection between the eyes and the optical device was present in some of the earliest Japanese writings about the magic lantern. Through looking at the language and context of these references, it becomes apparent that Ōtsuki's conception of the device ‘as an eyeball’, and by extension the eyeball as a magic lantern, was not an entirely original idea, but rather the evolution of a pre-existing one. One of the two oldest surviving references to the device in Japanese—the other being Koikawa Harumachi's aforementioned Muda iki—is the three-volume book of magic tricks, Tengu-tsu (‘The Goblin's Nose’), published in Osaka in 1779 by the prolific chronicler of magic tricks, Hirase Hose."}
{"task_id": "185", "Question": "Which building's under-construction steel frame is this?(Answer Format:The Name of Building;The City Where It is located in)", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Pokfulam Hospital, Hong Kong.", "file_name": "185.jpg", "Answer Explanation": "Crown Agents for the Colonies - Pokfulam Hospital, Hong Kong.View in Bridge Yard and Construction Yard, Middlesbrough, England, of the assembled building frame, which was then taken apart and shipped to Hong Kong."}
{"task_id": "410", "Question": "3.材料を見て、サイパン鉄道建設の中で、どの地方の工事難度が最も高いと推定して、そして其の理由を指摘してください。\n\nA.A点——南線「トトラムの第二中継所から第二農場まで」。線路がラウラウを抜けるには、硬い岩を掘り、同時に低地に盛土を充填する必要がある。\nB.B点——南線「チャランカノアからトトラムの第二中継所まで」。線路建設中に暴風雨などの悪天候に見舞われた。\nC.C点——北線「チャランカノアからガラバン街支庁まで」。タツボーチョーの裾を迂回して、鉄道建設費が急激に膨張した。\nD.D点——北線「ガラバン街支庁からタナバコまで」。地形の起伏が大きく、線路の勾配が大きく、列車の輸送能力が低下したになった。", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "410.png", "Answer Explanation": "『南洋開拓十年誌』の107—112ページの内容を読むと、サイパン鉄道建設の中で最も難しい部分はラウラウ湾付近の鉄道建設であることがわかります。ラウラウ湾付近の地質条件は複雑で、地勢の高い地帯では硬い岩を掘り、低地地帯では盛土を充填する必要がある。だから本題の正解は「A」です。"}
{"task_id": "276", "Question": "Who is most likely to be approached for help in order to solve the problem in the letter?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "William Sealy Gosset.", "file_name": "276.png", "Answer Explanation": "The question in the letter concerns corrections to statistical standard deviations in the case of small samples. Historical actors are most likely to seek help from the founders of small sample theory, i.e. William Sealy Gosset."}
{"task_id": "388", "Question": "Which historical figure corresponds to the protagonist of this article?", "Level": 3, "Answer Type": "exactMatch", "Final answer": "Charles the Bald", "file_name": "388.png", "Answer Explanation": "It is mentioned in the text that the protagonist's older brother is Lothar I."}
{"task_id": "175", "Question": "\nWhat is the name of the girl in the photo?[Answer in Chinese]\n\n\n\n\n\n\n\n", "Level": 1, "Answer Type": "exactMatch", "Final answer": "李莉玲", "file_name": "175.png", "Answer Explanation": "Judging based on image information"}
{"task_id": "159", "Question": "Where was this cultural heritage discovered?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Qostanai oblysy, Kazakhstan", "file_name": "159.png", "Answer Explanation": "Known from the source."}
{"task_id": "087", "Question": "The beautiful flowers in this painting may have been infected with viruses. According to contemporary scholars' research, what does this virus rely on for transmission?", "Level": 3, "Answer Type": "exactMatch", "Final answer": "Myzus persicae ", "file_name": "087.png", "Answer Explanation": "\"The color of a tulip actually consists of two pigments working in concert — a base color that is always yellow or white and a second, laid-on color called an anthocyanin; the mix of these two hues determines the unitary color we see. The virus works by partially and irregularly suppressing the anthocyanin, thereby allowing a portion of the underlying color to show through. It wasn’t until the 1920s, after the invention of the electron microscope, that scientists discovered the virus was being spread from tulip to tulip by Myzus persicae, the peach potato aphid. Peach trees were a common feature of seventeenth-century gardens.\n\nBy the 1920s the Dutch regarded their tulips as commodities to trade rather than jewels to display, and since the virus weakened the bulbs it infected (the reason the offsets of broken tulips were so small and few in number), Dutch growers set about ridding their fields of the infection. Color breaks, when they did occur, were promptly destroyed, and a certain peculiar manifestation of natural beauty abruptly lost its claim on human affection.\""}
{"task_id": "215", "Question": "What is the machine in the picture?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "An early nineteenth-century gas plant.", "file_name": "215.png", "Answer Explanation": "An early nineteenth-century gas plant. Coal was heated and gasified in the retorts on the right.\nThe gases were then washed in water in the hydraulic main and bubbled through lime water to remove hydrogen sulphide in the purifier on the left. The gas was stored in gasholders (also called gasometers) before being let into the pipe network. Credit: Frederick Accum, A Practical Treatise on Gas-light (1815)."}
{"task_id": "280", "Question": "In this picture,there are two places metion about time information,which answer is right?A、February and OctoberB、January and MarchC、July and AugustD、May and September", "Level": 2, "Answer Type": "exactMatch", "Final answer": "A", "file_name": "280.png", "Answer Explanation": "basic skills for recognizing the Chinese character.Here is the text information:二月戊寅張掖大守福庫丞承憙兼行丞事敢告張掖農都尉護田校尉府卒人謂縣律曰臧它物非\n錢者以十月平賈計案戍田卒受官袍衣物貪利貴賈貰予貧困民吏不禁止浸益多又不以時驗問"}
{"task_id": "054", "Question": "From which city might the bamboo slips in the image above have been unearthed?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Wuwei", "file_name": "054.png", "Answer Explanation": "Wuwei Medical Bamboo Slips of the Han Dynasty"}
{"task_id": "376", "Question": "Please fill in the blankThis is a map that shows the distribution of pearl ponds, coastal stockades, military camps, etc. Pearl ponds are ponds in the sea, and coastal stockades are distributed along the coast. Please answer: There are (   ) pearl ponds and (   ) coastal stockades in the picture.", "Level": 3, "Answer Type": "exactMatch", "Final answer": "5;11", "file_name": "376.png", "Answer Explanation": "从右往左看，图中共有5个珠池，11个海寨。\nLooking from right to left, there are a total of 5 pearl ponds and 11 coastal stockades in the picture.\n珠池：平江池、岛坭池、杨梅池、青婴池、断望池；\n海寨：英罗寨、坎马寨、北望寨、川江寨、陇村寨、调埠寨、珠场寨、白沙寨、武刀寨、龙潭寨、古里寨"}
{"task_id": "076", "Question": "黄永年『古籍版本学』第138〜140ページにおける明末刻本の紹介、および明万暦から明末にかけての刻本に関する参考図1・2（076_1、076_2、076_3 に該当）を基に、次のどの刻本が最も万暦から崇禎の朝に刻まれた可能性が高いと推測されますか？A・B・C・D・E", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "Ｃ/076_C ", "file_name": "076_2.png;076_3.png;076_A.png;076_B.png;076_C.png;076_D.png;076_E.png", "Answer Explanation": "Refer to 076_1.pdf. 黄永年の紹介に基づくと、明万暦および天啓、崇禎本の字体や版式には顕著な特徴があります。文字の面では、方体字や長方体字が現れ、版式では書名が魚尾より上に配置され、魚尾下には巻次のみが記載されています。版心は一般的に白口で、このような版式は宋元から明前期にはほとんど見られません。したがって、Cは典型的な明万暦刻本であり、A、B、D、Eはこれらの特徴を持っていません。"}
{"task_id": "167", "Question": "Who was he?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Xie Fengqi", "file_name": "167.jpeg", "Answer Explanation": "His identity can be identified by pictures and portraits"}
{"task_id": "294", "Question": "In which year, according to the original text, was the Buddhist stele's votive inscription dedicated? [Answer using traditional Chinese]", "Level": 2, "Answer Type": "exactMatch", "Final answer": "天監三年", "file_name": "294_1.docx;294_2.png;294_3.png", "Answer Explanation": "天監三年甲申/三月三日，比丘釋/法海奉為亡母/亡姊造无量壽/石像，願亡者乘/此福，去離危苦，/上昇天堂，与諸/賢聖而為眷屬，/廣及一切眾生，/等成无上正覺。"}
{"task_id": "178", "Question": "What military conflict was this armored train engaged in when this photo was taken?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "The January 28th Incident", "file_name": "178.jpg", "Answer Explanation": "This photograph, dated 2nd February 1932, was taken for the French news agency 'Trampus'. The caption on the back of the print states that this is a Chinese military armoured camouflaged train sent to Shanghai to aid the relief of retreating Chinese soldiers, during the ‘Shanghai Incident’. The skirmish, usually referred to as the ‘January 28 Incident’ or ‘Shanghai Incident’ lasted from 28 January to 3 March 1932, in and around Shanghai."}
{"task_id": "210", "Question": "How many Jews were in Prosteˇjov in 1900?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 987, "file_name": "", "Answer Explanation": "In Prossnitz/Prosteˇjov, for example, a clothing-manufacturing city in central Moravia that in 1900 contained 24,054 people, of whom 987 (4.1 percent) were Jews, the Israelitische Kultusgemeinde\n(Jewish religious community) ran synagogues, hired rabbis,and provided kosher meat to all Jews in the city and to Jews in the juridically separate political Jewish community. "}
{"task_id": "265", "Question": "According to the content of the text, please determine which Chinese book the passage is from?(Answers in Chinese characters)", "Level": 2, "Answer Type": "exactMatch", "Final answer": "史记", "file_name": "265.png", "Answer Explanation": "Rationale：史记130卷，（西汉）司马迁撰（刘宋）裴骃集解（唐）司马珍索隐（唐）张守节正义，清乾隆四年武英殿校刻本，p.5.治亂安危之故忠賢奸佞之實是非得失具可考見居今而知古鑒徃以察来揚子雲曰多聞則守之以約多見則守"}
{"task_id": "160", "Question": "According to archives of German reports in June 1937, how many registered communist party members were there in Villeurbanne, Lyon?", "Level": 1, "Answer Type": "exactMatch", "Final answer": 800, "file_name": "", "Answer Explanation": "The original text is: in der Arbeitervorstadt Villeurbanne, einen selbständigen Verwaltungsbezirk von 80.000 Einwohnern und sogenannten Hochburg des Komunismus, beträgt die Zahl der eingeschriebenen Parteimitglieder 800…"}
{"task_id": "194", "Question": "According to consumption of Jiang Village in Fang Xiaoping’s book  Barefoot Doctors and Western Medicine in China,\nWhat was the usage proportion of Western medicine in Cooperative Medical Service in 1971?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "51.7%.", "file_name": "", "Answer Explanation": "The table on page 112 of the book shows that the proportion of Western medicine is 51.7%."}
{"task_id": "182", "Question": "What city is the background of this portrait?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "The city of Frankfurt am Main", "file_name": "182.jpg", "Answer Explanation": "This copper engraving depicts the king at the zenith of his career. The engraving is by Lucas Kilian, a Dutch- and Italian-trained artist who lived most of his life in Augsburg. In the background can be seen the city of Frankfurt am Main, which initially resisted conquest by the king. True to its genre, the purpose of this regal equestrian portrait was to strengthen the public image of the king not as a national icon, but rather as a hegemonic European power broker."}
{"task_id": "062", "Question": "Какое отделение Крымско-Кавказского горного клуба закрыто 1910 года? ", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Бессарабское Отделение", "file_name": "", "Answer Explanation": "Юбилейный Сборник Крымско-Кавказского Горного Клуба, С. 41: \"Бессарабское Отделение. Открыто в г. Кишиневе 21 апреля 1903 г. Закрыто 21 марта 1910 года.\""}
{"task_id": "006", "Question": "Please finish this blank with a number.The total value of worldwide mergers and acquisitions peaked at $______ billion in 2000.", "Level": 1, "Answer Type": "exactMatch", "Final answer": 1143.8, "file_name": "", "Answer Explanation": "006_Answer_Explanation.png"}
{"task_id": "025", "Question": "Please finish the blank with a number.According to\"Spain at War: Society, Culture and Mobilization, 1936-44\", in the autumn of 1936, the number of volunteer soldiers in the governmental zone in spain was not higher than _______(as examined in Chapter 2), whereas in the rebel zone there were no more than 100,000.", "Level": 1, "Answer Type": "exactMatch", "Final answer": 120000, "file_name": "", "Answer Explanation": "In the autumn of 1936, the number of volunteer soldiers in the governmental zone was not higher than 120,000 (as examined in Chapter 2), whereas in the rebel zone there were no more than 100,000\n"}
{"task_id": "196", "Question": "Which county's county chronicle is this?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Tongxiang", "file_name": "196.png", "Answer Explanation": "The ninth column reads, \"The west is called Wuzhen and the east is called Qingzhen,\" which is within the jurisdiction of Tongxiang."}
{"task_id": "008", "Question": "Please finish this blank with a number.The decline had been more rapid in the United States, where the difference between white and black life expectancy was now 6.3 years, than in Brazil, where it was_____.", "Level": 1, "Answer Type": "exactMatch", "Final answer": "6.7", "file_name": "", "Answer Explanation": "However, the decline had been more rapid in the United States, where the difference between white and black life expectancy was now 6.3 years, than in Brazil, where it was 6.7."}
{"task_id": "367", "Question": "What does the letter 'T' signify in this comic.(Refer to image 5) A. Truth  B.Tail C.Town D.tea", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "D", "file_name": "367.jpg", "Answer Explanation": "The character in the comic is a Chinese tea house waiter, and the \"T\" on the traditional Chinese shop sign (\"huangzi\"招牌) behind him represents the word \"tea\" (茶) from \"tea house\"."}
{"task_id": "186", "Question": "This is a picture of a middle school sporting event. What is the name of this school now?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Tianjin 30th Middle School", "file_name": "186.jpg", "Answer Explanation": "There are worded notes:rack meet of Chiu Chen School, October 10, 1927.The Chiu Chen School was a church school founded by the American Congregational Christian Church in Tianjin, with the Yangshan Elementary School and the Girls' School attached to it. The school was later moved with its headquarters from Xigu to Gangwei Road in Hebei, with Chinese and foreign teachers teaching together. The school building consisted of seven small two-story buildings, with brick structures, wooden floors, and large roofs. The main gate of the school was opened on Kunwei Road, which was later changed to Dongsanjing Road, while the school gate on Gunwei Road was used exclusively by the elementary school and the girls' school. “The school was closed after the July 7th Incident and was taken over by the Japanese regime when the Pacific War broke out. Later, the school was taken over by the Kuomintang regime, which restored the name of the school and resumed classes. The school was co-educational, and the principal was Li Ching-hsien. After the liberation of Tianjin, the name of the school was changed to the 30th Middle School."}
{"task_id": "192", "Question": "Who is the author of the picture content?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Tadashi Fukutake", "file_name": "192.png", "Answer Explanation": "Judging from the text in picture."}
{"task_id": "414", "Question": "This telegram was sent from______to______.", "Level": 3, "Answer Type": "exactMatch", "Final answer": "D'Alton;Ashley Clarke.", "file_name": "414.png", "Answer Explanation": "Through the recognition of the handwritten script in \"image 1\", it can be determined that the telegram begins with the salutation \"Dear Ashley Clarke.\" A database search was conducted to locate the complete telegram, and by examining the handwritten script, the signature at the end was identified as \"D'Alton\".(refer to image 2)In addition, the answer can be determined without relying on handwriting recognition. Through database retrieval, this telegram can be located within the F.O.371/41629 archives as a response to a preceding typewritten telegram in the same file. By examining the typewritten correspondence, the precise names of both the sender and recipient can be logically deduced."}
{"task_id": "396", "Question": "The notes on this page are based on the shorthand system developed by whom? A. John Wallis B. Thomas Shelton C. William Mason D. John Winthrop E. Roger Williams", "Level": 3, "Answer Type": "multipleChoice", "Final answer": "B", "file_name": "396.HEIC", "Answer Explanation": "Thomas Shelton's shorthand system appears to have been popular in 17th-century New England. [https://muse.jhu.edu/pub/56/article/856952] The probable writer of these notes is Roger Williams according to the book's provenance. [Theodore Delwiche is also interested in whether AI can convert such shorthand writings into longhand.]"}
{"task_id": "231", "Question": "Below is an excerpt from a newsletter. Please indicate the date it was published:\nthey [the civilians and soldiers in York] are so discontented with the delay of P. Ruperts coming, who hath received a command from his Majestie, that nothing but impossibilities should hinder him, from raising the siege at York, for that the Kingdom depended upon it.", "Level": 1, "Answer Type": "exactMatch", "Final answer": "2nd July", "file_name": "", "Answer Explanation": "On 2 July, the Kingdomes Weekly Intelligencer stated that ‘they [the civilians and soldiers in York] are so discontented with the delay of P. Ruperts coming, who hath received a command from his Majestie, that nothing but impossibilities should hinder him, from raising the siege at York, for that the Kingdom depended upon it’"}
{"task_id": "355", "Question": "The picture above is a schematic diagram of the overall population migration in Eurasia from the 14th to the 16th century, and the picture below is from the 17th to the 18th century. Based on the difference between the two pictures, we can determine which of the following options is wrong?\nA. The Ottoman Empire declined and its influence gradually withdrew from the Balkan Peninsula.\nB. The Russians gradually conquered the entire Siberian region.\nC. The Manchus’ entry into the Central Plains marked the very beginning of a period in which China’s maritime policy became closed.\nD.The progress of the civilized world gradually made it impossible for nomadic peoples to continue to conquer places unhindered and forced them to return to their fixed places of residence.", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "C", "file_name": "355.jpg", "Answer Explanation": "Since the Ming Dynasty, China's maritime policy has been oscillating between closedness and openness. The Qing Dynasty's coming to power continued the previous closed approach."}
{"task_id": "291", "Question": "what might be the type of dialects documented in the picture?", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "Shanghai Dialect", "file_name": "291.png", "Answer Explanation": "words like“白相” was used in the Wu dialects; while the syntax structure like \"儂...拉拉做啥“ could be only used in Shanghai Dialect literature"}
{"task_id": "413", "Question": "Whose maxims is recorded here?", "Level": 3, "Answer Type": "exactMatch", "Final answer": "Hippocrates", "file_name": "413.jpg", "Answer Explanation": "This short work consists of a collection of 25 maxims attributed to Hippocrates (circa 460-circa 377 BC).The text includes an explanation as to the title of the work, al-Risālah al-qabrīyah (Capsula Eburnea: Epistle from Hippocrates's grave). It states \"this is because it was found inside the tomb of Hippocrates, as is related from Galen, that he went to the land in which the tomb of Hippocrates was located, and he begged the sultan to allow him to open the grave, so he did, and [Galen] opened the grave and found these maxims and so removed them and published them by virtue of their abundant utility.\""}
{"task_id": "258", "Question": "who designed the pattern of this plate?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Cornelis Pronk", "file_name": "258.png", "Answer Explanation": "It is probable that the composition decorating this plate derives from a drawing by the Dutch artist Cornelis Pronk (1691–1759), who is known to have furnished designs to the Dutch East India Company. Pronk’s drawings were widely employed by Chinese porcelain painters as sources of decoration for porcelain intended for export to Europe."}
{"task_id": "105", "Question": "Finish the blank with the name of the shop: The magasin de nouveautés offers the possibility of choosing any type of speciality. It had many rooms and several floors and employed a large number of staff. The first shop of this type was the _______, which opened in Paris in 1793. ", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Pygmalion", "file_name": "", "Answer Explanation": " Common Sense."}
{"task_id": "125", "Question": "Which of the following is not the central theme that the author of this article wants to discuss?: A. The basic structure of the activity space for the Cheng family in Wuyuan     B. The Commercial Participation Modes of Modern Rural Residents and the Impact of Commercialization on Farmers' Activity Space C. The spatial characteristics of farmers' lives under the traditional socio-economic pattern      D. The Academic Significance of Cheng Family Life in Understanding the Connection between Traditional Villagers and the World Outside the Village", "Level": 1, "Answer Type": "multipleChoice", "Final answer": "A", "file_name": "125.pdf", "Answer Explanation": "Based on the living space of the Cheng family in Wuyuan, the author discusses the characteristics of the living space of rural farmers in modern China. The core issue consciousness is their way of commercial participation and the impact of commercialization on them."}
{"task_id": "283", "Question": "请判断图中的这枚钱币的年代：A.西汉晚期 B.东汉早期 C.东汉中期 D.东汉晚期 E.蜀汉 F.西晋", "Level": 2, "Answer Type": "multipleChoice", "Final answer": "D", "file_name": "283.png", "Answer Explanation": "该五铢钱出自河北定县M43，该墓为东汉晚期墓，根据墓葬情况推测为中山穆王刘畅之墓，史载其死于熹平三年，可作为该钱币年代下限参考。观察钱币本身，钱轮较细窄，制作粗糙，字形局促短小，符合东汉晚期铸钱特征。"}
{"task_id": "293", "Question": "When was this letter written?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "860 A.D.", "file_name": "293.png", "Answer Explanation": "This is a letter written by Pope Nicholas I in 860 to Archbishop Hincmar and all the archbishops and bishops consecrated in the Bald Charles Kingdom."}
{"task_id": "020", "Question": "Please finish the blank with a number.\nYet their economic, social and cultural power survived – 64 per cent of all aristocratic electors in the 1830s paid above 1000 francs in direct taxes, and 238 of the wealthiest ____grands notables were nobles.", "Level": 1, "Answer Type": "exactMatch", "Final answer": 512, "file_name": "", "Answer Explanation": "Yet their economic, social and cultural power survived – 64 per cent of all aristocratic electors in the 1830s paid above 1000 francs in direct taxes, and 238 of the wealthiest 512 grands notables were nobles.\n"}
{"task_id": "116", "Question": "Who wrote the epitaph shown in the image?", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Wei Zhenzhi", "file_name": "116.jpg", "Answer Explanation": "The first two columns of the epitaph provide the information needed for this question"}
{"task_id": "221", "Question": "Where does the text come from?）(Answer Format:Document Name；Year)", "Level": 1, "Answer Type": "exactMatch", "Final answer": "Trade Card of Madame Gaubert, 1836", "file_name": "221.png", "Answer Explanation": "The paper (\"A Gendered Enterprise: Placing Nineteenth-Century Businesswomen in History\")demonstrates the text is written on Trade Card of Madame Gaubert, 1836."}
{"task_id": "240", "Question": "Whose studio created this outstanding Gothic altarpiece?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Bernat Saulet ", "file_name": "240.png", "Answer Explanation": "Altarpiece of the Passion, Death, Resurrection and Ascension of Christ\nBernat Saulet1325/1350"}
{"task_id": "248", "Question": "In what city was this teapot made?", "Level": 2, "Answer Type": "exactMatch", "Final answer": "Staffordshire", "file_name": "248.png", "Answer Explanation": "Coffee pot, black basalt stoneware, painted in enamels with chinoiserie decoration and gilded."}
